{
    "JK Sri Kamatchi Nagar Plots": "JK Sri Kamatchi Nagar offers plots in Mahabalipuram, Chennai.  While specific details about available plots are limited, this development by JK Group Chennai provides an opportunity to build your dream home in this historic coastal town. Imagine designing a bespoke residence tailored to your exact needs, surrounded by the unique charm of Mahabalipuram.",
    "Zen Plots": "Find your inner peace at Zen Plots, Mahabalipuram, Chennai.  Choose from a range of plot sizes starting from 575 sqft, perfect for a cozy retreat, up to a more expansive 1704 sqft, ideal for a larger family home.  Possession started in March 2024, allowing you to begin construction on your tranquil escape without delay. Prices start at an affordable ₹7.19 L, reaching ₹21.30 L.  RERA ID: TN/35/Layout/0432/2024 dated 06/02/2024 provides added assurance.",
    "RP Pallava Garden Plots": "RP Pallava Garden, developed by RP, presents plots in Mahabalipuram, Chennai. While details on current availability are limited, this project, completed in November 2012, allows you to create a personalized living space in a well-established community.",
    "Manju Kyra Plots": "Manju Kyra offers plots in Mahabalipuram, Chennai, brought to you by Manju Groups. This project, completed in July 2011, provides an opportunity to build a custom home in a mature neighborhood.  Although specific plot information is limited, the development offers a foundation for creating your perfect residence.",
    "Mehta Pritee 3BHK": "Mehta Pritee by Mehta Havens features 3BHK apartments spanning 1500 sqft in Mahabalipuram, Chennai. This project, completed in January 2014, presents spacious living with three bedrooms and three bathrooms. Picture yourself relaxing in your comfortable new home, enjoying the vibrant coastal atmosphere of Mahabalipuram.",
    "Mettupakkam MF Prayag Plots": "Mettupakkam MF Prayag presents plots in Mahabalipuram, Chennai, with sizes ranging from 10481 sqft to 16663 sqft and prices from ₹57.65 L to ₹91.65 L. Imagine building a sprawling estate on these expansive plots, completed in January 2015, and enjoying the serene surroundings.",
    "Olive Pine Beach Plots": "Olive Pine Beach, by Olive Beach, offers plots in Mahabalipuram, Chennai. This project, completed in November 2011, presents an opportunity to create your dream coastal retreat. Though plot size details are currently unavailable, envision yourself relaxing by the beach in your personalized home.",
    "Engineers Coastal Residency Plots": "Engineers Coastal Residency provides plots in Mahabalipuram, Chennai, developed by Engineers. While current availability is limited, this project, completed in May 2012, offers the chance to design a custom home in a convenient location.",
    "Victory Rising Plots": "Victory Rising, by Victory Homes, offers plots in Mahabalipuram, Chennai, ranging from 442 sqft to 2381 sqft, with prices starting from ₹12.81 L. Imagine building your dream home on a plot perfectly suited to your needs, surrounded by the vibrant coastal atmosphere. The project is estimated to be completed by June 2024.",
    "Pearl Ocean Front Plots & 3BHK": "Pearl Ocean Front, by Pearl Beach, presents a mix of plots and 3BHK apartments in Mahabalipuram, Chennai. While the listed units are currently sold out, this project, completed in August 2022, offers a glimpse of coastal living at its finest. Imagine stepping onto your balcony and enjoying breathtaking ocean views. The plots range from 1420 sqft to 3814 sqft, providing ample space for your dream home.",
    "Olive Little Olive Plots": "Olive Little Olive, developed by Olive Beach, features plots in Mahabalipuram, Chennai. This project, completed in September 2006, offers an established community setting for building your dream home. Although specific plot details are limited, envision yourself in a personalized living space, surrounded by the unique charm of Mahabalipuram.",
    "Olive Pine Beach II Plots": "Olive Pine Beach II by Olive Beach presents plots in Mahabalipuram, Chennai.  Though specifics on current availability are limited, this project, completed in July 2014, provides the foundation for building a custom home in a well-established community.",
    "My Green Citadel Plots": "My Green Citadel, by My PropTree, offers plots in Mahabalipuram, Chennai. While specifics are limited, this project, completed in November 2013, provides an opportunity to create a custom living space in a well-developed community.",
    "Chattels Boat Club II Plots": "Chattels Boat Club II, developed by Chattels Inc, offers plots ranging from 5100 sqft to 13285 sqft in Mahabalipuram, Chennai. This project, completed in September 2013, presents an opportunity to build a spacious home in a well-established neighborhood.",
    "Nuworld Little Kerala Plots": "Nuworld Little Kerala by Nuworld Makers offers plots in Mahabalipuram, Chennai. Though current availability details are limited, this project, completed in February 2023, presents the chance to build your ideal home in a newly developed community.",
    "2 BHK Flat in Pallikaranai, Chennai": "This under-construction 2 BHK flat in Pallikaranai offers convenient access to key locations. Imagine quick trips to A2B, Kauveri Hospital, DAV School, Jerusalem Engineering College, and Dr. Kamachi Hospital, all within a short distance.  At 946 sq. ft., this up-and-coming residence promises comfortable living.",
    "3 BHK Flat in Pallikaranai, Chennai (Keerthi Murugas)": "Experience luxury living in this spacious 3 BHK flat in Pallikaranai's Keerthi Murugas. With 1624 sq. ft. of space, this under-construction apartment provides ample room for a growing family. Imagine designing your dream home with plenty of room for entertaining and relaxing.",
    "3 BHK Flat in Pallikaranai, Chennai (Kamakoti Nagar)": "This north-facing 3 BHK flat in Kamakoti Nagar, Pallikaranai, offers premium living at an attractive price.  With 1510-1542 sq. ft. of space, this under-construction apartment provides the perfect canvas for your personal touch. Enjoy modern amenities including covered car parking, 24/7 CCTV surveillance, and a video door phone, ensuring security and peace of mind.",
    "3 BHK Villa in Pallikaranai, Chennai (MGP Prosper Villa)": "Embrace comfort and style in this ready-to-move-in 3 BHK villa in Pallikaranai's MGP Prosper Villa. Spanning 1200 sq. ft., this meticulously designed home offers modern living at its finest. Enjoy the convenience of a well-established community and a thoughtfully planned layout.",
    "Plot in Pallikaranai, Chennai (880 sq. ft.)": "Invest in your future with this 880 sq. ft. plot in Pallikaranai, Chennai. Situated on a wide road, this plot offers excellent potential for building your dream home in a desirable location. Priced at 30 Lac, this represents a fantastic investment opportunity.",
    "Plot in Pallikaranai, Chennai (1675 sq. ft.)": "This expansive 1675 sq. ft. plot in Pallikaranai, Chennai, presents an exceptional opportunity for those seeking a larger canvas for their dream home.  Located on a wide road with excellent infrastructure, this plot is perfect for creating a custom residence in a desirable location. Contact for pricing.",
    "3 BHK Flat in Pallikaranai, Chennai (Sea View)": "Enjoy breathtaking sea views from this ready-to-move-in 3 BHK flat in Pallikaranai.  With 1137 sq. ft. of living space, this apartment on a wide road offers comfortable and scenic living. Imagine waking up to stunning ocean vistas and unwinding on your balcony with the refreshing sea breeze.",
    "2 BHK House in Kovilambakkam, Chennai": "This ready-to-move-in 2 BHK house in S. Kolathur, Kovilambakkam, offers comfortable living with a north-facing plot.  Featuring two bedrooms, a big hall, and a kitchen, this 1100 sq. ft. house is close to leading schools, engineering colleges, and Chennai's IT hub.  Located on a wide 30ft road, this property is perfect for families and investors alike.",
    "2 BHK Flat in Jalladianpet, Chennai": "This ready-to-move-in 2 BHK resale flat in Jalladianpet, Pallikaranai offers affordable living in a developing area. At 966 sq. ft., this flat features a spacious hall and a pollution-free environment. Enjoy convenient access to nearby schools and colleges, and the added benefit of a gated community coming up nearby.",
    "4 BHK Villa in S Kolathur, Chennai": "Experience luxurious living in this semi-furnished 4 BHK villa in S Kolathur, Chennai.  Spanning 2400 sq. ft., this 8-10-year-old property provides ample space and comfort for a large family.  Enjoy the convenience of a well-established neighborhood and the elegance of a thoughtfully designed villa.",
    "3 BHK Flat in Thoraipakkam, Chennai": "This under-construction 3 BHK flat in Thoraipakkam, Chennai offers modern amenities and a convenient location.  With 1292 sq. ft. of saleable area, this apartment boasts features like CCTV, premium lift, anti-slippery tiles in toilets, a door camera, and 100% Vastu compliance.",
    "3 BHK Flat in Madipakkam, Chennai": "Located just 300 meters from the 200ft radial road and Kamatchi Hospital, this under-construction 3 BHK flat in Ram Nagar South Extn, Madipakkam, provides convenient access to OMR. With 1199 sq. ft. of saleable area, this CMDA and RERA approved apartment is part of a premium development with only 4 flats per floor and two interconnected wings across 5 floors.",
    "1 BHK Flat in Perumbakkam, Chennai (Ozone Greens)": "This ready-to-move-in 1 BHK flat in Ozone Greens, Perumbakkam, offers a breakthrough price for an unmatched living experience.  Developed by a renowned builder, this 551 sq. ft. apartment ensures quality construction and a trusted investment option. Located in a prime area of Chennai, Ozone Greens offers convenient access to city amenities.",
    "1 BHK Flat in Perumbakkam, Chennai (Ozone Greens - 651 sq. ft.)": "This cozy 1 BHK flat in Ozone Greens, Perumbakkam, is the perfect starter home or investment property. With 651 sq. ft. of well-designed living space, this ready-to-move-in apartment offers comfortable living in a prime Chennai location.",
    "2 BHK Flat in Thoraipakkam, Chennai (Parkside Villas Green)": "This well-maintained and well-ventilated 2 BHK flat in Parkside Villas Green, Thoraipakkam, presents a great investment opportunity.  With 1000 sq. ft. of built-up area, this ready-to-move-in apartment offers comfortable living in a sought-after location.",
    "Plot in Thoraipakkam, Chennai (OMR)": "Invest in this strategically located plot in Thoraipakkam on OMR, Chennai.  With plots ranging in size, you can find the ideal plot to suit your preferences. Contact for pricing and availability.",
    "2 BHK Flat in Thoraipakkam, Chennai (Grand Springs)": "Design your dream home in this unfurnished 2 BHK flat in Grand Springs, Thoraipakkam.  With 806 sq. ft. of space, this under-construction apartment provides a blank canvas for your creativity. Enjoy the benefits of living in a prestigious project in the heart of Chennai.",
    "3 BHK Villa in Thoraipakkam, Chennai": "Looking for a prime plot to build your dream villa in Chennai?  This 1600 sq. ft., ready-to-move-in 3 BHK villa in Thoraipakkam offers the perfect blend of convenience, safety, and affordability.  Located in a secure and sought-after area, this villa is ideal for families seeking a comfortable and peaceful lifestyle.",
    "Plot in Thoraipakkam, Chennai (1230 sq. ft.)": "Build your dream home on this spacious 1230 sq. ft. plot in Thoraipakkam, Chennai. Located in a thriving locality, this plot presents a lucrative investment opportunity for both homebuyers and property investors.",
    "2 BHK Flat in Kovilambakkam, Chennai": "This ready-to-move-in 2 BHK flat in Kovilambakkam offers peaceful living in a small, secure community.  With 875 sq. ft. of built-up area, this well-maintained flat includes covered parking and safety grills for each independent unit.  Enjoy the convenience of nearby schools and temples.",
    "Shop in Medavakkam, Chennai": "Invest in this prime, unfurnished shop in Medavakkam, Chennai. Situated on a wide road, this 1125 sq. ft. shop offers excellent potential for businesses looking to expand or entrepreneurs seeking a strategic location. Design your ideal workspace in this versatile commercial space.",
    "3 BHK Builder Floor in Medavakkam, Chennai": "This resale 3 BHK builder floor in Medavakkam offers convenient living on Medavakkam Main Road.  With 1475 sq. ft. of space, this west-facing property features 3 bathrooms, two balconies, and open car parking within a gated community.  Located near an upcoming metro station, this second-floor unit is priced at 78 lakh.",
    "Plot in Medavakkam, Chennai (GR Platinum City)": "Invest in a CMDA and RERA approved plot in GR Platinum City, East Tambaram/Medavakkam in Kovilanchery.  Priced at 5099/- per sq. ft., this plot is fully surrounded by residential areas and enjoys convenient access to the Kovilanchery bus stop just 100 meters away. 80% bank loan is available.",
    "2.5 BHK Flat in Karapakkam, Chennai (Sai Property)": "This well-furnished 2.5 BHK flat in Sai Property, Karapakkam offers spacious living with 1450 sq. ft. of area. Contact for pricing and availability.",
    "Plot in Madipakkam, Chennai (4200 sq. ft.)": "This large 4200 sq. ft. plot in Madipakkam, Chennai, is a hidden gem waiting to be discovered. Located in the southern part of the city, this plot offers a peaceful environment with easy access to city amenities.  This is a great opportunity to build your dream home or invest in a valuable piece of land.",
    "4 BHK Flat in Madipakkam, Chennai (Block of 8 Flats)": "This unique opportunity allows you to purchase a block of 8 flats in Madipakkam, Chennai.  The block includes two 2 BHK units and six 1 BHK units, currently occupied by tenants and owners.  This 22-year-old building presents a potential investment for those looking to acquire multiple units at once. Contact for pricing and further details.",
    "2 BHK Flat in Madipakkam, Chennai (Metro Homes)": "This newly built 2 BHK flat in Metro Homes, Madipakkam, offers peaceful living in a safe and secure locality. With 950 sq. ft. of built-up area, this ready-to-move-in apartment is ideal for families seeking a comfortable and convenient lifestyle.",
    "1 BHK Flat in Madipakkam, Chennai (RB Reka Flates)": "This well-maintained, semi-furnished 1 BHK flat in RB Reka Flates, Madipakkam, is perfectly situated on a wide road. With 600 sq. ft. of built-up area, this ready-to-move-in apartment is ideal for individuals or couples seeking a convenient and affordable home.",
    "3 BHK Flat in Sholinganallur, Chennai": "This fully furnished, well-maintained 3 BHK flat in Sholinganallur offers ready-to-move-in convenience.  With 1223 sq. ft. of space within a secure gated community, this apartment is ideally located near schools, an upcoming metro station, and a shopping mall. Enjoy easy access to major IT companies like HCL, Wipro, CTS, Tech Mahindra, and Ford.",
    "3 BHK Flat in Medavakkam, Chennai (S P Lakeview)": "This under-construction 3 BHK flat in S P Lakeview, Medavakkam, offers spacious and luxurious living for families.  Enjoy a wide road view from this 1350 sq. ft. apartment in a reputed builder's project.",
    "Plot in Nanmangalam, Chennai (Nattarasanpattu)": "Discover your dream plot in Nattarasanpattu, Nanmangalam, Chennai. This 870 sq. ft. plot on a wide road is the perfect place to build your dream home. Enjoy the tranquility and convenience of this sought-after location.",
    "3 BHK Flat in Thoraipakkam, Chennai (Akshaya Tango)": "Experience luxurious beachfront living in this semi-furnished 3 BHK flat in Akshaya Tango, Thoraipakkam. With 2153 sq. ft. of space, this ready-to-move-in apartment boasts stunning beach views and best-in-class amenities. Imagine relaxing by the beach after a long day and enjoying the serene coastal lifestyle.",
    "3 BHK Flat in Senthil Nagar, Chennai (Grand Excelencia)": "This unfurnished 3 BHK flat in Grand Excelencia, Senthil Nagar, offers 939 sq. ft. of living space in a serene Chennai neighborhood.  Priced at 1.10 Cr, this ready-to-move-in apartment provides a comfortable and peaceful lifestyle.",
    "3 BHK Flat in Sholinganallur, Chennai (Near Metro)": "This recently added, ready-to-move-in 3 BHK flat in Sholinganallur is conveniently located near a metro station. With 1850 sq. ft. of saleable area, this apartment offers a peaceful vicinity, safe and secure locality, and a quick deal opportunity.  Enjoy close proximity to schools and the convenience of urban living.",
    "3 BHK Flat in Velachery, Chennai (Nilay & Nivas)": "This spacious 3 BHK flat in Nilay & Nivas, Velachery, offers luxurious living at a breakthrough price.  With 1516 sq. ft. of saleable area, this under-construction apartment boasts a prime location near the city center. Enjoy a family-friendly neighborhood and the convenience of city living.",
    "Oblong Crescent Community": "Welcome to Oblong Crescent Community, your plot of land awaiting your dream home in scenic Mahabalipuram, Chennai.  Plots range from a cozy 963 sqft to a sprawling 2708 sqft, offering a size for every vision.  Imagine building your perfect home amidst this tranquil setting, with possession starting as early as January 2025.  Prices start from an attractive ₹14.45 L and go up to ₹40.62 L, providing flexibility to match your budget.",
    "Victory Rising": "Victory Rising in Mahabalipuram, Chennai offers you the chance to create a home that truly reflects your style.  With plot sizes ranging from a compact 442 sqft to a generous 2381 sqft, there's a canvas here for every aspiration.  Possession began in June 2024, so you can start building your future right away. Prices begin at ₹12.81 L and reach ₹69.03 L, offering options for various budgets.",
    "CCP Signature City": "CCP Signature City in Mahabalipuram, Chennai, presents an opportunity to build your dream home in a well-planned community. Although currently sold out, keep an eye on this project for future releases.  With various plot sizes previously available ranging from 1100 sqft to 2300 sqft, it's a development worth following for those seeking a desirable Mahabalipuram address. Possession commenced in September 2024.",
    "BGMR Sunrise Avenue": "Imagine waking up to the sun rising over your very own piece of Mahabalipuram at BGMR Sunrise Avenue.  While currently sold out, this community offered a variety of plot sizes, from a compact 600 sqft to a sprawling 3209 sqft.  Possession started in July 2023, giving residents ample time to settle in and create their ideal homes.",
    "G Square Dynasty": "Experience royal living at G Square Dynasty in Mahabalipuram, Chennai.  This prime development offers plots starting from 1800 sqft, providing ample space for a grand residence. Possession began in May 2024. Priced at ₹34.18 L, this is an opportunity to invest in a prestigious address. RERA ID: TN/01/Regularization-Layout/023/2023 adds to the peace of mind.",
    "Nuworld Little Kerala": "Nuworld Little Kerala in Mahabalipuram, Chennai, offered a slice of Kerala's charm.  While currently sold out, the project featured plots ranging from 600 sqft to 2400 sqft, capturing the essence of comfortable living.  Possession began in February 2023, allowing residents to embrace the serene lifestyle.",
    "Akshaya Brindavanam": "Discover the blissful life at Akshaya Brindavanam, Mahabalipuram.  Plots range from a cozy 581 sqft to a spacious 2684 sqft, with prices starting from ₹13.36 L and going up to ₹61.73 L. Possession started in February 2023, letting you start living your dream sooner than you think.  RERA ID: TN/01/Layout/9737/2022 assures you of a secure investment.",
    "Homescape Light House": "Homescape Light House in Mahabalipuram, Chennai, offered both plots and apartments.  While currently sold out, the plots ranged from 1200 sqft to 2400 sqft. Apartment configurations included compact 1BHK+1T units of 480 sqft and spacious 2BHK+2T units of 750 sqft. Possession began in August 2022.",
    "JK Sri Kamatchi Nagar": "JK Sri Kamatchi Nagar in Mahabalipuram offered plots of 1120 sqft and 1155 sqft, providing a comfortable space for your dream home. Although currently sold out, this development, with possession starting in July 2022,  presents a desirable location in Mahabalipuram.",
    "Pearl Ocean Front": "Imagine waking up to the sounds of the ocean at Pearl Ocean Front in Mahabalipuram.  While now sold out, this luxurious development offered plots ranging from 1420 sqft to a sprawling 3814 sqft, as well as spacious 3BHK+3T apartments of 636 sqft.  Possession commenced in August 2022.  DTCP Approval provides added confidence.",
    "Sudhagars Residencies": "Sudhagars Residencies in Mahabalipuram, Chennai, offers select plots for sale. Sizes range from 1275 sqft at ₹31.88 L to 2254 sqft at ₹56.35 L, offering a blend of space and affordability. Possession started in July 2022. RERA ID: TN/01/layout/5973/2022 provides an added layer of security.",
    "One Path Sai Nagar": "One Path Sai Nagar in Mahabalipuram, Chennai offered a range of plots starting from a compact 600 sqft to a larger 2500 sqft.  While currently sold out, possession for this development started in February 2022.",
    "Hidden Bay Layout": "Hidden Bay Layout in Mahabalipuram, Chennai, offered a secluded retreat with plots ranging from 1428 sqft to a vast 9664 sqft. Although now sold out, this project provided a unique opportunity for a private escape.  Possession started in November 2021.  RERA ID: TN/04/Layout/0066/2021 ensures peace of mind.",
    "Adityaram Signature City Phase II": "Adityaram Signature City Phase II in Mahabalipuram offered plots ranging from 600 sqft to 2400 sqft. Though currently sold out, this development, with possession starting in July 2021, provided flexible plot sizes for various needs. RERA ID: TN/01/Layout/0183/2021 ensures transparency and accountability.",
    "2 BHK Apartment in Navalur (Standalone Building)": "Located near Mount Litera Zee School on Thalambur Road, this 2 BHK apartment in a standalone building offers approximately 1300 sqft of built-up area. Enjoy the convenience of bike parking and north-facing views. Priced at ₹95 Lacs.",
    "4 BHK Villa in Casa Grande Pavillion": "This luxurious 4 BHK villa in Casa Grande Pavillion (Thazhambur) offers a spacious 2576 sqft built-up area, perfect for a growing family. Features include car parking and an east-facing orientation. Asking price is ₹2.14 Crores.",
    "3 BHK House near Casagrand Grandio": "Situated close to the prestigious Casagrand Grandio, this independent 3 BHK house offers a comfortable 1820 sqft built-up area. Enjoy the convenience of both bike and car parking, along with east-facing views. This property is listed at ₹1.75 Crores.",
    "4+ BHK Villa in Greenwoodcity": "Nestled on Thalambur Road near Navalur Junction on OMR, this expansive 4+ BHK villa in Greenwoodcity boasts a generous 4125 sqft built-up area. Amenities include bike and car parking, with an east-facing orientation. This luxurious property is priced at ₹2.75 Crores.",
    "4+ BHK Apartment in Navallur": "Located near Jamia Masjid and Islamic Center and Hotel Navallur, this spacious 4+ BHK apartment in a standalone building offers a substantial 2700 sqft built-up area, ideal for larger families.  With car parking available, this property is priced at ₹4.5 Crores.",
    "3 BHK Apartment in Thulasi Happy Homes Apartments": "Situated in Thalambur, this 3 BHK apartment in Thulasi Happy Homes Apartments offers a comfortable 1370 sqft built-up area. Enjoy features like bike and car parking and south-facing views. It's listed at an attractive price of ₹70 Lacs.",
    "3 BHK Apartment in Olympia Opaline (near Vivira Mall)": "Located near Vivira Mall on Rajiv Gandhi Salai in Navalur, this 3 BHK apartment in Olympia Opaline offers 1576 sqft of built-up area, north-east facing views and bike and car parking. The listed price is ₹1.25 Crores.",
    "2 BHK Apartment in Emami Tejomaya (Egattur)": "Situated in Egattur on Old Mahabalipuram Road, this 2 BHK apartment in Emami Tejomaya offers 1158 sqft of built-up area. Amenities include bike and car parking with a south-facing orientation. Priced at ₹98 Lacs.",
    "2 BHK Apartment in Emami Tejomaya (Block-E)": "This 2 BHK apartment in Emami Tejomaya Block-E (Egattur) offers 1174 sqft of built-up area, with a south-facing aspect. Car parking is available.  This property is listed at ₹94.5 Lacs.",
    "2 BHK Apartment near Navalur Post Office": "Located near Navalur Post Office on Rajiv Gandhi Salai, this 2 BHK apartment in Sri Sai Apartment offers a convenient 1000 sqft built-up area. Enjoy bike and car parking and south-facing views. It's priced at ₹49 Lacs.",
    "2 BHK Apartment in Matheswari Flat Navalur": "Located at 20, VOC St, Suresh Nagar, Navalur, this 2 BHK apartment in Matheswari Flat offers 1322 sqft of built-up area, east-facing views and bike and car parking. The price is ₹75 Lacs.",
    "2 BHK Apartment in Mahadavera Flats": "Located on Voc Street, this 2 BHK apartment in Mahadavera Flats offers a comfortable 1400 sqft built-up area with east-facing views.  Bike and car parking are available.  Listed for ₹85 Lacs.",
    "2 BHK House near Navalur EB Office and SIPCOT IT Park": "This 2 BHK independent house is conveniently situated near SIPCOT IT Park and Navalur EB Office. It features 1000 sqft of built-up area and bike and car parking. Priced at ₹45 Lacs.",
    "2 BHK Apartment in Sweet Homes Hormony Navalur": "Located near Thangavell College in Nadaisan Nagar, this 2 BHK apartment in Sweet Homes Hormony offers 1000 sqft of built-up area. With north-east facing views and bike and car parking, it's priced at ₹77 Lacs.",
    "2 BHK Apartment in Olympia Opaline (near OMR Food Street)": "This 2 BHK apartment in Olympia Opaline is conveniently located near OMR Food street. It offers a comfortable 1095 sqft built-up area, north-facing views, and bike and car parking. Listed at ₹72 Lacs.",
    "2 BHK Apartment in Olympia Opaline (opposite AGS Cinema)": "This 2 BHK in Olympia Opaline is conveniently located opposite AGS Cinema.  Enjoy a 1249 sqft built-up area, east-facing views, and car parking.  The listed price is ₹78 Lacs.",
    "3 BHK Apartment in Olympia Opaline": "Located near OMR, this 3 BHK apartment in Olympia Opaline offers a spacious 1386 sqft built-up area and north-facing views. Bike and car parking are available.  Listed price is ₹1.1 Crores.",
    "3 BHK Apartment in Olympia Opaline (near OMR Road)": "Located in Seevaram, Perungudi on OMR Road, this spacious 3 BHK apartment in Olympia Opaline offers a substantial 1800 sqft built-up area and bike and car parking. Priced at ₹1.2 Crores.",
    "2 BHK Apartment in Olympia Opaline": "Located in Navalur, this 2 BHK apartment in Olympia Opaline offers 1224 sqft of built-up area and car parking.  It is listed at ₹72 Lacs.",
    "3 BHK Apartment in Olympia Opaline (opposite Vivira Mall)": "Located opposite Vivira Mall, this 3 BHK apartment in Olympia Opaline offers a well-designed 1792 sqft built-up area and bike and car parking. Priced at ₹92 Lacs.",
    "3 BHK Apartment in Olympia Opaline (near OMR Navalur)": "Located near OMR in Navalur, this 3 BHK apartment in Olympia Opaline offers 1792 sqft of built-up area, east-facing views and car parking. Listed at ₹1.4 Crores.",
    "3 BHK Apartment in Harmony": "Located on Survey No. 22, Rajiv Gandhi Salai, opposite OMR Food street and near Dindigul Thalappakatti Restaurant, this 3 BHK apartment in Harmony offers 1294 sqft of built-up area and south-facing views, with bike and car parking available.  Priced at ₹95.5 Lacs.",
    "Dhana Teja Layout Plots": "Imagine owning one of three corner plots in the exclusive Dhana Teja layout, just a short stroll from the vibrant ECR high road. These approved plots, spanning 8,400 sqft, are ready for you to build your dream home.  At a competitive price of ₹1,600/sqft, this is an exceptional opportunity to create your perfect seaside escape in Mahabalipuram.",
    "G Square Dynasty Land": "Explore the promising investment opportunities at G Square Dynasty, where ready-to-move land awaits.  Picture yourself enjoying a refreshing dip in the swimming pool, strolling through the lush park, or relaxing in the senior citizen sitout.  With a starting price of ₹34.18 L, and convenient access to Maamallan CBSE School and Shri Sathya Sai Hospital, this is the ideal place to build your future.",
    "Arun Excello Ziva": "Discover the beautifully designed apartments and villas of Arun Excello Ziva. Choose from stylish 1 BHK apartments starting at ₹45.15 L, spacious 2 BHK apartments ranging from ₹64.4 L to ₹77 L, or luxurious 3 BHK villas priced at ₹1.05 Cr. With a total of 146 units, you'll find the perfect home to suit your lifestyle. Enjoy resort-style living with amenities like a swimming pool, a state-of-the-art gymnasium, and an exclusive clubhouse.",
    "ECR DTCP Plot (1,800 sqft)": "This north-facing, 1,800 sqft DTCP-approved plot, overlooking the main road near Pattipulam, offers an excellent opportunity to build your dream home. Located near Mahabalipuram, imagine waking up to the sound of the waves and enjoying the tranquility of coastal living.",
    "OMR Nanjai Property (6,098 sqft)": "Own a piece of serene nanjai land on OMR, spanning 6,098 sqft. This north-facing plot enjoys a prime location near the ECR-OMR junction, with easy access to Mamallan School. Imagine building your dream home surrounded by lush greenery, yet still within easy reach of city conveniences.",
    "OMR Road Property (239,580 sqft)": "This expansive 239,580 sqft road property, located on the Mahabalipuram-Thirukazhukundram road, is a developer's dream. With a generous 450-foot frontage and layout land on both sides, the possibilities are endless. Its proximity to the Four Points Sheraton adds to its appeal.",
    "ECR DTCP Plot (1,883 sqft)": "Build your dream home on this north-facing, 1,883 sqft DTCP-approved plot. Overlooking the main road in Pattipulam, opposite Tiger Cave, this prime location offers the perfect blend of tranquility and accessibility.",
    "ECR Commercial/Residential Plot (3,593 sqft)": "This versatile 3,593 sqft plot on ECR is ideal for both commercial and residential purposes. Its prime location offers stunning views and easy access to Mahabalipuram, a UNESCO World Heritage Site.  Imagine creating a thriving business or a luxurious home in this sought-after location.",
    "KG Emerald Beach Plot (9,239 sqft)": "Located within a secure gated community on ECR, this 9,239 sqft plot offers a unique opportunity to own a piece of paradise. Imagine building your dream home amidst serene surroundings and high-end bungalows, with 24/7 security and easy access to the beach.  DTCP approval is in progress.",
    "State Highway Property (1,043 sqft)": "This north-facing 1,043 sqft plot is located on a state highway, adjacent to the Madras Football Club.  With convenient amenities like blacktop road, avenue trees, solar lights, and portable water, this plot is ready for your dream home construction.  Imagine enjoying the benefits of a well-planned community in a desirable location.",
    "Mahabalipuram Beach Property (10,799 sqft)": "Indulge in the luxury of beachside living with this 10,799 sqft plot near Radisson Blu in Mahabalipuram. Enjoy breathtaking views of the Bay of Bengal and direct access to pristine beaches. Imagine building your dream home in this prestigious location, perfect for creating unforgettable memories.",
    "Poonjeri Compounded Property (2,400 sqft)": "This fully compounded 2,400 sqft property in Poonjeri offers a tranquil escape, just a short drive from ECR and Chettinadu Hospital. With a reasonable price, excellent location, and good groundwater, this is a fantastic opportunity to build your dream home.",
    "3 BHK Beachfront Villa": "Step into your own private oasis with this exquisite 3 BHK villa overlooking the beach and pool.  Surrounded by lush gardens, this ready-to-move villa offers 14,400 sqft of luxurious living space.  Imagine waking up to stunning ocean views and spending your days relaxing by the pool.",
    "Kadambari Approved Land (13,000 sqft and 6,000 sqft)": "Own not one, but two large tracts of approved land in Kadambari on East Coast Road near Mahabalipuram.  Choose from a 13,000 sqft plot or a 6,000 sqft plot, both with pattas and copious groundwater.  Imagine creating your ideal estate in this tranquil location.",
    "Arun Compact Homes Behag 1 Plot (600 sqft)": "This 600 sqft road-facing plot in Arun Compact Homes Behag 1 is an excellent investment opportunity. Take advantage of the end-sell offer and secure your piece of land on ECR.",
    "Arun Excello Compact Homes Triveni 2 BHK Flat (595 sqft)": "This well-maintained, ground-floor 2 BHK apartment in Arun Excello Compact Homes Triveni offers comfortable and secure living on the scenic ECR.  Enjoy easy access with no stairs to climb, and move-in ready convenience.  Imagine relaxing on your ground floor patio, surrounded by the tranquility of coastal living.",
    "ECR Beach Proximity Plot (2,400 sqft)": "Located just 1km from the road near GVS homes, this east-facing 2,400 sqft plot offers proximity to the beach. Imagine building your dream home and enjoying the vibrant ECR lifestyle.",
    "ECR Backwaters Plots (8,000 sqft each)": "Own a piece of paradise with these residential plots near the beach, featuring stunning backwaters right behind the area. Imagine waking up to the tranquil sound of the crystal-clear water of the Palar backwaters, flowing all year round.",
    "Arun Excello Compact Homes Triveni 2 BHK Flat (1,025 sqft)": "This 2 BHK flat, located on the 3rd floor of Arun Excello Compact Homes Triveni, offers 1,025 sqft of super built-up area, with an additional 572 sqft of UDS.  Situated opposite Dhalakakshmi Srinivasan College of Engineering on ECR, Mahabalipuram, this apartment provides convenient access to educational institutions and the vibrant coastal lifestyle.",
    "Mahabalipuram Ready-to-Build Plot (9,600 sqft)": "This spacious 9,600 sqft plot in Mahabalipuram is ready for your dream home. Guarded and secluded with a boundary wall, this freehold property offers immediate possession.  Imagine building your ideal retreat in this tranquil location.",
    "Mahabalipuram Boat Club Opposite Land (174,240 sqft)": "This expansive 174,240 sqft plot, located opposite the Mahabalipuram Boat Club, offers immense potential. With ongoing farmhouse construction in the vicinity, this is a prime location for development. Imagine creating a thriving community or a luxurious retreat in this sought-after area.",
    "Residential Plot with Villa Option (1,800 sqft)": "Choose to build your own villa or invest in this 1,800 sqft plot within a sprawling 28.3-acre community with 296 residential units. The builder offers a build-assist program for a 3 BHK villa (1,525 sqft built-up area) for ₹69 L onwards. Enjoy access to over 40 world-class amenities spread across 1.6 acres.",
    "Vanavil Privilege Estate Plot (1,300 sqft)": "This 1,300 sqft plot in Vanavil Privilege Estate is just 3km from Mahabalipuram. Ideal for investment, this prime land will benefit from upcoming developments in the area, including a new flyover.  Imagine creating your seaside retreat or a charming guesthouse overlooking the stunning coastal landscape.",
    "Mahabalipuram Dry Land (18,291 sqft)": "Own a substantial piece of dry land in Mahabalipuram, spanning 18,291 sqft (42 cents). Located on Thirukalukundram road, along the Chennai-Mahabalipuram stretch, this patta land offers clear documents and immense potential. Imagine capitalizing on the tourism and expat presence in this thriving coastal town.",
    "4 BHK Farmhouse (10,000 sqft)": "Escape the city stress in this serene 4 BHK farmhouse, under construction on a 10,000 sqft plot in Mahabalipuram. Imagine relaxing in your private sanctuary, surrounded by tranquil landscapes and enjoying the comforts of this spacious home.",
    "MME Gold City 2 BHK Flat (1,200 sqft)": "This best-in-class 2 BHK flat in MME Gold City offers 1,200 sqft of built-up area. Located on Old Mahabalipuram Road, Chennai, this ready-to-move apartment provides convenient access to city amenities and the vibrant coastal lifestyle.",
    "DivaySree Hub6 Residential Plots in Thiruporur": "Imagine building your dream home just the way you've always envisioned it. At DivaySree Hub6, a collection of residential plots nestled in the rapidly developing Thiruporur area of OMR, Chennai, that dream becomes a tangible reality.  Choose the perfect plot size, starting at 1200 sq.ft, and design a home that reflects your unique style and needs.  With an average price of ₹3.2k/sq.ft and possession slated for January 2025, this is a smart investment opportunity in a prime location.  The upcoming metro project promises even greater connectivity, while existing proximity to major IT hubs in Siruseri, Sholinganallur, and Navalur ensures a convenient lifestyle.  Enjoy easy access to essentials and leisure, with the Vellore International School just a short drive away and the Green Garden Restaurant offering delightful dining experiences nearby. Secure your piece of the future at DivaySree Hub6 and start building the life you deserve.",
    "LML Skyliving Tambaram": "Step into elevated living at LML Skyliving in Tambaram, Chennai. This under-construction 2 BHK apartment, set to be ready by April 2028, offers 1185 sqft of modern living within a sprawling 1.4-acre community.  Imagine coming home to one of the 175 exclusive apartments, spread across two elegant 13-story towers. Unwind after a long day on your private balcony or head down to the impressive 13,000 sqft, 5-star clubhouse.  Picture yourself enjoying a friendly game of badminton in the indoor court, catching a movie in the spacious mini-theatre, or showing off your skills at the skating rink. LML Skyliving combines space, comfort, and sophistication, creating the perfect environment for discerning families seeking an upscale and serene lifestyle.",
    "VRX Magna Thirumazhisai": "Experience the future of living at VRX Magna, Tamil Nadu's largest smart home gated community in Thirumazhisai, Chennai. This under-construction 2 BHK apartment, spanning 567 sqft, is designed for convenience and cutting-edge technology. Imagine controlling your home's security, cooking appliances, and even housekeeping with just the touch of a button, thanks to integrated AI-based technology.  With the upcoming CMBT Metro Station, Airport, and a fourth integrated bus terminus nearby, this property offers not only a futuristic lifestyle but also a promising investment opportunity.",
    "Oblong Polaris Mogappair East": "Design your dream home and make it a reality at Oblong Polaris in Mogappair East, Chennai. This under-construction 3 BHK apartment offers 1435 sqft of carpet area, providing ample space for your vision to unfold.  Enjoy the semi-furnished convenience and two private balconies, perfect for sipping your morning coffee or enjoying a relaxing evening. Located in a hub of comforts, this exclusive apartment provides the ideal setting for creating the home you've always envisioned.",
    "GVSPL Mahameru Thiruvanmiyur": "Embrace well-being and premium living at GVSPL Mahameru in Thiruvanmiyur, Chennai. This ready-to-move-in 3 BHK apartment offers 1500 sqft of luxurious living space. Imagine yourself residing in one of the 32 exclusive units, spread across a stilt plus four floors. Surrounded by lush greenery and a serene environment, GVSPL Mahameru offers the perfect blend of tranquility and convenience, making it the ideal dream home for discerning individuals.",
    "RC Meadows Kadirvedu": "Discover your dream home at RC Meadows in Kadirvedu, Chennai. This under-construction 3 BHK apartment, set to be completed by June 2026, offers 1650 sqft of meticulously crafted living space. As one of only 90 limited edition super luxury apartments, RC Meadows promises a truly enriching lifestyle. Imagine residing in a towering landmark of architectural ingenuity, designed to breathe your individuality and adapt to your every dream.",
    "Provident Bayscape Kelambakkam (1006 sqft)": "Embrace contemporary living at Provident Bayscape in Kelambakkam, Chennai. This under-construction 2 BHK apartment, with possession by August 2028, offers 1006 sqft of thoughtfully designed living space.  Picture yourself in one of the 676 units spread across four towers, surrounded by 47% open area, ensuring ample light and ventilation. Enjoy a refreshing dip in the swimming pool or socialize at the state-of-the-art 10,000 sqft clubhouse, offering over 25 modern amenities. Provident Bayscape perfectly blends modern comforts and cultural heritage.",
    "Risland The Ace Perungudi": "Experience urban living at its finest at Risland The Ace in Perungudi, Chennai. This ready-to-move-in 2 BHK apartment offers 1247 sqft of sophisticated living space in the heart of the IT gateway on OMR.  Imagine being within walking distance of residential, IT, and leisure spaces, all connected by convenient public transport.  Benefit from the sustainable, safe, and green features of SSGF technology, and enjoy over 20 world-class amenities within a beautifully landscaped 4.27-acre development. The Ace provides the perfect balance of work and leisure.",
    "Provident Bayscape Kelambakkam (993 sqft)": "Embrace contemporary living at Provident Bayscape in Kelambakkam, Chennai. This under-construction 2 BHK apartment, with possession by August 2028, offers 993 sqft of thoughtfully designed living space.  Picture yourself in one of the 676 units spread across four towers, surrounded by 47% open area, ensuring ample light and ventilation. Enjoy a friendly game of badminton in the indoor court, catch a movie in the spacious mini-theatre, or show off your skills at the skating rink, all within the state-of-the-art 10,000 sqft clubhouse. Provident Bayscape perfectly blends modern comforts and cultural heritage.",
    "Jains Aadheeswar Manapakkam": "Experience affordable luxury at Jains Aadheeswar in Manapakkam, Chennai. This ready-to-move-in 2 BHK apartment offers a comfortable and homely living space, perfect for families.  Imagine living in a privately enclosed, serene, and fully-equipped gated community, surrounded by essential amenities and convenient access to educational institutions, commercial establishments, and entertainment facilities. Jains Aadheeswar offers a quality investment and a warm, welcoming environment.",
    "Urbanrise City of Joy Thirumazhisai (897 sqft, Today)": "Discover modern living at Urbanrise City of Joy in Thirumazhisai, Chennai. This 2 BHK multistorey apartment offers 897 sqft of living space and includes a private balcony.  Imagine enjoying your morning coffee or relaxing after a long day in this comfortable and well-designed space.  Located in a thriving community, Urbanrise City of Joy provides a convenient and contemporary lifestyle.",
    "Radiance Solitaire Madhavaram": "Experience urban living at its finest at Radiance Solitaire in Madhavaram, Chennai. This under-construction 2 BHK multistorey apartment, set for completion by December 2029, offers 699 sqft of contemporary living space, complete with a private balcony.  Imagine yourself in this modern, well-designed apartment, perfect for a comfortable and stylish urban lifestyle.",
    "BC Mercury Pammal": "Discover modern comfort and traditional durability at BC Mercury in Pammal-Anna Nagar, Chennai. This under-construction 2 BHK apartment, nearing completion in 12 months, offers 872 sqft of thoughtfully designed living space. Constructed with robust red bricks, BC Mercury provides a blend of quality and affordability. Imagine enjoying easy access to essential amenities and a promising investment in Chennai's real estate landscape.",
    "Radiance The Prime Pammal": "Experience modern living at its finest with Radiance The Prime in Pammal, Chennai. This under-construction 3 BHK multistorey apartment, set for possession by November 2031, offers 1685 sqft of spacious living, including two private balconies.  Imagine yourself relaxing and enjoying the views from your balconies in this well-designed apartment.",
    "Urbanrise City of Joy Thirumazhisai (897 sqft, Mar 24)": "Discover modern living at Urbanrise City of Joy in Thirumazhisai, Chennai. This 2 BHK multistorey apartment offers 897 sqft of living space and includes a private balcony.  Imagine enjoying your morning coffee or relaxing after a long day in this comfortable and well-designed space.  Located in a thriving community, Urbanrise City of Joy provides a convenient and contemporary lifestyle.",
    "BRIGADE ICON Mount Road": "Experience luxury living at BRIGADE ICON in Mount Road (Anna Salai), Chennai. This under-construction 3 BHK multistorey apartment, set to be ready by June 2029, offers a sprawling 2730 sqft of living space, complete with three balconies.  Imagine relaxing in your spacious living area or enjoying the city views from your balconies. This luxurious apartment provides the perfect setting for a sophisticated urban lifestyle.",
    "KG North Bay Tondiarpet": "Embrace oceanside living at KG North Bay in Tondiarpet, Chennai. This under-construction 3 BHK apartment, set for possession by December 2026, offers 1609 sqft of luxurious space with breathtaking sea and city views. Imagine waking up to panoramic vistas from your apartment in one of the two elegant residential towers, Ocean Vista and Ocean View.  Enjoy access to a grand open podium with a swimming pool and extensive breathing space, creating a sophisticated and serene living experience.",
    "Alpha Signature by EK HOMES Medavakkam": "Upgrade your lifestyle with Alpha Signature by EK HOMES in Medavakkam, Chennai. This under-construction 2 BHK apartment, with possession by September 2025, offers 1056 sqft of premium living space in a non-flooded zone.  Imagine residing in a sophisticated residence with superior craftsmanship and innovative design.  Enjoy a truly unparalleled living experience with access to a range of amenities, including a leisure area with seating, a play area for kids, an indoor games room, and an indoor gym.",
    "Nest Mojo Padur": "Discover luxury and convenience at Nest Mojo in Padur, Chennai. This under-construction 3 BHK apartment, set to be ready by October 2025, offers 1405 sqft of thoughtfully designed living space. Located in the heart of Padur, adjacent to Gateway International School and along the vibrant OMR, Nest Mojo represents a reimagined way of life.  Imagine enjoying access to a range of amenities, including an indoor gym, an outdoor play area, indoor games, and a refreshing swimming pool.",
    "SIS Florence Porur": "Experience affordable luxury at SIS Florence in Porur, Chennai. This under-construction 3 BHK flat offers a range of sizes and prices to suit your needs. Situated in a prime location within a 1-acre integrated township, SIS Florence offers meticulously designed units with robust quality.  Imagine living in a comfortable and well-planned apartment with easy access to essential amenities and a thriving community.",
    "Tulive Azpire Tambaram West": "Begin a new life at Tulive Azpire, a 5-story suburban paradise in Tambaram West, Chennai. This under-construction 3 BHK apartment, ready by March 2025, offers 1278 sqft of elegant living space.  Imagine coming home to a world of comfort, with advanced finishes and an unmatched breadth of amenities.  Choose from an array of elegant 2, 2.5, or 3 BHK homes designed to inspire.",
    "Risington Phase 2 OMR": "Elevate your lifestyle at Risington Phase 2 on OMR, Chennai. This under-construction 3 BHK apartment, with possession by December 2027, offers 1617 sqft of luxurious living space.  Imagine joining an elite community of 625 distinguished families in Central OMR’s most prestigious project.  Experience the zenith of luxury and refinement in this exclusive development.",
    "Urbando Kosmos Solaris Siruseri": "Embrace luxurious and green living at Urbando Kosmos Solaris in Siruseri, Chennai. This under-construction 3 BHK villa, set for possession by June 2025, offers 1895 sqft of elegant living space.  Imagine waking up to sunlight streaming through large windows and stepping onto your private terrace with breathtaking views of lush green landscapes. Each villa blends contemporary architecture with eco-conscious design, creating a mindful and sustainable living experience.",
    "Ashiana Vatsalya Paranur": "Redefine retirement living at Ashiana Vatsalya in Paranur, Chennai. This under-construction 3 BHK flat, with possession by September 2028, offers 1530 sqft of thoughtfully designed living space within a premium senior living community. Imagine enjoying exceptional views from higher floors and rolling hills in this tranquil sanctuary.  Located within MWC with 4.8 acres of lush greens, Ashiana Vatsalya offers a peaceful yet vibrant lifestyle close to the city center.",
    "DRA Inara Navalur": "Experience luxury living at DRA Inara in Navalur, OMR, Chennai. This ready-to-move-in 3 BHK villa offers 2161 sqft of spacious living within a sprawling 6-acre community. Imagine residing in one of the 121 luxurious villas, complemented by over 50 premium amenities.  DRA Inara blends comfort, elegance, and modern convenience in a prime location.",
    "VGN Richmond Towers Guindy": "Experience luxury living at its finest at VGN Richmond Towers in Guindy, Chennai. This under-construction 2 BHK apartment, with possession by January 2028, offers 1032 sqft of aesthetically designed living space.  Imagine residing in a grand symphony of luxury, surrounded by lung space and greenery in one of Chennai's most prominent commercial and residential hubs.",
    "G Square Aranya Porur": "Experience convenient living at G Square Aranya in Porur, Chennai. This under-construction 2 BHK villa, set to be ready by March 2025, offers 1000 sqft of well-designed living space. Located along a major arterial road, G Square offers excellent access to key destinations, including a major traffic junction and a prominent business hub.  Imagine enjoying a perfect blend of convenience and proximity to essential amenities.",
    "Urbando Evorise Perumbakkam": "Embrace lavish and peaceful living at Urbando Evorise in Perumbakkam, Chennai. This under-construction 3 BHK apartment, with possession by December 2032, offers 1243 sqft of well-designed living space.  Imagine residing in a modern apartment with fine elevation and access to world-class amenities, including a gaming arcade, futsal court, outdoor swimming pool with fire camps, beach-style volleyball court, and a spacious movie theatre/AV room.",
    "Casagrand First City Sholinganallur": "Experience first-class living at Casagrand First City in Sholinganallur, Chennai. This under-construction 2 BHK apartment, with possession by August 2025, offers 1004 sqft of comfortable living space within a stunning self-sustainable township.  Imagine enjoying state-of-the-art amenities and world-class features crafted for everyone, including a refreshing swimming pool and a cricket ground.",
    "Incor PBEL City Kelambakkam": "Enjoy undisturbed private moments and exuberant camaraderie at Incor PBEL City in Kelambakkam, OMR, Chennai. This ready-to-move-in 3 BHK flat offers 1425 sqft of lavishly designed living space with modern techniques and industry-best specifications.  Imagine enjoying access to a range of amenities, including a jogging and strolling track, outdoor tennis courts, a clubhouse, and a swimming pool.",
    "Plot for Sale in Mahabalipuram (2820 sq.ft)": "Imagine building your dream home on this spacious 2820 sq.ft. plot in scenic Mahabalipuram.  Offered at 45.60 L, this plot offers ample space for a comfortable family home, complete with gardens and outdoor spaces.  Contact Aiythan for more details and to schedule a visit.",
    "Plot for Sale in Mahabalipuram (1200 sq.ft)": "A fantastic opportunity awaits with this 1200 sq.ft plot in Mahabalipuram, perfect for a cozy villa or a charming vacation home.  Priced at 26.50 L, this plot provides a great starting point for your real estate investment.  Reach out to Rakthi for more information.",
    "Plot for Sale in Mahabalipuram (4500 sq.ft)": "Looking for a larger piece of land? This 4500 sq.ft plot in Mahabalipuram, priced at 72 L, might be just what you need.  Envision a grand home or even a small development project on this generous plot.  Contact Meghamala for further details.",
    "Plot for Sale in Mahabalipuram (11000 sq.ft)": "A sprawling 11000 sq.ft plot in Mahabalipuram is now available for 1.32 Cr. This expansive land offers endless possibilities, from a luxurious private estate to a multi-unit development.  Contact Yashovardhan Rao for more details and to explore the potential of this remarkable property.",
    "Sea-Facing Plot in Mahabalipuram (5000 sq.ft)": "Wake up to breathtaking sea views every morning with this 5000 sq.ft sea-facing plot in Mahabalipuram, available for 45 L.  Located within walking distance of the beach and ECR, this plot is surrounded by luxury homes and is ready for immediate construction. Contact global india propertys for further details.",
    "Plot for Sale in Mahabalipuram (9000 sq.ft)": "A generous 9000 sq.ft plot in Mahabalipuram is up for sale for 81 L. With ample space for your dream home and gardens, this plot offers a fantastic opportunity to create your ideal living space. Contact global india propertys to learn more.",
    "Plot for Sale in Mahabalipuram (9600 sq.ft)": "Looking for a substantial piece of land? This 9600 sq.ft plot in Mahabalipuram is available for 96 L.  Build your dream home amidst the serene surroundings of this coastal town. Contact global india propertys to explore the possibilities.",
    "Plot for Sale in Mahabalipuram (9000 sq.ft) - 90L": "Another enticing opportunity awaits with this 9000 sq.ft plot in Mahabalipuram, listed at 90 L. This spacious plot provides ample room for a comfortable family home or a vacation getaway. Contact global india propertys for details and to schedule a site visit.",
    "Plot for Sale in Mahabalipuram (9200 sq.ft)": "This 9200 sq.ft plot in Mahabalipuram, priced at 92 L, offers a chance to create a personalized living space in a serene environment.  Imagine building your dream home with ample space for gardens and outdoor entertainment.  Contact global india propertys for more details.",
    "Plot for Sale in Mahabalipuram (6600 sq.ft)": "A well-sized 6600 sq.ft plot in Mahabalipuram is available for purchase at 66 L. This plot offers a balance of space and affordability, perfect for building a comfortable family home. Contact global india propertys for more information.",
    "Plot for Sale in Mahabalipuram (5600 sq.ft)": "Create your own private oasis on this 5600 sq.ft plot in Mahabalipuram, priced at 56 L.  Enjoy the tranquility of coastal living with ample space for a customized home and gardens.  Contact global india propertys to learn more.",
    "Plot for Sale in Mahabalipuram (9800 sq.ft)": "Own a spacious piece of Mahabalipuram with this 9800 sq.ft plot, listed at 98 L.  This substantial plot offers the potential to build a luxurious home or even a small development project. Contact global india propertys for details and to schedule a viewing.",
    "Plot for Sale in Mahabalipuram (7000 sq.ft)": "A 7000 sq.ft plot in Mahabalipuram is now available for 63 L.  This sizeable plot provides plenty of room for a comfortable family home and outdoor amenities.  Contact global india propertys for further information and to explore the possibilities.",
    "Plot for Sale in Mahabalipuram (6000 sq.ft) - 54L": "This 6000 sq.ft plot in Mahabalipuram, offered at 54 L, represents a great opportunity to invest in coastal real estate.  Build your dream home with ample space for gardens and outdoor activities. Contact global india propertys for more details.",
    "Plot for Sale in Mahabalipuram (10000 sq.ft) - 95L": "A large 10000 sq.ft plot in Mahabalipuram is now available for 95 L. This expansive plot provides a blank canvas to build your dream estate, with endless possibilities for customization. Contact global india propertys for more information and to explore the potential of this property.",
    "Plot for Sale in Mahabalipuram (8200 sq.ft)": "This 8200 sq.ft plot in Mahabalipuram, priced at 82 L, offers a balance of size and investment value.  Create your ideal living space in a tranquil coastal setting. Contact global india propertys for details and to schedule a site visit.",
    "Plot for Sale in Mahabalipuram (6800 sq.ft)": "A 6800 sq.ft plot in Mahabalipuram is up for sale for 68 L. This well-sized plot provides ample space for a comfortable family home and outdoor areas. Contact global india propertys for further information and to explore the possibilities.",
    "Plot for Sale in Mahabalipuram (7200 sq.ft) - 72L": "Another 7200 sq.ft plot in Mahabalipuram is available for 72 L. This spacious plot offers the potential to create a personalized living space in a serene environment. Contact global india propertys for details and to schedule a viewing.",
    "Plot for Sale in Mahabalipuram (5000 sq.ft) - 45L": "A 5000 sq.ft plot in Mahabalipuram is offered at 45 L. This plot provides a great opportunity to build a comfortable home in a desirable coastal location. Contact global india propertys for more information and to explore the possibilities.",
    "Plot for Sale in Mahabalipuram (2400 sq.ft)": "This 2400 sq.ft plot in Mahabalipuram, available for 38.40 L, offers a great starting point for building your dream home. With enough space for a comfortable dwelling and outdoor spaces, this plot offers a balanced investment opportunity. Contact global india propertys to learn more.",
    "Plot for Sale in Mahabalipuram (1200 sq.ft) - 7.20L": "An affordable 1200 sq.ft plot in Mahabalipuram is listed at 7.20 L. This plot represents a great investment opportunity in a sought-after location. Contact global india propertys for further details and to schedule a visit.",
    "Plot for Sale in Mahabalipuram (3000 sq.ft)": "This 3000 sq.ft plot in Mahabalipuram, priced at 21 L, offers a balance of space and affordability. Build your dream home with room for gardens and outdoor amenities.  Contact global india propertys for details and to schedule a site visit.",
    "Plot for Sale in Mahabalipuram (630 sq.ft)": "A compact 630 sq.ft plot in Mahabalipuram is now available for 5.29 L.  This plot is perfect for a small vacation home or a starter home.  Contact global india propertys for more information.",
    "Plot for Sale in Mahabalipuram (1000 sq.ft) - 6L": "A 1000 sq.ft plot in Mahabalipuram is available for sale at 6 L.  This plot provides a good foundation for building a cozy home in a beautiful coastal town. Contact global india propertys for more details.",
    "Plot for Sale in Mahabalipuram (600 sq.ft)": "This compact 600 sq.ft plot in Mahabalipuram is offered at an affordable price of 5.04 L. This plot represents a great entry point into the Mahabalipuram real estate market. Contact global india propertys for further details.",
    "Plot for Sale in Mahabalipuram (1200 sq.ft) - 19.20L": "Another 1200 sq.ft plot in Mahabalipuram is available for purchase, listed at 19.20 L. This plot offers a good starting point for building a comfortable home. Contact kolanjikumaran for details and to schedule a site visit.",
    "Plot for Sale in Mahabalipuram (6000 sq.ft) - 96L": "A spacious 6000 sq.ft plot in Mahabalipuram is offered at 96 L. This sizable plot provides ample room for a luxurious family home or a vacation getaway. Contact kolanjikumaran for more information.",
    "Plot for Sale in Mahabalipuram (3240 sq.ft)": "This 3240 sq.ft plot in Mahabalipuram, available for 51.84 L, provides a great opportunity to build a personalized living space in a tranquil environment. Contact global india propertys for more information and to schedule a site visit.",
    "Plot for Sale in Mahabalipuram (4500 sq.ft) - 72L-Ready to Move": "A ready-to-move 4500 sq.ft plot in Mahabalipuram is listed at 72 L. Start building your dream home immediately on this spacious plot in a desirable location. Contact global india propertys for further details and to schedule a viewing.",
    "Plot for Sale in Mahabalipuram (4800 sq.ft)": "This 4800 sq.ft plot in Mahabalipuram, priced at 76.80 L, offers ample space for a comfortable family home and outdoor areas. Contact global india propertys for more information and to explore the possibilities."
}