{
    "JK Sri Kamatchi Nagar Plots": "Step across the threshold and be greeted by a sun-drenched foyer, the scent of salty sea air hinting at the nearby ocean.  The open-plan living area unfolds before you, seamlessly connecting the living room, dining area, and a stylish, modern kitchen boasting sleek countertops and ample natural light pouring in from expansive windows framing breathtaking coastal views.  Imagine yourself relaxing on a plush, white sofa in the living room, the warm glow of recessed lighting reflecting on the polished hardwood floors.  A subtle coastal decor style, perhaps with driftwood accents and calming blues and whites, adds to the tranquil ambiance.  The dining area flows effortlessly into the living space, perfect for hosting elegant dinners with friends while enjoying the sunset over the horizon.  Down the hallway, you'll discover two spacious bedrooms, one potentially a master suite with an ensuite bathroom featuring a calming spa-like atmosphere. The second bedroom, brimming with natural light, could easily be transformed into a peaceful guest room or home office.   Picture yourself waking each morning to the gentle sounds of the waves, a true coastal dream home, uniquely yours.",
    "Zen Plots": "Welcome to Zen Plots, Mahabalipuram! Step through the front door and be instantly greeted by a calming foyer, bathed in the soft glow of natural light streaming through large windows.  The open-plan living area flows seamlessly into a delightful dining space, perfect for intimate family dinners, envisioned with sleek, modern furnishings and perhaps a statement chandelier casting a warm, inviting light in the evening. Imagine preparing meals in a stylish kitchen, its design echoing the tranquil surroundings.  Further down the hallway, you’ll find serene bedrooms, each potentially boasting private balconies offering glimpses of lush greenery or even the distant ocean.  Bathrooms are designed for relaxation, perhaps featuring calming earth tones and luxurious fixtures.  The overall atmosphere is one of understated elegance; a haven of peace, where the gentle coastal breezes seem to whisper through the imagined landscaping. Whether you choose a cozy retreat or a larger family home, the potential to create your personal sanctuary is palpable here at Zen Plots, where the gentle sounds of Mahabalipuram create the perfect soundtrack for your tranquil escape.",
    "RP Pallava Garden Plots": "Step across the threshold into your own slice of Pallava Garden paradise!  A charming foyer, bathed in the warm glow of natural light streaming through a large arched window, welcomes you.  The open-plan living area unfolds before you, seamlessly blending a cozy living room with a sun-drenched dining area perfect for al fresco meals on balmy evenings. Imagine a stylish rattan dining set positioned near French doors that open onto a private patio, overlooking lush, meticulously maintained gardens—a tranquil escape from the bustle of Chennai.  The kitchen, just beyond, hints at modern convenience with sleek countertops and ample space; visualize it brimming with the aroma of freshly brewed filter coffee.  Down a short hallway, two bedrooms await; one a restful sanctuary painted in calming blues, reminiscent of the nearby ocean, the other bright and airy, ideal for a child's room or a vibrant home office. Both share access to a crisp, modern bathroom featuring spa-like lighting to create a relaxing atmosphere.  As the sun dips below the horizon, warm amber pendant lights will cast a gentle glow, enhancing the overall feeling of relaxed coastal elegance that permeates this personalized haven you've created within the established RP Pallava Garden community.",
    "Manju Kyra Plots": "Step across the threshold and be greeted by a sun-drenched foyer, the warm Chennai air hinting at the ocean just a short distance away.  The open-plan living area flows seamlessly into a dining space, easily envisioning a family dinner illuminated by a crystal chandelier against a backdrop of soft, coastal-inspired décor. Large windows bathe the area in natural light, showcasing perhaps a verdant garden or a peek of the azure sea.  The modern, sleek kitchen, just off the dining area, boasts stainless steel appliances and granite countertops, promising culinary adventures.  Down the hall, two generously sized bedrooms await, one perhaps a tranquil master suite with an ensuite bathroom featuring a walk-in shower, and the other a bright and airy guest room. Imagine soft, neutral tones complemented by warm, ambient lighting in the evenings, creating a peaceful retreat. This plot offers the blank canvas to create your dream home, a haven of tranquility and modern comfort where the mature neighborhood whispers promises of friendly community and easy coastal living.",
    "Mehta Pritee 3BHK": "Step inside Mehta Pritee and be greeted by a bright, airy foyer, sunlight streaming through tall windows that offer a tantalizing glimpse of the vibrant Mahabalipuram streets.  The spacious living room, easily accommodating plush sofas and a large area rug, flows seamlessly into a delightful dining area perfect for hosting gatherings. Imagine warm candlelight dancing on the polished wood table as you share delicious South Indian cuisine. The open-plan kitchen, just beyond, beckons with sleek countertops and modern cabinetry, hinting at culinary adventures to come.  Three generously sized bedrooms, each bathed in natural light and offering the potential for personalized sanctuaries, lead off from a central hallway.  Three stylish bathrooms, perhaps featuring calming blues and whites to reflect the coastal vibe, add a touch of elegance.  Feel the gentle sea breeze through the large windows, a constant reminder of Mahabalipuram's enchanting atmosphere.  The entire apartment exudes a comfortable, modern coastal charm; picture seashell accents, perhaps woven wall hangings, creating a space where relaxation and stylish living meet perfectly.  Evenings here promise tranquil moments illuminated by soft, ambient lighting, casting a warm glow on the beautifully appointed space.",
    "Mettupakkam MF Prayag Plots": "Step across the threshold and be swept away!  Imagine a grand foyer bathed in the warm glow of afternoon sunlight streaming through tall, arched windows, welcoming you into your sprawling Mahabalipuram estate.  The open-plan living room, easily accommodating luxurious seating arrangements and perhaps a grand piano, flows seamlessly into a spacious dining area perfect for hosting lavish dinners.  Picture yourself here, the air filled with the scent of jasmine from the blossoming garden visible through expansive French doors.  The state-of-the-art kitchen, envisioned with sleek granite countertops and stainless steel appliances, sits just beyond, easily accessible for both casual meals and grand entertaining.  Down the hallway, the master suite awaits, a tranquil haven with an en-suite bathroom boasting a luxurious soaking tub and perhaps a private balcony overlooking the meticulously manicured lawns.  Additional bedrooms, each designed for maximum comfort and privacy, offer equally inviting retreats. As evening descends, soft, recessed lighting casts a warm, inviting glow, enhancing the feeling of sophisticated serenity.  This isn't just a home; it’s a sanctuary, a testament to the beauty of coastal living, with space to breathe, to dream, and to create your perfect masterpiece.",
    "Olive Pine Beach Plots": "Step through the front door of your potential coastal haven and be greeted by a sun-drenched foyer, the scent of sea salt dancing on the breeze filtering through strategically placed, wide-paned windows.  The open-plan living area unfolds before you, seamlessly connecting the living room—imagine a plush, cream-colored sofa facing a wall of glass showcasing breathtaking ocean views—to a stylish dining area perfect for al fresco meals.  Warm, honey-toned wood flooring flows throughout, leading you to a modern, galley-style kitchen, its sleek white cabinetry complemented by brushed nickel accents.  Down a short hallway, you'll discover the bedrooms—picture a master suite with a private balcony overlooking the shimmering sea, and a second, perhaps more intimate bedroom decorated with calming, blues and greens, evocative of the ocean.  Bathrooms are en-suite, each appointed with elegant marble tiles and featuring soft, ambient lighting for a luxurious spa-like atmosphere.  In the evenings, soft, recessed lighting washes the space in a warm glow, accentuating the textures and colours, setting a tranquil scene perfect for unwinding after a day spent by the ocean. The overall feeling is one of relaxed sophistication; a peaceful sanctuary where the gentle rhythm of the waves whispers promises of seaside bliss.",
    "Engineers Coastal Residency Plots": "Step through the front door and be instantly greeted by the refreshing coastal breeze!  A sun-drenched foyer welcomes you, hinting at the ocean views just beyond. The open-plan living area flows seamlessly into a bright dining space, perfect for al fresco meals; imagine a large, rustic wooden table bathed in the warm glow of sunset. The kitchen, just off the dining area, is a chef's dream, already visualized with sleek granite countertops and stainless steel appliances.  Sunlight streams in from expansive windows, showcasing glimpses of the vibrant Mahabalipuram landscape.  Down a short hallway, two bedrooms await – one, a serene master suite with a private ensuite bathroom boasting a calming, spa-like ambiance, and the other, a cheerful guest room with ample natural light. Imagine soft, pastel walls, and perhaps a charming window seat overlooking a private garden. In the evenings, soft, recessed lighting casts a warm, inviting glow, creating the perfect atmosphere for relaxation after a day exploring the nearby historical sites. The overall feeling is one of airy coastal luxury – a perfect blend of modern convenience and the tranquility of seaside living.",
    "Victory Rising Plots": "Step through the front door of your future coastal haven and be greeted by a sun-drenched foyer, the scent of sea salt faintly carried on the breeze from the expansive windows.  The open-plan living area flows seamlessly into a stylish dining space, perfect for hosting dinner parties with ocean views twinkling through the glass doors that lead to a private patio.  Imagine a chic, minimalist kitchen with sleek white cabinetry and gleaming stainless steel appliances, bathed in the soft glow of recessed lighting. Down the hall, two generously sized bedrooms promise tranquil retreats, perhaps one decorated in calming blues and whites, the other with warmer, earthy tones.  The bathrooms, sleek and modern, offer a sanctuary of relaxation, complete with rain showers and natural light. As evening descends, soft, warm lighting illuminates the home, casting a cozy ambiance. Picture yourself unwinding on the patio, the gentle rhythm of the waves a soothing soundtrack to your idyllic coastal life. The feeling here is pure serenity, a blend of modern sophistication and breezy coastal charm, all perfectly realized in your dream home at Victory Rising.",
    "Pearl Ocean Front Plots & 3BHK": "Welcome, friends, to Pearl Ocean Front!  Step inside, and let the salty sea air invigorate you as you enter a bright, airy foyer, sunlight streaming through expansive windows framing the mesmerizing ocean panorama. The open-plan living area flows seamlessly from here, envision sleek, modern furnishings in calming blues and whites, perfectly complementing the breathtaking coastal views. Imagine yourself sinking into a plush sofa, a glass of something chilled in hand, as the sun dips below the horizon, painting the sky in fiery hues.  The dining area, bathed in warm, ambient lighting, seamlessly connects to a chic, minimalist kitchen, ready for culinary creations inspired by the freshest seafood. Down the hallway, three generously sized bedrooms await – one possibly with a private balcony mirroring the living room's incredible ocean view, each promising peaceful nights filled with the gentle rhythm of the waves.  Luxurious bathrooms, featuring contemporary fixtures and possibly a walk-in shower, offer a spa-like retreat.  The overall atmosphere? Pure coastal bliss. It's not just a home, it’s a lifestyle; a sanctuary where the tranquil sounds of the ocean become your daily symphony.",
    "Olive Little Olive Plots": "Step across the threshold of your future Mahabalipuram haven, and be greeted by a sun-drenched foyer, the warm terracotta tiles reflecting the abundant natural light streaming in from the expansive windows.  The open-plan living area unfolds before you, a symphony of space where comfortable, woven sofas beckon in a coastal-inspired living room, possibly adorned with driftwood accents and vibrant ocean-themed artwork.  A seamless transition leads to a dining area bathed in the golden light of the late afternoon sun, perfect for sharing meals with loved ones while overlooking a flourishing garden – perhaps a fragrant jasmine vine climbs the walls. The kitchen, envisioned with sleek granite countertops and warm wooden cabinets, offers a modern yet inviting space to create culinary masterpieces.  Down a short hallway, you'll discover serene bedrooms, one perhaps with a balcony overlooking the lush landscape, while the master suite promises a tranquil retreat with its own ensuite bathroom, a space for peaceful morning rituals.  Imagine soft, ambient lighting enhancing the evening ambiance, casting warm shadows on the walls as you relax and unwind in your very own piece of Mahabalipuram paradise.  The air is thick with the salty scent of the nearby ocean, a constant reminder of the unique charm and tranquility this location offers.",
    "Olive Pine Beach II Plots": "Step inside Olive Pine Beach II and feel the warm Chennai breeze whisper through the open foyer, instantly transporting you to a tranquil coastal haven.  The living area, bathed in sunlight streaming from expansive windows framing vibrant green gardens, welcomes you with a sense of airy spaciousness.  Imagine sleek, whitewashed walls punctuated by pops of turquoise, reflecting the nearby ocean's hues.  The dining area flows seamlessly from the living room, possibly featuring a charming wooden table perfect for sunset dinners.  A fully equipped, modern kitchen, perhaps with granite countertops and stainless steel appliances, lies just beyond, offering glimpses of the lush landscaping.  Down the hallway, the bedrooms promise restful retreats – picture one with a calming, coastal-themed décor and the other, perhaps a more minimalist space with built-in storage.  Bathrooms, envisioned with soothing, neutral tones, could showcase elegant fixtures and ample natural light.  As evening descends, soft, ambient lighting illuminates the home, casting a warm glow and inviting you to relax amidst this perfectly situated Mahabalipuram oasis.",
    "My Green Citadel Plots": "Step inside My Green Citadel and be greeted by a sun-drenched foyer, its walls adorned with a vibrant mural depicting the local flora and fauna of Mahabalipuram.  The open-plan living area flows seamlessly into a spacious dining area, perfect for hosting gatherings, bathed in the warm glow of natural light streaming through large, arched windows offering glimpses of lush greenery.  Imagine a comfortable, woven rug underfoot, complementing a chic, minimalist seating arrangement with pops of turquoise echoing the nearby ocean. The modern kitchen, just beyond, features sleek countertops and custom cabinetry, possibly in a warm, honey-toned wood, creating a space that's both stylish and functional.  Down the hallway, two bedrooms await, one a tranquil retreat painted in calming shades of sage green, the other a sunlit haven with cheerful yellow accents, potentially featuring a charming balcony overlooking a meticulously landscaped garden.  Both share access to a crisp, clean bathroom with a refreshing rain shower.  As evening descends, soft, recessed lighting casts a warm, inviting glow, enhancing the overall sense of calm and seaside serenity that pervades this customized haven within the well-established My Green Citadel community.",
    "Chattels Boat Club II Plots": "Step inside Chattels Boat Club II, and be greeted by a bright, airy foyer bathed in the warm glow of natural light streaming through expansive windows – imagine the gentle sea breeze carrying the scent of salty air, a hint of the nearby Mahabalipuram coast!  The open-plan living area flows seamlessly into a sophisticated dining space, perfect for hosting gatherings, perhaps adorned with sleek, modern furniture and artwork reflecting the region's rich history.  The adjacent kitchen, envision it with granite countertops and stainless steel appliances, is a chef's dream, offering views of a lush, private garden accessed through French doors.  Down the hallway, two spacious bedrooms await – one, perhaps with a calming coastal theme, boasts a large ensuite bathroom with a walk-in shower; the other, a tranquil sanctuary, features a serene color palette and plenty of natural light. In the evenings, soft recessed lighting casts a warm ambiance throughout the home, complementing the overall airy and luxurious feel of this beautifully designed space.  This is more than just a home; it's a lifestyle, perfectly situated in a well-established neighborhood.",
    "Nuworld Little Kerala Plots": "Step inside, and let the warm Chennai sun greet you through the expansive windows of your brand-new Mahabalipuram home!  A bright, airy foyer welcomes you, leading into a spacious open-plan living and dining area, perfect for entertaining. Imagine stylish, minimalist furniture bathed in the golden light of the setting sun, perhaps a comfortable sofa facing a wall adorned with vibrant South Indian art.  The kitchen, just off the dining area, offers a sleek, modern design; picture yourself prepping delicious meals while overlooking a lush, private garden through a French door.  Down the hall, two cozy bedrooms await – one perhaps a restful master suite with ensuite bathroom, the other a bright guest room painted a cheerful turquoise, echoing the coastal vibes of Mahabalipuram.  Soft, ambient lighting illuminates the space in the evenings, casting a warm glow that perfectly complements the overall tranquil ambiance. This is more than just a house; it’s a chance to craft your dream life in a thriving new community, surrounded by the beauty of newly developed Mahabalipuram.",
    "2 BHK Flat in Pallikaranai, Chennai": "Step inside, and let the spaciousness of this 946 sq. ft. 2 BHK flat in Pallikaranai envelop you! A bright foyer welcomes you, hinting at the airy feel to come.  The open-plan living and dining area flows seamlessly, bathed in natural light streaming through large windows – picture yourself relaxing on a plush, L-shaped sofa, perhaps with a coastal-themed throw, while the setting sun casts a warm glow.  The modern kitchen, just off the dining area, is perfect for culinary adventures, perhaps featuring sleek, white cabinetry and stainless steel appliances.  Down the hall, two comfortably sized bedrooms await – one a tranquil sanctuary with soft, muted tones and perhaps a small balcony offering a glimpse of city life, the other a vibrant space ready for creative expression.  Both share access to sleek, modern bathrooms, complete with elegant fixtures.  In the evenings, imagine soft, recessed lighting creating a warm and inviting ambiance, perfectly complementing the overall spacious and comfortable feel of this up-and-coming home, conveniently located near A2B, Kauveri Hospital, and other key Pallikaranai locations.",
    "3 BHK Flat in Pallikaranai, Chennai (Keerthi Murugas)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 8\n}\n]. Original: Experience luxury living in this spacious 3 BHK flat in Pallikaranai's Keerthi Murugas. With 1624 sq. ft. of space, this under-construction apartment provides ample room for a growing family. Imagine designing your dream home with plenty of room for entertaining and relaxing.",
    "3 BHK Flat in Pallikaranai, Chennai (Kamakoti Nagar)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 7\n}\n]. Original: This north-facing 3 BHK flat in Kamakoti Nagar, Pallikaranai, offers premium living at an attractive price.  With 1510-1542 sq. ft. of space, this under-construction apartment provides the perfect canvas for your personal touch. Enjoy modern amenities including covered car parking, 24/7 CCTV surveillance, and a video door phone, ensuring security and peace of mind.",
    "3 BHK Villa in Pallikaranai, Chennai (MGP Prosper Villa)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 6\n}\n]. Original: Embrace comfort and style in this ready-to-move-in 3 BHK villa in Pallikaranai's MGP Prosper Villa. Spanning 1200 sq. ft., this meticulously designed home offers modern living at its finest. Enjoy the convenience of a well-established community and a thoughtfully planned layout.",
    "Plot in Pallikaranai, Chennai (880 sq. ft.)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 4\n}\n]. Original: Invest in your future with this 880 sq. ft. plot in Pallikaranai, Chennai. Situated on a wide road, this plot offers excellent potential for building your dream home in a desirable location. Priced at 30 Lac, this represents a fantastic investment opportunity.",
    "Plot in Pallikaranai, Chennai (1675 sq. ft.)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 3\n}\n]. Original: This expansive 1675 sq. ft. plot in Pallikaranai, Chennai, presents an exceptional opportunity for those seeking a larger canvas for their dream home.  Located on a wide road with excellent infrastructure, this plot is perfect for creating a custom residence in a desirable location. Contact for pricing.",
    "3 BHK Flat in Pallikaranai, Chennai (Sea View)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 2\n}\n]. Original: Enjoy breathtaking sea views from this ready-to-move-in 3 BHK flat in Pallikaranai.  With 1137 sq. ft. of living space, this apartment on a wide road offers comfortable and scenic living. Imagine waking up to stunning ocean vistas and unwinding on your balcony with the refreshing sea breeze.",
    "2 BHK House in Kovilambakkam, Chennai": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n}\n]. Original: This ready-to-move-in 2 BHK house in S. Kolathur, Kovilambakkam, offers comfortable living with a north-facing plot.  Featuring two bedrooms, a big hall, and a kitchen, this 1100 sq. ft. house is close to leading schools, engineering colleges, and Chennai's IT hub.  Located on a wide 30ft road, this property is perfect for families and investors alike.",
    "2 BHK Flat in Jalladianpet, Chennai": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 59\n}\n]. Original: This ready-to-move-in 2 BHK resale flat in Jalladianpet, Pallikaranai offers affordable living in a developing area. At 966 sq. ft., this flat features a spacious hall and a pollution-free environment. Enjoy convenient access to nearby schools and colleges, and the added benefit of a gated community coming up nearby.",
    "4 BHK Villa in S Kolathur, Chennai": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 58\n}\n]. Original: Experience luxurious living in this semi-furnished 4 BHK villa in S Kolathur, Chennai.  Spanning 2400 sq. ft., this 8-10-year-old property provides ample space and comfort for a large family.  Enjoy the convenience of a well-established neighborhood and the elegance of a thoughtfully designed villa.",
    "3 BHK Flat in Thoraipakkam, Chennai": "Step inside, and be greeted by a spacious foyer bathed in the warm glow of natural light streaming through large windows –  imagine the sun illuminating gleaming anti-slippery tiles in the hallway leading to the heart of this stunning 1292 sq. ft. 3 BHK flat! The open-plan living and dining area unfolds before you, promising airy comfort. Picture yourself relaxing on a plush sofa, the soft light of a modern pendant lamp casting a gentle ambiance. The modern kitchen, just off the dining area, beckons with sleek countertops and stainless steel appliances, hinting at culinary adventures.  Down the hallway, three generously-sized bedrooms await, each offering a tranquil retreat – perhaps a calming blue palette in one, a vibrant, playful space in another, and a sophisticated, neutral haven in the third.  Each bathroom boasts the same elegant, safe anti-slippery tiling, ensuring both style and practicality.  A subtle coastal vibe, perhaps a seashell-inspired accent piece here, a nautical print there, could effortlessly complement this bright, modern space. Evening descends, and the strategically placed LED lighting system bathes the apartment in a warm, inviting glow, further enhancing the sense of calm and luxury.  The state-of-the-art security system, including a door camera and CCTV, ensures complete peace of mind. All this, and the added peace of 100% Vastu compliance, creating a truly harmonious home in the vibrant Thoraipakkam area of Chennai!",
    "3 BHK Flat in Madipakkam, Chennai": "Welcome, everyone, to your virtual preview of this stunning 3 BHK flat!  Step inside, and immediately you're greeted by a bright and airy foyer, bathed in the warm glow of natural light streaming through large windows.  The open-plan living and dining area flows seamlessly, perfect for entertaining – imagine a stylish modern sofa set facing a wall of floor-to-ceiling windows, possibly offering glimpses of the city skyline. From here, the modern kitchen beckons, a sleek space where culinary adventures await; picture sleek granite countertops and stainless-steel appliances.  Down the hall, three generously sized bedrooms promise peaceful retreats; envision a master suite with an ensuite bathroom, possibly featuring calming earth tones and a walk-in shower, while the other bedrooms boast ample space and natural light. Each bathroom, modern and functional, could be personalized to suit your taste. Soft, ambient lighting would perfectly complement the warm tones of the evening, enhancing the luxurious atmosphere. This premium development's intimate setting with just four flats per floor provides an exclusive sense of community.  With its close proximity to OMR and essential amenities, and a spacious 1199 sq ft footprint,  this exceptional apartment promises a lifestyle of comfort and convenience, all just a short stroll from the vibrant pulse of the city.",
    "1 BHK Flat in Perumbakkam, Chennai (Ozone Greens)": "Step inside, and you're immediately greeted by a bright and airy foyer, bathed in the warm glow of natural light streaming from large windows overlooking the vibrant Ozone Greens community.  The open-plan living area flows seamlessly into a charming dining space, easily envisioning a stylish, modern dining set against a backdrop of calming, neutral-toned walls.  The kitchen, just beyond, is a compact haven of efficiency, perfectly designed for modern living.  Imagine sleek countertops, stainless steel appliances, and perhaps a touch of coastal-inspired décor—a splash of turquoise here, a seashell motif there.  Further down the hall, the bedroom offers a peaceful retreat, spacious enough for a comfortable king-size bed and perhaps a small reading nook by the window,  creating a cozy sanctuary.  The bathroom boasts a clean, contemporary feel, with perhaps a walk-in shower and elegant fixtures.  In the evenings, soft recessed lighting sets a tranquil mood, complementing the abundant natural light of the day.  This isn't just a flat; it's a vibrant, conveniently located haven, seamlessly blending modern comfort with a tranquil atmosphere – a truly unmatched living experience in the heart of Chennai.",
    "1 BHK Flat in Perumbakkam, Chennai (Ozone Greens - 651 sq. ft.)": "Step inside, and feel the warmth of this charming 651 sq. ft. 1 BHK flat in Ozone Greens!  A welcoming foyer instantly greets you, bathed in the soft glow of natural light streaming through large windows. The open-plan living and dining area flows seamlessly, perfect for both relaxed evenings and entertaining. Imagine a plush, cream-colored sofa nestled against a wall, facing a sleek, modern entertainment unit, and a charming dining nook with space for a small, stylish table.  The kitchen, just off the dining area, is a compact haven of efficiency, potentially featuring light wood cabinets and stainless-steel appliances.  A hallway leads to the tranquil bedroom, envisioned with soothing pastel walls and a comfortable queen-size bed, creating a serene retreat.  The bathroom, adjacent to the bedroom, is bright and airy, with crisp, white tiles and modern fixtures.  In the evenings, soft recessed lighting casts a warm, inviting ambiance, complementing the overall cozy and comfortable feel. Picture yourself enjoying a quiet evening with a cup of tea, the gentle city sounds a distant hum outside the large windows. This ready-to-move-in apartment offers the perfect blend of comfort and convenience in the heart of vibrant Perumbakkam.",
    "2 BHK Flat in Thoraipakkam, Chennai (Parkside Villas Green)": "Step inside, and let the airy spaciousness of this 1000 sq ft 2 BHK flat in Parkside Villas Green wash over you!  A welcoming foyer, bathed in the soft glow of natural light streaming through large windows, leads you into the open-plan living and dining area. Imagine a plush, cream-colored sofa nestled against a wall adorned with vibrant coastal artwork, perfectly complementing the warm, honey-toned hardwood floors.  The dining area flows seamlessly into a modern kitchen, perhaps featuring sleek white cabinets and stainless steel appliances, all gleaming under recessed lighting.  Down a short hallway, you'll discover two generously sized bedrooms, one potentially boasting a tranquil, spa-like ensuite bathroom with soothing grey tiles and a rainfall showerhead, while the other offers a bright, airy feel, perfect for a home office or guest room.  Picture soft, ambient lighting casting a warm hue across the space in the evening, creating the perfect atmosphere for relaxation after a long day.  The overall feeling is one of comfortable sophistication, enhanced by the gentle breeze that whispers through the well-ventilated rooms, a testament to the property's wonderful design and maintenance.  This isn’t just a flat; it’s a home waiting to be filled with laughter and memories.",
    "Plot in Thoraipakkam, Chennai (OMR)": "Step inside and let the Chennai sunshine flood you as you enter, immediately greeted by a spacious foyer hinting at the breezy coastal vibes to come!  The open-plan living area flows effortlessly into a bright dining space, perfect for hosting gatherings, all bathed in the warm glow of natural light streaming through large windows. Imagine a sleek, modern kitchen just beyond, seamlessly integrated with the living space, perhaps featuring granite countertops and stainless-steel appliances.  Down a short hallway, two generously sized bedrooms promise tranquility; one, with its own private balcony offering glimpses of the city, feels airy and bright, while the other evokes a cozy retreat, potentially featuring a rich, dark wood floor and plush carpeting.  Both are serviced by a stylish bathroom featuring subtle, calming earth tones. As the sun sets, picture soft, recessed lighting casting a warm amber glow, enhancing the modern minimalism, creating the perfect ambiance for relaxed evenings. The entire space whispers of easy living and a relaxed, sophisticated lifestyle, perfectly situated to take advantage of the vibrant energy of OMR.",
    "2 BHK Flat in Thoraipakkam, Chennai (Grand Springs)": "Step inside, and feel the potential thrumming in the air!  This 806 sq. ft. haven in Grand Springs awaits your personal touch.  The entrance opens into a bright foyer, flooded with natural light from a large window overlooking a meticulously landscaped courtyard.  Imagine a stylish console table placed here, welcoming you home. From the foyer, the open-plan living and dining area stretches out before you, promising breezy sophistication.  Picture large, airy windows letting the Chennai sun stream in, illuminating a sleek, modern dining set, perfectly positioned to catch the evening glow from subtly placed recessed lighting.  The adjacent kitchen, a blank canvas waiting for your dream appliances, is envisioned as a bright, efficient space.  Down the hall, two bedrooms await; one, a peaceful sanctuary with soft, muted tones and a cozy reading nook, the other, a vibrant, spacious room brimming with potential. Both share access to stylish bathrooms, each featuring modern fixtures that promise a spa-like experience.  This unfurnished 2 BHK flat offers a chance to create a home that truly reflects your personality, a luxurious, tranquil escape nestled in the heart of prestigious Thoraipakkam.",
    "3 BHK Villa in Thoraipakkam, Chennai": "Step inside, and let the warm Chennai sun greet you!  A charming foyer, bathed in the soft glow of morning light streaming through a large, arched window, welcomes you to this exquisite 3 BHK villa.  The spacious living room, effortlessly flowing into a sun-drenched dining area, boasts high ceilings and hints of a coastal-inspired décor – imagine driftwood accents and crisp white walls punctuated by pops of vibrant teal.  The open-plan kitchen, just off the dining space, promises culinary adventures with its sleek, modern design.  Down the hallway, three generously sized bedrooms offer serene retreats; envision the master suite as a tranquil oasis with a private balcony overlooking a lush, meticulously maintained garden.  Subtly lit recessed lighting complements the natural light, creating a warm ambiance in the evenings.  Each bathroom, designed with stylish simplicity, offers a refreshing escape. This villa exudes a sense of peaceful comfort; the gentle breeze weaving through the open windows carries the scent of frangipani, creating a true haven within the secure and sought-after Thoraipakkam community.",
    "Plot in Thoraipakkam, Chennai (1230 sq. ft.)": "Step inside and let your imagination run wild!  Picture yourself in a bright, airy home, custom-built to your specifications on this expansive 1230 sq. ft. plot.  The front door opens into a welcoming foyer bathed in sunlight streaming through large, strategically placed windows, showcasing the vibrant energy of Thoraipakkam.  A spacious open-plan living and dining area flows seamlessly, perfect for entertaining guests; envision a sleek, modern kitchen with gleaming countertops and a breakfast bar nestled within this airy space.  Imagine soft, natural light dancing off polished hardwood floors, accented by subtle, contemporary lighting creating a warm glow during evening hours.  Down a short hallway, you’ll find two generously sized bedrooms, one perhaps with a private balcony offering glimpses of the bustling city, and another designed for ultimate relaxation, featuring a calming, neutral palette.  The bathrooms are envisioned as spa-like retreats, complete with elegant fixtures and soothing, neutral tones.  The entire home is designed to capitalize on natural light, with a feeling of space and serenity. This is more than just a plot; it's a blank canvas for your dream home, a vibrant investment in the heart of Chennai's thriving Thoraipakkam.",
    "2 BHK Flat in Kovilambakkam, Chennai": "Step inside and be greeted by a bright and airy foyer, bathed in the soft glow of natural light streaming through a large window.  The open-plan living and dining area flows seamlessly, spacious enough for comfortable gatherings yet intimate enough to feel cozy. Imagine a plush, cream-colored sofa facing a large flat-screen TV, complemented by a stylish rug in warm earth tones.  The adjacent dining area is perfect for family dinners, perhaps with a charming wooden table set against a calming, neutral-colored wall.  The kitchen, just off the dining area, is surprisingly spacious, envisioned with sleek white cabinetry and stainless steel appliances, ready for culinary adventures.  Down the hallway, two bedrooms beckon; one, a tranquil master suite with potentially built-in wardrobes, and the other a sunny guest room, both designed with a soothing color palette and ample storage.  Modern, well-lit bathrooms complete the picture.  In the evening, soft recessed lighting washes the space in a warm, inviting hue, creating a peaceful atmosphere that complements the serene neighborhood setting outside.  Picture yourself relaxing on your private balcony, enjoying the gentle breeze, secure within this well-maintained community, the quiet hum of life a pleasant backdrop to your peaceful haven.",
    "Shop in Medavakkam, Chennai": "Welcome, entrepreneurs! Step through the grand entrance of this 1125 sq ft prime Medavakkam shop and be swept away by the possibilities!  A bright, airy foyer welcomes you, bathed in natural light streaming from the wide road outside, setting a dynamic tone for your future business.  Imagine sleek, modern furnishings: perhaps a minimalist reception area flows seamlessly into a spacious open-plan workspace, bathed in the warm glow of recessed lighting in the evening. The versatile layout allows for creative customization – envision a vibrant break room with pops of color against crisp white walls, adjacent to a bustling work area, perhaps incorporating glass partitions for optimal visibility and collaboration.  Off to the side,  imagine a smaller, quieter office, perfect for focused work, perhaps with a calming, neutral palette and soft ambient lighting. Though unfurnished, the potential is limitless, inviting you to design the ideal workspace for success within this strategic location.",
    "3 BHK Builder Floor in Medavakkam, Chennai": "Welcome, welcome! Step inside this stunning 3 BHK builder floor and feel the spaciousness unfold before you.  The entrance opens into a bright foyer, immediately drawing your eyes to the expansive living area bathed in the warm glow of the afternoon sun streaming through large west-facing windows.  Imagine sinking into a plush sofa, perhaps a modern grey velvet number, and enjoying the city views from one of two generous balconies.  The flow is seamless – the living room effortlessly transitions into a charming dining area, perfect for hosting dinner parties, and then into a sleek, modern kitchen with ample counter space – picture gleaming granite countertops and stylish stainless steel appliances.  Down the hall, three comfortable bedrooms await, each offering its own unique ambiance;  perhaps one is a vibrant kid's room, while another is a serene master suite. Three modern bathrooms ensure everyone has their own private oasis.  The overall feel is one of airy luxury, enhanced in the evenings by subtle recessed lighting that casts a warm, inviting glow across the polished floors. The gated community adds a sense of security and peace, and with the upcoming metro station just a stone's throw away, convenient living is an understatement.  Imagine yourself here!",
    "Plot in Medavakkam, Chennai (GR Platinum City)": "Step through the gate and into your own slice of GR Platinum City paradise!  Imagine a charming foyer, bathed in the warm glow of the afternoon sun streaming through large windows, welcoming you into the heart of your future home.  The open-plan living and dining area flows seamlessly, perfect for entertaining; picture a chic, minimalist design with pops of vibrant color, perhaps a leafy green accent wall and sleek, modern furniture.  The kitchen, just off the dining area, beckons with the promise of delicious meals prepared in a space flooded with natural light.  A few steps away, two generously sized bedrooms offer havens of tranquility; one, perhaps, a calming space with soft blues and calming textures, while the other might boast a bold, contemporary feel. Both connect to well-appointed bathrooms, gleaming with modern fixtures. As evening descends, picture soft, recessed lighting casting a warm, inviting ambiance.  The quiet hum of the city fades away as you step onto your private patio, enjoying the gentle breeze and the peace of your surroundings, a true oasis just 100 meters from the bustling energy of Kovilanchery's bus stop.  This is more than just a plot; it’s the foundation of your dream home, surrounded by a vibrant community and promising a bright, comfortable future.",
    "2.5 BHK Flat in Karapakkam, Chennai (Sai Property)": "Step inside, and be greeted by a bright and airy foyer, sunlight streaming through a large window overlooking perhaps a lush, meticulously maintained garden.  The expansive 1450 sq. ft. of this 2.5 BHK flat in Sai Property unfolds before you; a seamless flow from the open-plan living and dining area, perfect for entertaining. Imagine a chic, modern sofa arrangement in the living room, complemented by warm, indirect lighting that casts a soft glow in the evenings.  The dining area, easily accommodating a large family gathering, opens to a contemporary kitchen, sleek and stylish, perhaps featuring stainless steel appliances gleaming under recessed lighting.  Down the hall, two generously sized bedrooms promise tranquil retreats, one possibly featuring a calming coastal theme with soft blues and whites, the other perhaps a more modern minimalist aesthetic.  A shared, elegantly appointed bathroom connects these private spaces.  Finally, a convenient half-bath adds to the practicality of this stunning flat.  The overall atmosphere is one of sophisticated comfort, spaciousness and abundant natural light; a truly inviting and unforgettable home.",
    "Plot in Madipakkam, Chennai (4200 sq. ft.)": "Step across the threshold and be greeted by a sun-drenched foyer, the air alive with the promise of the dream home to be.  Imagine a spacious, open-plan living area bathed in natural light streaming from large windows, perhaps showcasing glimpses of lush greenery beyond.  The flow is seamless, leading effortlessly from the living room, where a plush, ivory sofa beckons and a roaring fireplace crackles on cooler evenings, into a sophisticated dining area.  Picture a sleek, modern kitchen nearby, a culinary haven with stainless steel appliances gleaming under recessed lighting.  Down a quiet hallway, discover three generously-sized bedrooms, each a sanctuary of calm; perhaps one boasts a charming bay window offering tranquil garden views, while another offers a luxurious ensuite bathroom with a deep soaking tub.  As twilight descends, warm, ambient lighting paints the space in a golden hue, enhancing the overall sense of serenity and welcoming you to your personal haven in the heart of Madipakkam, yet a world away from the city's bustle.  This 4200 sq ft plot allows for a home that is both expansive and intimate, a masterpiece waiting to be created.",
    "4 BHK Flat in Madipakkam, Chennai (Block of 8 Flats)": "Step right in!  Imagine yourself entering the building, perhaps through a bright, freshly painted entrance leading to a small but charming foyer. From there, let's explore a typical 2BHK unit – picture warm sunlight streaming through large windows, illuminating a spacious living area with perhaps a tasteful mix of modern and traditional furnishings.  The open-plan design seamlessly connects the living room to a well-appointed kitchen, perhaps with a sunny yellow tiled backsplash and sleek granite countertops.  Down the hall, two comfortable bedrooms await, one possibly with a calming blue color scheme and the other a cheerful, sunlit space ideal for a home office. The bathrooms are neatly designed, with clean lines and modern fixtures. The 1BHK units offer a similar level of comfort, scaled down to perfectly suit their cozy atmosphere, each potentially featuring its own unique charm.  In the evenings, imagine the warm glow of recessed lighting casting a pleasant ambiance throughout, making each space feel welcoming and inviting. Though the building has age, there's a tangible sense of established community, and you can almost feel the vibrant pulse of Madipakkam just beyond the windows, promising a blend of urban convenience and comfortable living.",
    "2 BHK Flat in Madipakkam, Chennai (Metro Homes)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 6\n}\n]. Original: This newly built 2 BHK flat in Metro Homes, Madipakkam, offers peaceful living in a safe and secure locality. With 950 sq. ft. of built-up area, this ready-to-move-in apartment is ideal for families seeking a comfortable and convenient lifestyle.",
    "1 BHK Flat in Madipakkam, Chennai (RB Reka Flates)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 5\n}\n]. Original: This well-maintained, semi-furnished 1 BHK flat in RB Reka Flates, Madipakkam, is perfectly situated on a wide road. With 600 sq. ft. of built-up area, this ready-to-move-in apartment is ideal for individuals or couples seeking a convenient and affordable home.",
    "3 BHK Flat in Sholinganallur, Chennai": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 4\n}\n]. Original: This fully furnished, well-maintained 3 BHK flat in Sholinganallur offers ready-to-move-in convenience.  With 1223 sq. ft. of space within a secure gated community, this apartment is ideally located near schools, an upcoming metro station, and a shopping mall. Enjoy easy access to major IT companies like HCL, Wipro, CTS, Tech Mahindra, and Ford.",
    "3 BHK Flat in Medavakkam, Chennai (S P Lakeview)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 3\n}\n]. Original: This under-construction 3 BHK flat in S P Lakeview, Medavakkam, offers spacious and luxurious living for families.  Enjoy a wide road view from this 1350 sq. ft. apartment in a reputed builder's project.",
    "Plot in Nanmangalam, Chennai (Nattarasanpattu)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 1\n}\n]. Original: Discover your dream plot in Nattarasanpattu, Nanmangalam, Chennai. This 870 sq. ft. plot on a wide road is the perfect place to build your dream home. Enjoy the tranquility and convenience of this sought-after location.",
    "3 BHK Flat in Thoraipakkam, Chennai (Akshaya Tango)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n}\n]. Original: Experience luxurious beachfront living in this semi-furnished 3 BHK flat in Akshaya Tango, Thoraipakkam. With 2153 sq. ft. of space, this ready-to-move-in apartment boasts stunning beach views and best-in-class amenities. Imagine relaxing by the beach after a long day and enjoying the serene coastal lifestyle.",
    "3 BHK Flat in Senthil Nagar, Chennai (Grand Excelencia)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 59\n}\n]. Original: This unfurnished 3 BHK flat in Grand Excelencia, Senthil Nagar, offers 939 sq. ft. of living space in a serene Chennai neighborhood.  Priced at 1.10 Cr, this ready-to-move-in apartment provides a comfortable and peaceful lifestyle.",
    "3 BHK Flat in Sholinganallur, Chennai (Near Metro)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 57\n}\n]. Original: This recently added, ready-to-move-in 3 BHK flat in Sholinganallur is conveniently located near a metro station. With 1850 sq. ft. of saleable area, this apartment offers a peaceful vicinity, safe and secure locality, and a quick deal opportunity.  Enjoy close proximity to schools and the convenience of urban living.",
    "3 BHK Flat in Velachery, Chennai (Nilay & Nivas)": "Step inside, and be swept away!  The moment you cross the threshold of this magnificent 1516 sq. ft. 3 BHK flat, a spacious foyer bathed in warm, natural light welcomes you.  To your left, the open-plan living and dining area unfolds, promising effortless entertaining. Imagine a stylish, modern sofa set facing a wall adorned with vibrant, abstract art, overlooking perhaps a glittering city vista through expansive windows.  The dining area flows seamlessly into a sleek, modern kitchen, envision gleaming countertops and stainless-steel appliances – perfect for culinary adventures.  Further down the hall, three generously sized bedrooms await; the master suite, a tranquil retreat with potential for an ensuite bathroom, promises restful nights.  Imagine soft, ambient lighting illuminating the plush carpets and creating a calming atmosphere. The other two bedrooms, equally spacious and bright, could be transformed into children's havens or guest rooms.  Throughout the flat, soft, recessed lighting complements the natural light, enhancing the airy and luxurious feel. The overall ambiance is one of sophisticated simplicity, a perfect blend of urban convenience and tranquil family living, all within the desirable Nilay & Nivas community of Velachery.",
    "Oblong Crescent Community": "Step through the grand entrance and be greeted by a sun-drenched foyer, the scent of sea salt carried on a gentle breeze hinting at Mahabalipuram's proximity.  The open-plan living area unfolds before you, a symphony of space and light, perhaps with polished terracotta floors reflecting the warmth of the Chennai sun streaming through expansive windows. Imagine a comfortable seating area arranged around a crackling fireplace – perfect for those cooler evenings – flowing seamlessly into a dining area bathed in the soft glow of a modern chandelier.  The kitchen, a chef's dream, is just beyond, perhaps showcasing sleek granite countertops and custom cabinetry.  Down a hallway, you'll discover bedrooms offering breathtaking garden views or serene vistas, each tailored to your unique tastes, potentially with en-suite bathrooms boasting rain showers and elegant fixtures.  Imagine waking to the gentle sounds of the ocean, a tranquil start to each day in your personal paradise at Oblong Crescent.  As twilight descends, soft ambient lighting casts a warm embrace, transforming your dream home into a sanctuary of comfort and style.",
    "Victory Rising": "Step inside Victory Rising and be greeted by a sun-drenched foyer, where the warm Chennai light streams through expansive windows, already hinting at the coastal breezes to come.  The open-plan living area flows seamlessly into a dining space, perfect for hosting lively gatherings; imagine a sleek, modern dining table bathed in the soft glow of pendant lights as the sun sets.  The kitchen, perhaps boasting a clean, minimalist design with pops of vibrant color, is just steps away, easily accessible for entertaining.  Down the hall, bedrooms await, one possibly featuring a calming, ocean-inspired palette and a private balcony offering glimpses of the Mahabalipuram landscape, while another could be a bright and airy space for children, perhaps decorated with playful, locally inspired artwork.  Bathrooms promise a spa-like retreat, maybe with natural stone accents that reflect the region's rich heritage.  As evening descends, imagine the warm ambiance of strategically placed floor lamps casting a gentle glow throughout this future home, creating an atmosphere of relaxed sophistication.  Whether you envision a cozy haven or a lavish estate, Victory Rising offers the perfect canvas to paint your dream.",
    "CCP Signature City": "Step inside and be greeted by a bright, airy foyer, sunlight streaming through large windows that showcase the vibrant, tropical landscape surrounding CCP Signature City.  The open-plan living area unfolds before you, potentially featuring sleek, modern furnishings in a calming, coastal-inspired palette of blues and whites. Imagine yourself relaxing on a plush sofa, the gentle sea breeze carrying the scent of jasmine from the nearby gardens, glimpsed through sliding glass doors.  The dining area flows seamlessly into the modern kitchen, perhaps with a granite countertop island perfect for casual meals or entertaining.  Down the hall, picture two spacious bedrooms, one a tranquil retreat with soft lighting and calming earth tones, the other a bright, sun-drenched haven perfect for a child's room or home office.  Bathrooms, designed with clean lines and sophisticated fixtures, provide a spa-like ambiance. As the sun sets, picture warm, recessed lighting casting a soft glow across the space, enhancing the feeling of luxurious comfort and creating the perfect atmosphere for a peaceful evening in your dream Mahabalipuram home.",
    "BGMR Sunrise Avenue": "Step inside and feel the warm South Indian sun greet you!  The entrance opens into a charming foyer, bathed in the soft glow of morning light streaming through large windows framing breathtaking views of the Mahabalipuram sunrise.  From here, the open-plan living area unfolds; imagine a breezy space with terracotta-tiled floors,  perhaps a comfortable rattan sofa set facing the expansive window, where the vibrant colours of the sunrise paint the sky each morning.  The dining area, adjacent to the living room, is perfect for leisurely family meals, perhaps featuring a sleek, modern dining table crafted from local wood, its surface reflecting the sunlight.  The kitchen, though unseen, promises a similar bright and airy feel, possibly with pops of colour in the cabinetry, hinting at delicious culinary adventures to come.  Down the hall, two bedrooms await – one a spacious master suite with an en-suite bathroom, perhaps boasting a large walk-in shower and luxurious soaking tub for evenings of peaceful relaxation. The second bedroom, equally charming, offers a cosy retreat. Throughout the home, soft, natural light dances across the walls, while strategically placed warm LED lights create a magical ambiance in the evenings. With the fresh breeze carrying the scent of the ocean, you can almost feel the relaxed coastal vibes permeating this home, a true sanctuary in the heart of Mahabalipuram.",
    "G Square Dynasty": "Step inside and be swept away!  The grand entrance of your potential dream home at G Square Dynasty opens into a spacious foyer, bathed in the warm glow of natural light streaming through expansive windows.  Imagine polished marble floors reflecting the sunlight, leading you into a breathtaking living area, perfect for hosting lavish gatherings.  The open-plan design seamlessly connects the living room to a sophisticated dining area, perhaps adorned with a stunning chandelier and elegant furnishings.  A modern, sleek kitchen, complete with top-of-the-line appliances, flows effortlessly from the dining space.  Further down the hallway, discover serene bedrooms, each a private sanctuary with ample closet space.  Picture soft, natural light filtering through sheer curtains, creating a tranquil ambiance.  The bathrooms are envisioned as spa-like retreats, complete with luxurious fixtures and perhaps a calming, neutral colour palette.  As evening descends, picture warm, ambient lighting illuminating the space, highlighting the tasteful decor, possibly reflecting a subtle coastal theme inspired by Mahabalipuram's stunning location. This prestigious address offers a lifestyle of luxury and serenity; a truly royal living experience awaits!",
    "Nuworld Little Kerala": "Step across the threshold of your own little slice of Kerala paradise!  The entrance opens into a charming foyer, bathed in the warm glow of sunlight streaming through large windows—imagine the lush greenery of Mahabalipuram peeking through.  From there, the open-plan living and dining area unfolds, a perfect space for entertaining, perhaps with elegant teak furniture and vibrant Kerala-inspired artwork adorning the walls. The kitchen, just off the dining area, boasts a bright and airy feel, envisioning sleek granite countertops and custom cabinetry, ready for your culinary creations.  Down a short hallway, you'll find two beautifully appointed bedrooms, one potentially featuring a cozy bay window seat overlooking a private garden, the other perhaps a spacious master suite with an en-suite bathroom boasting a rainfall shower.  Soft, natural light fills every room, while in the evenings, strategically placed warm-toned lighting creates an ambiance of serene relaxation. The overall feel is one of tranquil elegance, a harmonious blend of modern comfort and traditional Kerala charm. Feel the gentle sea breeze through the windows (we can almost smell the salty air!), and envision yourself unwinding in this peaceful haven, nestled in the heart of Mahabalipuram.",
    "Akshaya Brindavanam": "Welcome to Akshaya Brindavanam!  Step through the front gate and feel the warm, South Indian sun on your face.  Imagine a charming foyer, perhaps adorned with vibrant, hand-painted tiles, leading into a bright living area. Sunlight streams through large windows, illuminating polished wooden floors and hinting at the lush greenery just beyond the patio doors.  The open-plan design flows seamlessly into a dining area, perfect for enjoying leisurely meals with loved ones, perhaps overlooking a meticulously maintained garden.  The kitchen, envisioned with sleek granite countertops and cheerful, terracotta accents, sits conveniently nearby.  Down the hallway, you'll find bedrooms boasting ample natural light, some perhaps with balconies offering glimpses of the captivating Mahabalipuram landscape.  Bathrooms are designed for both functionality and elegance, possibly featuring calming mosaic tiles and soft, natural lighting.  As evening descends, imagine the warm glow of strategically placed lamps casting a gentle radiance across the space, transforming the home into a haven of tranquil comfort.  The overall atmosphere is one of relaxed sophistication, blending the charm of traditional South Indian aesthetics with the conveniences of modern living—a true sanctuary, your very own piece of paradise in Mahabalipuram.",
    "Homescape Light House": "Step across the threshold of your dream Homescape Light House abode, and be instantly greeted by a sun-drenched foyer, its walls perhaps adorned with a vibrant, coastal-inspired mural.  The open-plan living area flows seamlessly into a dining space perfect for al fresco meals, perhaps furnished with sleek, modern furniture and punctuated by pops of turquoise echoing the nearby ocean.  Imagine the warm glow of recessed lighting in the evening, accentuating the natural light that streams in through expansive windows.  The kitchen, a modern marvel of efficiency, might feature a granite countertop and stainless steel appliances, ready for culinary adventures.  A short hallway leads to the bedrooms; the 1BHK unit offers a cozy haven, possibly decorated in calming neutrals, while the 2BHK boasts spacious rooms, each a tranquil escape bathed in soft light.  Both configurations include thoughtfully designed bathrooms, perhaps featuring elegant marble accents.  Picture yourself relaxing on your private balcony, enjoying the balmy Chennai air and perhaps even glimpses of the ocean horizon – a perfect blend of serene living and convenient access to Mahabalipuram's charm.",
    "JK Sri Kamatchi Nagar": "Step into your own slice of paradise in Mahabalipuram!  As you enter, a bright and airy foyer welcomes you, hinting at the spaciousness to come.  Imagine the warm glow of sunlight streaming through expansive windows, illuminating a living area designed for relaxation, perhaps with plush, coastal-themed sofas and a calming blue accent wall.  The open-plan design seamlessly flows into a dining area perfect for family gatherings, easily picturing a large wooden table set against a backdrop of tasteful artwork inspired by local Tamil Nadu artistry.  The kitchen, just beyond, promises culinary adventures with modern appliances and ample counter space, maybe even a charming breakfast nook overlooking a small, private garden.  Down the hall, two generously sized bedrooms await, one possibly a master suite with an ensuite bathroom boasting a tranquil spa-like atmosphere complete with a luxurious rain shower. The second bedroom, perhaps painted a cheerful yellow, offers a cozy retreat.  In the evenings, picture the soft glow of recessed lighting creating a warm and inviting ambiance throughout, the gentle sea breeze whispering through the open windows, a perfect end to a perfect day.",
    "Pearl Ocean Front": "Welcome to your dream beachfront escape at Pearl Ocean Front!  Step through the grand entrance and be instantly captivated by the expansive foyer, bathed in the warm glow of natural light streaming through floor-to-ceiling windows offering breathtaking ocean views.  The open-plan living area flows seamlessly into a sophisticated dining space, perfect for elegant gatherings, perhaps adorned with tasteful coastal-inspired décor.  The modern kitchen, sleek and stylish, beckons with its stainless-steel appliances and granite countertops.  From here, discover three generously sized bedrooms, each a sanctuary of calm, with ensuite bathrooms featuring luxurious fixtures and perhaps calming ocean-themed artwork.  Imagine waking to the gentle rhythm of the waves, the sun painting the sky in vibrant hues through the large windows.  In the evening, soft ambient lighting casts a warm, inviting glow, complementing the sophisticated yet relaxed atmosphere.  The sprawling 3814 sqft plots offer ample space for private gardens, while even the 636 sqft apartments feel spacious and airy, promising a tranquil coastal lifestyle.  This is more than just a home; it's a lifestyle.",
    "Sudhagars Residencies": "Welcome to your dream plot at Sudhagars Residencies!  Step through the imagined front gate, perhaps adorned with vibrant bougainvillea, and picture yourself on your own spacious land.  Imagine a charming foyer opening onto a bright living area, flooded with sunshine streaming through large windows showcasing the beauty of Mahabalipuram.  The open-plan design flows seamlessly into a modern kitchen, perhaps featuring sleek granite countertops and warm wooden cabinetry, ready for your culinary creations.  A dining area, bathed in the gentle glow of a stunning chandelier in the evenings, sits adjacent, perfect for al fresco dinners under the stars.  Down a quiet hallway, you'll find serene bedrooms, each a personal sanctuary, one perhaps with a calming coastal theme, the other a vibrant, artistic space reflecting the local culture.  Imagine restful bathrooms, sparkling with contemporary fixtures.  The soft evening light filtering through strategically placed lamps creates an ambiance of tranquil elegance, completing this idyllic haven where the gentle sea breeze whispers promises of a fulfilling life in this beautiful corner of Chennai.",
    "One Path Sai Nagar": "Step inside and be greeted by a bright, airy foyer, bathed in the warm glow of natural light streaming through large windows – imagine the gentle sea breeze hinting at the nearby Mahabalipuram shores!  The open-plan living area flows seamlessly into a sun-drenched dining space, perfect for al fresco meals on balmy evenings.  Picture yourself here, perhaps with a chic, minimalist dining set and soft, coastal-inspired décor.  The kitchen, just beyond, is envisioned with sleek, modern cabinetry and ample counter space, ideal for creating culinary masterpieces.  Further down the hallway, two bedrooms beckon, one a tranquil haven painted in calming blues, the other a vibrant space bursting with personality – perhaps a cheerful yellow with playful accents.  Both are serviced by stylishly appointed bathrooms, each with its own unique charm.  In the evenings, soft recessed lighting casts a warm and inviting ambiance, enhancing the overall feeling of peaceful seaside living.  The whole space exudes a sense of calm sophistication, enhanced by the potential of a lush, private garden (imagine fragrant jasmine and the gentle rustle of palm leaves), a tranquil escape just steps from your door.",
    "Hidden Bay Layout": "Step inside and breathe the salty air – you're in a Hidden Bay haven!  A charming foyer, perhaps adorned with a hand-woven jute rug and a seashell-inspired chandelier, welcomes you.  The open-plan living area unfolds before you, bathed in the warm glow of natural light streaming through expansive windows framing lush, tropical greenery. Imagine yourself relaxing on a plush, white sofa, the gentle ocean breeze whispering through sheer curtains. The dining area, seamlessly connected, boasts a sleek, modern table perfect for al fresco meals, extending onto a private patio where swaying palms provide shade.  The kitchen, a chef’s delight, gleams with granite countertops and stainless steel appliances; picture yourself preparing a seafood feast under the soft illumination of recessed lighting. Down the hall, bedrooms offer tranquil escapes, possibly featuring light wood furniture and calming ocean-blue accents.  Bathrooms are havens of serenity, maybe with rainfall showers and soft, ambient lighting creating a spa-like atmosphere.  As evening descends, the subtle glow of strategically placed lamps casts a warm, inviting ambiance throughout this secluded paradise, a perfect blend of modern comfort and coastal charm.",
    "Adityaram Signature City Phase II": "Step inside, and let the warm South Indian sun greet you!  We're entering a spacious home, perhaps built on a generous 1200 sq ft plot, nestled within the prestigious Adityaram Signature City Phase II.  A charming foyer opens into a bright living area, flooded with natural light pouring in through large windows, perhaps showcasing a glimpse of the lush green landscape often found near Mahabalipuram. Imagine comfortable, woven seating arranged around a low coffee table, perfect for evening conversations under the glow of soft, ambient lighting. Flowing seamlessly from the living room is a dining area, easily accommodating a family gathering, possibly accented with vibrant coastal-themed décor and the scent of freshly brewed South Indian coffee. The kitchen, just beyond, hints at modern convenience,  ready for culinary creations.  Down the hall, we peek into bedrooms that promise peaceful slumber, one perhaps decorated with calming blues and whites, the other with a bolder, more vibrant palette. Bathrooms are imagined as sparkling havens, featuring sleek fixtures and maybe even a rainfall shower.  Throughout the house, the overall feeling is one of airy tranquility, a sanctuary where the vibrant energy of Mahabalipuram meets the quiet comfort of home.  Can you feel the sea breeze already?",
    "2 BHK Apartment in Navalur (Standalone Building)": "Step inside and be greeted by a spacious foyer bathed in the warm glow of natural light streaming from the north-facing windows, offering breathtaking views!  The expansive living room, easily accommodating a plush sectional sofa and a statement rug, flows seamlessly into a charming dining area perfect for family dinners. Imagine candlelight flickering on a sleek, modern dining table as you enjoy the evening. The open-plan kitchen, just beyond, beckons with its promise of culinary adventures – perhaps a cheerful splash of yellow paint on the cabinetry, complemented by stainless steel appliances. Down the hall, two generously sized bedrooms await: one, perhaps a calming retreat in soft blues and whites, the other potentially a vibrant space reflecting your unique style. Both bedrooms offer access to their own private, smartly designed bathrooms.  Throughout, the apartment exudes a tranquil atmosphere; picture subtle, ambient lighting casting a warm, inviting glow at night, perfectly accentuating the calm north-facing views.  The entire 1300 square feet feels airy and bright, with bike parking adding to the convenience of this wonderful standalone apartment.  It’s not just a home; it’s a sanctuary, awaiting your personal touch!",
    "4 BHK Villa in Casa Grande Pavillion": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 7\n}\n]. Original: This luxurious 4 BHK villa in Casa Grande Pavillion (Thazhambur) offers a spacious 2576 sqft built-up area, perfect for a growing family. Features include car parking and an east-facing orientation. Asking price is ₹2.14 Crores.",
    "3 BHK House near Casagrand Grandio": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 6\n}\n]. Original: Situated close to the prestigious Casagrand Grandio, this independent 3 BHK house offers a comfortable 1820 sqft built-up area. Enjoy the convenience of both bike and car parking, along with east-facing views. This property is listed at ₹1.75 Crores.",
    "4+ BHK Villa in Greenwoodcity": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 4\n}\n]. Original: Nestled on Thalambur Road near Navalur Junction on OMR, this expansive 4+ BHK villa in Greenwoodcity boasts a generous 4125 sqft built-up area. Amenities include bike and car parking, with an east-facing orientation. This luxurious property is priced at ₹2.75 Crores.",
    "4+ BHK Apartment in Navallur": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 3\n}\n]. Original: Located near Jamia Masjid and Islamic Center and Hotel Navallur, this spacious 4+ BHK apartment in a standalone building offers a substantial 2700 sqft built-up area, ideal for larger families.  With car parking available, this property is priced at ₹4.5 Crores.",
    "3 BHK Apartment in Thulasi Happy Homes Apartments": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 2\n}\n]. Original: Situated in Thalambur, this 3 BHK apartment in Thulasi Happy Homes Apartments offers a comfortable 1370 sqft built-up area. Enjoy features like bike and car parking and south-facing views. It's listed at an attractive price of ₹70 Lacs.",
    "3 BHK Apartment in Olympia Opaline (near Vivira Mall)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n}\n]. Original: Located near Vivira Mall on Rajiv Gandhi Salai in Navalur, this 3 BHK apartment in Olympia Opaline offers 1576 sqft of built-up area, north-east facing views and bike and car parking. The listed price is ₹1.25 Crores.",
    "2 BHK Apartment in Emami Tejomaya (Egattur)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 59\n}\n]. Original: Situated in Egattur on Old Mahabalipuram Road, this 2 BHK apartment in Emami Tejomaya offers 1158 sqft of built-up area. Amenities include bike and car parking with a south-facing orientation. Priced at ₹98 Lacs.",
    "2 BHK Apartment in Emami Tejomaya (Block-E)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 58\n}\n]. Original: This 2 BHK apartment in Emami Tejomaya Block-E (Egattur) offers 1174 sqft of built-up area, with a south-facing aspect. Car parking is available.  This property is listed at ₹94.5 Lacs.",
    "2 BHK Apartment near Navalur Post Office": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 56\n}\n]. Original: Located near Navalur Post Office on Rajiv Gandhi Salai, this 2 BHK apartment in Sri Sai Apartment offers a convenient 1000 sqft built-up area. Enjoy bike and car parking and south-facing views. It's priced at ₹49 Lacs.",
    "2 BHK Apartment in Matheswari Flat Navalur": "Welcome to your dream home at 20, VOC St.! Step through the front door and be greeted by a spacious foyer bathed in the warm glow of the morning sun, thanks to that lovely east-facing orientation.  The living room unfolds before you, expansive and airy, perfect for hosting gatherings or simply relaxing with a book. Imagine large windows framing vibrant city views, perhaps enhanced by sleek, modern furnishings and pops of vibrant color.  The flow is seamless – the living room opens gracefully into a dining area, easily accommodating a large family dinner table, envisioning perhaps a rustic wooden piece that complements the space's brightness. The adjacent kitchen is a chef's delight, likely boasting ample counter space and maybe even a small breakfast nook overlooking the peaceful morning light.  Down the hall, two generously sized bedrooms await, one possibly a tranquil retreat with soft, calming colors and plush carpeting, and the other perhaps a vibrant space for creative energy.  Both share access to stylish bathrooms, potentially boasting contemporary fixtures and maybe even a touch of elegant marble.  In the evening, soft recessed lighting will cast a warm, inviting ambiance throughout the apartment. And after a long day, imagine stepping out to your designated car and bike parking spaces – easy peasy!  This 1322 sqft haven at Matheswari Flat is more than just a home; it's a lifestyle upgrade, a perfect blend of comfort, style, and convenience.",
    "2 BHK Apartment in Mahadavera Flats": "Step inside 1400 square feet of comfortable living on Voc Street!  As you enter, a bright, airy foyer welcomes you, bathed in the soft morning glow of the east-facing windows.  The spacious living room flows seamlessly into a charming dining area, perfect for hosting gatherings.  Imagine a sleek, modern dining set under a statement chandelier, creating a sophisticated ambiance.  The kitchen, just off the dining area, offers a practical layout with ample counter space, potentially styled with warm, wooden cabinetry and stainless steel appliances.  Down a short hallway, two generously sized bedrooms await—one perhaps featuring a calming, neutral palette and built-in wardrobes, the other possibly a vibrant space expressing individual style.  Both share access to beautifully appointed bathrooms, each designed with a focus on tranquility and functionality.  Picture soft, ambient lighting casting a warm glow throughout the apartment as evening descends, highlighting the elegant lines of your furnishings.  The entire apartment breathes a feeling of relaxed sophistication, enhanced by the views of the bustling city glimpsed through the large windows.  With convenient bike and car parking, and the sun streaming in from the east, this Mahadavera Flats gem is ready to become your perfect urban haven.",
    "2 BHK House near Navalur EB Office and SIPCOT IT Park": "Step inside, and let the airy spaciousness of this 1000 sq ft haven wash over you!  A bright foyer welcomes you, bathed in the warm glow of natural light streaming through a large window overlooking a neatly manicured garden—perfect for morning coffee!  The open-plan living and dining area flows seamlessly, the perfect setting for both relaxed evenings and lively gatherings.  Imagine a plush, cream-colored sofa set against a backdrop of calming ocean-themed wall art, complementing the gleaming hardwood floors.  The modern kitchen, just off the dining area, promises culinary adventures, perhaps with sleek granite countertops and stainless steel appliances, all illuminated by stylish pendant lights.  Down the hallway, two comfortable bedrooms await – one possibly featuring a calming, neutral palette and the other a vibrant burst of color, each a sanctuary of peace and quiet.  Bathrooms, designed for both functionality and style, add to the overall sense of refined comfort.  As twilight descends, imagine soft, recessed lighting transforming the space into a warm and inviting retreat, a perfect blend of modern convenience and tranquil coastal vibes, all within easy reach of SIPCOT IT Park and Navalur EB Office.",
    "2 BHK Apartment in Sweet Homes Hormony Navalur": "Step inside, and *wow*!  The north-east facing windows flood this spacious 1000 sq ft 2 BHK apartment with warm, natural light, creating an airy and inviting atmosphere.  A small, welcoming foyer leads directly into the open-plan living and dining area, perfect for entertaining. Imagine a stylish, modern sofa set facing a large flat-screen TV, complemented by a sleek, minimalist coffee table.  The dining area flows seamlessly from the living room, envisioning a chic glass-topped dining table surrounded by comfortable chairs, bathed in the morning sun. The modern kitchen, just off the dining area, boasts crisp white cabinetry and stainless-steel appliances.  Further down the hallway, discover two generously sized bedrooms, perhaps one styled with a calming, neutral palette for restful sleep, while the other could be a vibrant and fun space for children or a guest room. Both share access to well-appointed bathrooms, maybe featuring stylish subway tiles and modern fixtures.  As evening descends, picture the apartment glowing softly under recessed lighting, creating a cozy and intimate ambiance.  The distant sounds of Thangavell College add a charming background hum to this wonderful home, your perfect urban retreat complete with convenient car and bike parking.",
    "2 BHK Apartment in Olympia Opaline (near OMR Food Street)": "Step inside this stunning 2 BHK apartment in Olympia Opaline and be greeted by a bright, airy foyer that immediately sets a welcoming tone.  The open-plan living and dining area unfolds before you, bathed in the soft, warm glow of north-facing sunlight streaming through expansive windows – imagine lazy afternoons spent here, perhaps with a stylish, minimalist sofa and a sleek glass dining table reflecting the light.  The kitchen, seamlessly integrated into this space, hints at a modern, contemporary design; picture yourself preparing meals while enjoying the cheerful ambiance.  Further down the hallway, you'll find two generously sized bedrooms, one perhaps styled with a calming coastal theme, featuring driftwood accents and calming blues, the other potentially a haven of modern minimalism.  Bathrooms feature sleek, contemporary fixtures, promising a spa-like experience. The evening ambiance is easily envisioned with subtle recessed lighting complementing the natural light, creating a tranquil and sophisticated atmosphere.  From the living room, you could even picture a small balcony or patio offering glimpses of the bustling city below, and the convenience of the OMR Food Street is just a stone's throw away!  This 1095 sq ft haven, complete with secure bike and car parking, truly offers the perfect blend of comfort and modern living.",
    "2 BHK Apartment in Olympia Opaline (opposite AGS Cinema)": "Step inside and be greeted by a bright, airy foyer bathed in the warm glow of the morning sun streaming through the east-facing windows!  The spacious living room, boasting at least 600 square feet, flows seamlessly into a charming dining area perfect for intimate gatherings, perhaps adorned with a sleek, modern dining set. Imagine the laughter echoing as you share meals overlooking the vibrant city life opposite AGS Cinema. The kitchen, conveniently located off the dining area, hints at culinary adventures with potential for an open-plan design, flooded with natural light.  Down the hall, two generously sized bedrooms await, one potentially featuring a tranquil, minimalist aesthetic with muted blues and calming garden views, while the other could be transformed into a vibrant, energetic space, perhaps with pops of sunshine yellow and playful accents. Both are serviced by well-appointed bathrooms, elegantly designed with sleek fittings.  As evening descends, picture the soft glow of recessed lighting casting a warm, inviting ambiance across the entire 1249 square feet, creating a perfect haven after a long day.  This 2 BHK in Olympia Opaline is more than just a home; it's a lifestyle statement, conveniently located, luxuriously appointed, and perfectly positioned to embrace the energy of the city!",
    "3 BHK Apartment in Olympia Opaline": "Welcome to your dream home! Step through the front door and be greeted by a bright, airy foyer bathed in the soft glow of natural light streaming in from the north-facing windows.  The open-plan living and dining area unfolds before you, spacious and elegant with room for both grand entertaining and cozy nights in. Imagine a plush, cream-colored sofa set against a backdrop of calming, coastal-inspired décor, perhaps with subtle blues and greens echoing the tranquil views. The modern, sleek kitchen, just off the dining area, beckons with gleaming countertops and ample space for culinary creativity. Three generously sized bedrooms offer personal sanctuaries; picture the master suite with its own ensuite bathroom, a haven of calm with a luxurious soaking tub.  The other two bedrooms, equally comfortable, could be personalized with vibrant pops of color or sophisticated minimalism. In the evenings, warm, recessed lighting casts a gentle ambiance throughout the apartment, enhancing the feeling of spaciousness and calm.  From the living room, perhaps you can glimpse a peek of the city skyline twinkling in the distance, adding a touch of urban energy. With convenient bike and car parking, this exquisite 1386 sqft apartment in Olympia Opaline near OMR is more than just a home—it's a lifestyle.",
    "3 BHK Apartment in Olympia Opaline (near OMR Road)": "Step inside and be greeted by a sun-drenched foyer, the polished marble floor gleaming under the bright light pouring in from the expansive windows overlooking the vibrant Seevaram streets.  The open-plan living area unfolds before you, a harmonious blend of modern elegance and coastal comfort – imagine creamy beige walls adorned with driftwood artwork, the gentle sound of waves subtly suggested by a stylish wave-patterned rug.  Flow seamlessly into the dining area, envisioned with a sleek, glass-topped table perfect for hosting gatherings, and then into a fully equipped kitchen, brimming with stainless steel appliances and ample counter space, ideal for culinary creativity.  Down the hallway, three generously sized bedrooms await; picture the master suite as a tranquil sanctuary with a plush king-size bed and an en-suite bathroom boasting a walk-in shower and soothing spa-like lighting.  Warm, inviting light fixtures illuminate each room, creating a cozy atmosphere in the evening.  The other two bedrooms are equally spacious and adaptable – maybe one as a home office, the other a guest room, decorated in calming, muted tones.  With secure parking included, this stunning 1800 sqft apartment truly offers a luxurious coastal-inspired living experience in the heart of Perungudi.",
    "2 BHK Apartment in Olympia Opaline": "Welcome to your dream home in Olympia Opaline, Navalur!  Step inside and be greeted by a spacious foyer bathed in the warm glow of natural light streaming through large windows, immediately creating a sense of airy openness.  The living room, generously sized at 1224 sqft, flows seamlessly into a charming dining area, perfect for hosting intimate gatherings. Imagine a stylish, modern dining set positioned beneath a statement pendant light, creating a sophisticated ambiance.  The adjacent kitchen, envisioned with sleek granite countertops and stainless steel appliances, promises culinary adventures.  Down the hallway, two bright bedrooms await – one potentially a tranquil master suite with a calming blue palette and ensuite bathroom, the other a cheerful guest room perhaps decorated in sunny yellows.  Both bathrooms boast modern fixtures and plenty of natural light.  In the evening, soft recessed lighting will cast a warm, inviting glow throughout the apartment. From the living room, perhaps a balcony offers breathtaking views of the city, a perfect spot for an evening coffee.  This is more than just an apartment; it's a lifestyle – a sophisticated blend of modern convenience and tranquil living, all wrapped up in a stunning space that feels like home from the moment you step through the door!",
    "3 BHK Apartment in Olympia Opaline (opposite Vivira Mall)": "Welcome, everyone, to your virtual preview of this stunning 3 BHK apartment in Olympia Opaline!  Step inside, and be greeted by a spacious foyer bathed in sunlight streaming from large windows overlooking the vibrant Vivira Mall. The open-plan living and dining area flows seamlessly, perfect for entertaining; imagine stylish, modern furniture arranged around a statement rug, creating a chic yet comfortable atmosphere.  The adjacent kitchen, envisioned with sleek, white cabinetry and stainless steel appliances, offers a bright and airy workspace.  From here, discover three generously sized bedrooms – perhaps one a tranquil master suite with an ensuite bathroom boasting a calming spa-like ambiance, and the others perfect for family or guests, each with its own unique character. Soft, warm lighting in the evening creates a cosy haven, accentuating the clean lines and sophisticated design.  Picture yourself relaxing on the balcony after a long day, maybe enjoying a morning coffee while taking in the bustling energy of the city below, or a quiet evening with a glass of wine, as the sunset paints the sky in fiery hues.  This apartment, with its prime location, ample space, and thoughtful layout, is more than just a home; it's a lifestyle upgrade!",
    "3 BHK Apartment in Olympia Opaline (near OMR Navalur)": "Step inside, and let the warm sunlight streaming through the east-facing windows of this stunning 1792 sqft, 3 BHK apartment in Olympia Opaline wash over you!  A spacious foyer welcomes you, hinting at the airy elegance to come.  The open-plan living and dining area flows seamlessly, perfect for entertaining, perhaps with a chic modern sofa set against a backdrop of tasteful, neutral tones.  Imagine evenings here, bathed in the soft glow of recessed lighting, the city lights twinkling in the distance. The modern kitchen, just off the dining area, is bright and functional, perhaps featuring sleek granite countertops and stainless steel appliances.  Down the hallway, three generously sized bedrooms offer tranquil retreats; picture the master suite with its ensuite bathroom, a spa-like oasis complete with underfloor heating and a rainfall shower.  The other two bedrooms are equally inviting, each with its own unique personality.  This beautiful apartment, complete with secure car parking, offers more than just a home—it's a lifestyle upgrade, a breath of fresh air near OMR in Navalur, a perfect blend of city convenience and peaceful modern living, all for ₹1.4 Crores.",
    "3 BHK Apartment in Harmony": "Step inside, and let the warm sunlight streaming through the south-facing windows of this stunning 3 BHK apartment wash over you!  A welcoming foyer immediately draws you into the spacious living area, where gleaming hardwood floors reflect the light and the airy layout invites you to relax. Imagine a plush, cream-colored sofa nestled against a wall adorned with coastal-themed artwork, perfectly complementing the subtle ocean breeze you can almost feel. Flowing seamlessly from the living room, the dining area is bathed in sunshine, its large window offering captivating views of the bustling Rajiv Gandhi Salai.  The modern kitchen, just beyond, is a chef's dream, complete with sleek countertops and ample storage, ready for your culinary creations.  Down the hallway, three generously sized bedrooms promise peaceful retreats – perhaps one with a tranquil, spa-like bathroom and another, a lively, colorful space for children. Soft, ambient lighting would illuminate the evenings, creating an atmosphere of calm amidst the city's energy.  The entire apartment breathes a sense of sophisticated modern living, a true haven of comfort and style, enhanced by the convenience of assigned car and bike parking.  From here, you’re a stone's throw from the vibrant OMR Food street and the aromatic delights of Dindigul Thalappakatti, the perfect ending to a perfect day in your new home!",
    "Dhana Teja Layout Plots": "Step inside, and let the warm coastal breeze greet you as you enter a sun-drenched foyer, the scent of sea salt carried in on the gentle ocean air.  Imagine the expansive living room, bathed in natural light from large windows framing breathtaking views of the ECR high road and perhaps even glimpses of the ocean. This open-plan design seamlessly flows into a stylish dining area, perfect for hosting gatherings, its polished wooden floor reflecting the warm glow of pendant lights. The kitchen, a modern masterpiece in sleek white and stainless steel, offers a picture window showcasing vibrant bougainvillea climbing the exterior wall. Beyond the living spaces, discover three exquisitely appointed bedrooms, each uniquely designed; one, perhaps, a master suite with a private balcony overlooking the beautifully landscaped garden, another a cosy retreat with soft, muted tones and a plush reading nook. Bathrooms are luxurious havens of calming marble and soothing earth tones. As twilight descends, picture yourself relaxing on the patio, the gentle hum of the ocean a constant companion, while soft, strategically placed lighting casts a warm, inviting glow over your luxurious new home, a sanctuary reflecting the unique charm of Mahabalipuram.",
    "G Square Dynasty Land": "Step inside, and feel the warm embrace of your future home!  A bright foyer welcomes you, bathed in the soft glow of natural light streaming through a large window, hinting at perhaps a charming garden view beyond.  The open-plan living area flows seamlessly into a delightful dining space, perfect for family gatherings, where you can imagine a sleek, modern dining set positioned under a stylish pendant light.  The kitchen, just off the dining area, promises culinary adventures, its layout designed for efficiency and ease.  Picture yourself preparing meals while catching the afternoon sun.  Down the hallway, two generously sized bedrooms await, one perhaps boasting a calming, neutral palette, the other vibrant and playful with pops of color.  The bathrooms, equally spacious, offer a serene retreat after a refreshing dip in the community swimming pool which you can easily picture from the property. In the evenings, the soft glow of recessed lighting will cast a warm, inviting ambiance throughout, while the lush greenery of the nearby park and the peaceful senior citizen sit-out add a sense of tranquil community living.  This is more than just a plot of land; it’s a canvas for your dreams, promising a vibrant and fulfilling life.",
    "Arun Excello Ziva": "Step inside, and feel the immediate sense of airy elegance!  A bright foyer welcomes you, bathed in sunlight streaming through large windows, hinting at the lush landscaping beyond.  The open-plan living room flows seamlessly into a chic dining area, perfect for hosting dinner parties under a statement chandelier.  Imagine the warm glow of recessed lighting in the evening, creating a cozy ambiance.  The modern kitchen, boasting sleek countertops and stainless steel appliances, beckons with culinary possibilities.  Down the hall, the master bedroom offers a tranquil escape, perhaps featuring a calming blue palette and a private balcony overlooking the sparkling pool.  The additional bedrooms, equally spacious and bright, are ready for personal touches. Bathrooms boast contemporary fixtures and promise soothing spa-like experiences. This Arun Excello Ziva home, whether a stylish apartment or a luxurious villa, is a haven of resort-style living, its vibrant atmosphere enhanced by the promise of the clubhouse and gym just steps away – a true escape from the everyday.",
    "ECR DTCP Plot (1,800 sqft)": "Step inside, and let the coastal breeze whisper a welcome!  Our virtual tour begins in a bright, airy foyer bathed in the warm glow of the north-facing sun, instantly filling you with the promise of a tranquil life.  The open-plan living area unfolds before you, seamlessly connecting the living room – perhaps envisioned with crisp white walls, rattan furniture, and pops of ocean-inspired blue – to a delightful dining space perfect for gatherings. Imagine the clinking of glasses and laughter echoing under a stylish pendant light as the sun dips below the horizon, painting the sky in vibrant hues.  The modern kitchen, subtly hinted at through the open layout, promises culinary adventures fueled by natural light streaming in from a nearby window.  Further down the hallway, two serene bedrooms await, one perhaps a master suite with calming ocean views, the other a cozy retreat for guests.  Envision soft lighting creating a haven-like atmosphere in each.  Bathrooms, each designed with clean lines and calming tones, offer moments of peaceful respite.  Step outside onto a small patio, where the scent of salty air mingles with the fragrant blooms of a carefully curated garden, and the sounds of the waves become your daily soundtrack.  This is more than just a house; it's the start of your coastal dream.",
    "OMR Nanjai Property (6,098 sqft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 5\n}\n]. Original: Own a piece of serene nanjai land on OMR, spanning 6,098 sqft. This north-facing plot enjoys a prime location near the ECR-OMR junction, with easy access to Mamallan School. Imagine building your dream home surrounded by lush greenery, yet still within easy reach of city conveniences.",
    "OMR Road Property (239,580 sqft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 3\n}\n]. Original: This expansive 239,580 sqft road property, located on the Mahabalipuram-Thirukazhukundram road, is a developer's dream. With a generous 450-foot frontage and layout land on both sides, the possibilities are endless. Its proximity to the Four Points Sheraton adds to its appeal.",
    "ECR DTCP Plot (1,883 sqft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 2\n}\n]. Original: Build your dream home on this north-facing, 1,883 sqft DTCP-approved plot. Overlooking the main road in Pattipulam, opposite Tiger Cave, this prime location offers the perfect blend of tranquility and accessibility.",
    "ECR Commercial/Residential Plot (3,593 sqft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 1\n}\n]. Original: This versatile 3,593 sqft plot on ECR is ideal for both commercial and residential purposes. Its prime location offers stunning views and easy access to Mahabalipuram, a UNESCO World Heritage Site.  Imagine creating a thriving business or a luxurious home in this sought-after location.",
    "KG Emerald Beach Plot (9,239 sqft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 59\n}\n]. Original: Located within a secure gated community on ECR, this 9,239 sqft plot offers a unique opportunity to own a piece of paradise. Imagine building your dream home amidst serene surroundings and high-end bungalows, with 24/7 security and easy access to the beach.  DTCP approval is in progress.",
    "State Highway Property (1,043 sqft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 58\n}\n]. Original: This north-facing 1,043 sqft plot is located on a state highway, adjacent to the Madras Football Club.  With convenient amenities like blacktop road, avenue trees, solar lights, and portable water, this plot is ready for your dream home construction.  Imagine enjoying the benefits of a well-planned community in a desirable location.",
    "Mahabalipuram Beach Property (10,799 sqft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 57\n}\n]. Original: Indulge in the luxury of beachside living with this 10,799 sqft plot near Radisson Blu in Mahabalipuram. Enjoy breathtaking views of the Bay of Bengal and direct access to pristine beaches. Imagine building your dream home in this prestigious location, perfect for creating unforgettable memories.",
    "Poonjeri Compounded Property (2,400 sqft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 55\n}\n]. Original: This fully compounded 2,400 sqft property in Poonjeri offers a tranquil escape, just a short drive from ECR and Chettinadu Hospital. With a reasonable price, excellent location, and good groundwater, this is a fantastic opportunity to build your dream home.",
    "3 BHK Beachfront Villa": "Welcome, everyone, to paradise!  As you step through the grand entrance, a breathtaking view of the turquoise ocean unfolds before you, a perfect introduction to this 14,400 sq ft haven.  A spacious foyer, bathed in sunlight streaming through floor-to-ceiling windows, leads into the open-plan living area, where plush, white sofas beckon you to sink in and savour the panoramic ocean vista.  The seamlessly integrated dining area, elegantly furnished with a sleek, modern table set for lavish dinners, flows effortlessly into a gourmet kitchen, its granite countertops gleaming under the soft glow of recessed lighting.  Three expansive bedrooms, each offering a unique sanctuary with either ocean or garden views, await – imagine waking up to the sound of gentle waves in one, or drifting off to sleep under the starry night sky in another.  The bathrooms, designed with spa-like tranquility in mind, feature soothing earth tones and rainfall showerheads.  As the sun dips below the horizon, the villa is transformed by the warm hues of sunset, reflected in the infinity-edge pool stretching out below.  The air is filled with the scent of tropical blossoms from the lush gardens surrounding the villa, creating a truly unforgettable atmosphere of luxurious coastal living.",
    "Kadambari Approved Land (13,000 sqft and 6,000 sqft)": "Step through the grand entrance and be greeted by a sun-drenched foyer, the cool stone floor a welcome contrast to the warm coastal breeze wafting in from the expansive windows.  This isn't just a house; it's the beginning of your dream estate, sprawling across your choice of either 13,000 or 6,000 square feet of idyllic land in tranquil Kadambari.  The open-plan living area flows seamlessly into a spacious dining area, perfect for hosting gatherings under a sparkling crystal chandelier. Imagine the aroma of coastal cuisine drifting from a modern kitchen, its sleek stainless steel appliances reflecting the abundant natural light.  Beyond the living spaces, discover generously sized bedrooms – perhaps one with a private balcony overlooking lush greenery, another with an ensuite bathroom featuring a deep soaking tub.  As evening settles, soft ambient lighting casts a warm glow, highlighting the natural textures and calming tones of your chosen décor, perhaps a blend of coastal chic and modern minimalism.  The tranquil atmosphere is enhanced by the plentiful groundwater, promising a vibrant garden where you can unwind and enjoy the serenity of your private estate.",
    "Arun Compact Homes Behag 1 Plot (600 sqft)": "Step inside and be greeted by a bright, airy foyer, flooded with sunlight streaming in from the large road-facing windows – imagine the vibrant energy of ECR just beyond!  The open-plan living area flows seamlessly into a charming dining space, perfect for intimate gatherings or lively dinner parties. Picture warm, honey-colored wooden flooring underfoot and perhaps a stylish, minimalist kitchen tucked neatly into a corner, its sleek countertops gleaming under soft, recessed lighting.  Two cozy bedrooms await, one potentially featuring a calming coastal theme with soft blues and whites, the other perhaps a more modern, vibrant space – each boasting ample natural light.  The bathrooms, though compact, promise a feeling of spa-like serenity, with perhaps a touch of elegant tiling and soft, ambient lighting for a tranquil evening escape. Imagine warm, inviting pendant lights casting a soft glow across the space in the evening, creating a truly inviting atmosphere.  This compact haven, with its clever use of space and potential for personalization, is an excellent investment brimming with possibilities and an effortlessly chic vibe!",
    "Arun Excello Compact Homes Triveni 2 BHK Flat (595 sqft)": "Step inside, and let the gentle sea breeze whisper a welcome as you enter this delightful ground-floor haven!  A charming foyer, bathed in the soft glow of natural light streaming through a large window, leads you into the open-plan living and dining area.  Imagine yourself here, nestled on a plush, seafoam-green sofa, a coastal-themed throw draped casually over the arm, while the sun paints the walls a warm, inviting hue. The dining area, elegantly set with a whitewashed table and rattan chairs, flows seamlessly into a bright, galley-style kitchen—perfectly equipped and ready for culinary adventures.  Two generously sized bedrooms await, one perhaps styled with calming blues and whites, the other a vibrant splash of sunshine yellow, both promising peaceful retreats.  Spotless bathrooms, featuring tasteful fixtures and plenty of natural light, ensure a refreshing start and end to each day.  As twilight descends, the warm glow of ambient lighting softly illuminates the space, casting a magical ambiance.  And then, there’s the patio—step outside onto your private oasis, where the gentle sounds of the ECR lap at the shore, creating a tranquil symphony. Breathe deeply, feel the coastal breeze on your skin, and let the magic of this move-in-ready apartment completely captivate you.",
    "ECR Beach Proximity Plot (2,400 sqft)": "Step through the front door and be greeted by a bright, airy foyer bathed in the warm glow of the morning sun, streaming in from expansive east-facing windows.  The open-plan living area unfolds before you, a symphony of coastal elegance. Imagine stylish, woven rattan furniture arranged around a crackling fireplace, perfect for cozy evenings.  The dining area, seamlessly connected, flows towards a sleek, modern kitchen boasting granite countertops and stainless steel appliances, all overlooking a sun-drenched patio with glimpses of the nearby ocean.  Two spacious bedrooms, each promising a tranquil retreat, lie down a hallway, one with a potential ocean view.  The bathrooms, envisioned with calming, spa-like details, complement the home’s breezy ambiance.  As the sun sets, soft, recessed lighting casts a warm, inviting glow across the space, highlighting the subtle texture of the walls and the ocean-inspired décor.  The entire 2400 sq ft plot hums with a vibrant energy, a testament to the luxurious ECR lifestyle just a short stroll from the beach. This isn't just a house; it's your seaside sanctuary.",
    "ECR Backwaters Plots (8,000 sqft each)": "Step inside and be instantly greeted by a sun-drenched foyer, the air alive with the salty tang of the nearby ocean.  Natural light floods the open-plan living area, showcasing polished wooden floors gleaming under the warmth.  Imagine yourself sinking into a plush, wicker sofa, a coastal-themed throw draped casually across its arm, while gazing out at the breathtaking view of the Palar backwaters shimmering just beyond the expansive patio doors.  The dining area flows seamlessly from the living space, perhaps furnished with a rustic, bleached-wood table perfect for lazy breakfasts overlooking the tranquil waters.  The kitchen, with its sleek white cabinetry and granite countertops, provides a bright and airy contrast.  Down the hallway, two generously sized bedrooms await – one possibly adorned with calming blues and whites, the other perhaps featuring a more vibrant, beachy palette.  Each boasts its own en-suite bathroom, offering a sense of private tranquility. In the evening, soft, recessed lighting will bathe the home in a warm glow, complementing the subtle ocean breeze that whispers through the open windows. The overall feeling is one of serene luxury, a place where the rhythm of life slows to match the gentle flow of the backwaters just outside your door.",
    "Arun Excello Compact Homes Triveni 2 BHK Flat (1,025 sqft)": "Step inside, and let the gentle sea breeze carry you into a sun-drenched foyer!  From here, the spacious living room unfolds before you, bathed in the warm glow of natural light streaming through expansive windows offering glimpses of the vibrant ECR. Imagine plush, coastal-themed furnishings – think creamy sofas, driftwood accents, and perhaps a touch of blue reminiscent of the nearby ocean.  Flowing seamlessly from the living room, the dining area awaits, perfect for al fresco meals with its access to a charming balcony overlooking the college grounds. The modern, open-plan kitchen, adjacent to the dining area, beckons with sleek countertops and stainless steel appliances.  Down the hallway, two generously sized bedrooms promise peaceful retreats, one possibly featuring a tranquil, spa-like bathroom with calming earth tones, while the other boasts a bright and airy feel.  As evening descends, soft recessed lighting casts a warm, inviting ambiance throughout the apartment, enhancing its inherent coastal charm. The overall feel is one of relaxed elegance, a perfect blend of comfort and sophisticated coastal living, with the added bonus of the stunning views and easy access to the lively atmosphere of Mahabalipuram just beyond your doorstep.",
    "Mahabalipuram Ready-to-Build Plot (9,600 sqft)": "Step through the grand entrance and be greeted by a breathtaking foyer bathed in the warm glow of natural light streaming through expansive windows.  The open-plan living area unfolds before you, a spacious haven designed for effortless entertaining.  Imagine sleek, modern furniture arranged around a statement fireplace, creating a cozy ambiance for evening gatherings, enhanced by subtle recessed lighting that casts a magical shimmer.  The dining area, seamlessly flowing from the living room, overlooks a lush, private garden accessed through French doors, bringing the tranquility of Mahabalipuram indoors. The gourmet kitchen, a chef’s dream, awaits with stainless steel appliances and granite countertops, all under a vaulted ceiling that adds to the sense of airy spaciousness.  Down the hallway, discover generously sized bedrooms, each a sanctuary of calm, perhaps decorated in a coastal theme with soothing blues and whites.  Bathrooms feature elegant fixtures and plenty of natural light, completing the picture of serene luxury. The entire home is enveloped in a feeling of peaceful seclusion, a true private retreat, perfectly reflecting the tranquil beauty of its surroundings, all within the security of a guarded, walled estate.",
    "Mahabalipuram Boat Club Opposite Land (174,240 sqft)": "Step through the grand entrance, and be swept away!  A wide, welcoming foyer unfolds before you, hinting at the expansive luxury to come.  Imagine soaring ceilings, perhaps adorned with a magnificent chandelier, casting a warm glow upon polished marble floors.  The open-plan living area flows seamlessly into a sun-drenched dining space, large enough for lavish gatherings, with floor-to-ceiling windows offering breathtaking, uninterrupted views of the Mahabalipuram Boat Club and the shimmering ocean beyond.  Natural light floods the space, illuminating the potential for stylish, coastal-inspired decor.  Picture yourself lounging on plush sofas, the gentle sea breeze drifting in through French doors leading to a private patio or garden oasis. The modern, sleek kitchen, a chef's dream, is effortlessly integrated into this flow, promising culinary adventures with ocean views.  Upstairs, spacious bedrooms, each a sanctuary of calm, await, potentially featuring ensuite bathrooms with rain showers and spa-like features. As evening descends, picture soft, ambient lighting illuminating the space, creating a tranquil atmosphere, perfect for quiet contemplation or lively celebrations. This is more than just a property; it's a vision of coastal paradise awaiting your personal touch, a place where luxury meets tranquility, and dreams take shape.",
    "Residential Plot with Villa Option (1,800 sqft)": "Step inside, and feel the warm embrace of your future villa!  The front door opens into a sun-drenched foyer, immediately drawing you into the expansive living area.  Picture this:  large windows flooding the space with natural light, showcasing perhaps a glimpse of the lush 28.3-acre community beyond. The open-plan living and dining area flows seamlessly, perfect for entertaining, with perhaps a stylish modern sofa set facing a biofuel fireplace for cozy evenings.  The adjacent kitchen, bright and airy, is a chef's dream, envisioning sleek cabinetry and stainless steel appliances.  Down the hallway, three generously sized bedrooms await, each offering a tranquil retreat.  Imagine a master suite with an ensuite bathroom boasting a luxurious soaking tub, while the other bedrooms offer ample space and natural light.  Soft, ambient lighting throughout creates a calming atmosphere, perfect for relaxation.  The entire villa exudes a modern, yet inviting feel, complemented by hints of coastal decor perhaps, bringing in the outdoor vibrancy. Stepping outside, you can almost imagine yourself enjoying the community's 40 world-class amenities, making this villa more than just a home, but a lifestyle upgrade!",
    "Vanavil Privilege Estate Plot (1,300 sqft)": "Step through the virtual doorway and be instantly transported!  A spacious foyer, bathed in the warm glow of natural light streaming through large, arched windows, welcomes you.  The open-plan living area unfolds before you, seamlessly connecting to a charming dining space perfect for al fresco meals on balmy evenings. Imagine a coastal-inspired décor here, with crisp white walls, rattan furniture, and splashes of turquoise. The modern kitchen, just off the dining area, gleams with stainless steel appliances and granite countertops, offering glimpses of the vibrant green garden beyond.  Two bright, airy bedrooms await, one with a serene ensuite bathroom showcasing elegant marble tiling and a rainfall shower; the other, potentially a guest room, painted a cheerful yellow, offers serene views.  As twilight descends, soft, ambient lighting accentuates the warm wood tones and the stunning sunset views across the coastal landscape, promising a truly tranquil escape.  The gentle sea breeze whispers through the open windows, promising the ideal seaside retreat – a haven of peace and coastal charm just a short drive from the bustling energy of Mahabalipuram.",
    "Mahabalipuram Dry Land (18,291 sqft)": "Step through the virtual gates and onto the expansive 18,291 sq ft of this Mahabalipuram gem!  Imagine a grand foyer, bathed in the warm glow of natural light streaming through expansive windows, welcoming you to your coastal haven. The open-plan living area flows seamlessly into a spacious dining area, already picturing stylish rattan furniture and perhaps a vibrant hand-painted mural depicting local scenes.  The kitchen, envisioned with sleek modern appliances and a large island, offers access to a potential sun-drenched patio overlooking lush gardens; the scent of frangipani and sea salt dances on the breeze. Beyond, several large bedrooms promise tranquil escapes, each uniquely designed, maybe with one boasting a luxurious ensuite bathroom and private balcony offering glimpses of the Bay of Bengal.  In the evenings, soft ambient lighting, perhaps twinkling fairy lights strung across the high ceilings, casts a magical ambiance, perfectly complementing the calming coastal breeze whispering through the open windows.  The possibilities are endless, the location unparalleled, and the potential for a spectacular coastal home, truly breathtaking.",
    "4 BHK Farmhouse (10,000 sqft)": "Step through the front door and be instantly greeted by a sun-drenched foyer, the scent of fresh paint mingling with the earthy aroma of the surrounding landscape.  The open-plan living area unfolds before you, a symphony of space and light.  Imagine oversized windows framing lush green views, perhaps a glimpse of the ocean in the distance.  Natural light dances across polished wooden floors, illuminating a comfortable seating area perfectly positioned for sunset viewing.  Flow seamlessly into the dining area, envisioning a farmhouse-style table set for a delightful family meal, the sounds of crickets providing a gentle background hum. The modern kitchen, with its sleek countertops and ample storage, lies just beyond, promising culinary adventures.  Down the hallway, four bedrooms offer personal retreats; picture soft linens, calming colour palettes, and perhaps a private balcony overlooking the expansive 10,000 sqft plot.  Bathrooms are havens of tranquility, each featuring modern fixtures and perhaps a hint of natural stone. As evening descends, picture warm, ambient lighting casting a golden glow, accentuating the rustic charm of the space; a perfect setting for quiet evenings and starry nights.  This isn't just a house; it's a sanctuary, a true escape, waiting to become your Mahabalipuram haven.",
    "MME Gold City 2 BHK Flat (1,200 sqft)": "Step inside, and be greeted by a spacious foyer bathed in the warm glow of natural light streaming through large windows!  The open-plan living area unfolds before you, boasting 1200 square feet of airy elegance. Imagine sleek, modern furniture arranged around a statement rug, creating a chic and comfortable space perfect for entertaining.  The adjacent dining area, easily accommodating six, flows seamlessly into a stylish kitchen, envisioned with granite countertops and stainless steel appliances.  Notice the subtle coastal vibe woven throughout – perhaps a driftwood accent piece or a splash of sea-foam green in the décor.  Down the hall, two generously sized bedrooms await, one potentially a tranquil master suite with its own en-suite bathroom boasting spa-like features.  The second bedroom, brimming with potential, could be a bright guest room or a home office. Soft lighting, perhaps recessed spotlights complemented by stylish floor lamps, will perfectly illuminate this inviting space in the evening, creating an atmosphere of calm sophistication.  And did I mention the stunning city views from the windows and the easy access to the vibrant coastal lifestyle of Old Mahabalipuram Road just beyond your doorstep?  This isn’t just a flat; it’s a lifestyle!",
    "DivaySree Hub6 Residential Plots in Thiruporur": "Step inside and be greeted by a bright, airy foyer bathed in sunlight streaming through large windows, hinting at the expansive views awaiting you.  The open-plan living room flows seamlessly into a spacious dining area, perfect for hosting gatherings, perhaps adorned with sleek, modern furnishings and accented with pops of vibrant color.  The adjacent kitchen, envisioned with stylish cabinetry and stainless steel appliances, beckons with the promise of culinary adventures.  Down a short hallway, discover two cozy bedrooms, one potentially featuring a tranquil, spa-like ensuite bathroom, while the other could be a playful haven for children, maybe with a built-in bookshelf and charming window seat.  Imagine evenings illuminated by soft, recessed lighting, creating a warm and inviting atmosphere, complemented by the gentle glow of strategically placed lamps.  The overall feeling is one of modern comfort blended with a touch of coastal serenity, perhaps reflected in subtle nautical-inspired decor, all while enjoying the peace of mind that comes with living in a thriving community, close to excellent schools and dining options, and on the cusp of enhanced connectivity thanks to the upcoming metro.  This isn't just a house; it's a thoughtfully designed space ready to become the heart of your dreams.",
    "LML Skyliving Tambaram": "Welcome to your future home at LML Skyliving!  As you step through the front door, you're greeted by a bright, airy foyer, bathed in the warm glow of natural light streaming from the large windows overlooking the meticulously landscaped grounds. The open-plan living and dining area flows seamlessly, perfect for entertaining. Imagine elegant, minimalist furniture enhancing the spaciousness, with perhaps a sleek, modern chandelier casting a soft, ambient light in the evenings.  The adjacent kitchen, envisioned with stylish granite countertops and modern appliances, beckons with the promise of culinary delights.  Two generously sized bedrooms await, each offering a tranquil retreat – one perhaps featuring a calming, neutral palette and the other a vibrant accent wall.  Both share access to well-appointed bathrooms, imagined with luxurious fixtures and plenty of natural light.  Step out onto your private balcony, and breathe in the fresh air, taking in the stunning cityscape views that stretch towards the horizon.  This isn't just an apartment; it's an elevated lifestyle, a seamless blend of sophistication and comfort, ready to welcome you to a life of refined leisure within this vibrant, sprawling community.",
    "VRX Magna Thirumazhisai": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 5\n}\n]. Original: Experience the future of living at VRX Magna, Tamil Nadu's largest smart home gated community in Thirumazhisai, Chennai. This under-construction 2 BHK apartment, spanning 567 sqft, is designed for convenience and cutting-edge technology. Imagine controlling your home's security, cooking appliances, and even housekeeping with just the touch of a button, thanks to integrated AI-based technology.  With the upcoming CMBT Metro Station, Airport, and a fourth integrated bus terminus nearby, this property offers not only a futuristic lifestyle but also a promising investment opportunity.",
    "Oblong Polaris Mogappair East": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 3\n}\n]. Original: Design your dream home and make it a reality at Oblong Polaris in Mogappair East, Chennai. This under-construction 3 BHK apartment offers 1435 sqft of carpet area, providing ample space for your vision to unfold.  Enjoy the semi-furnished convenience and two private balconies, perfect for sipping your morning coffee or enjoying a relaxing evening. Located in a hub of comforts, this exclusive apartment provides the ideal setting for creating the home you've always envisioned.",
    "GVSPL Mahameru Thiruvanmiyur": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 2\n}\n]. Original: Embrace well-being and premium living at GVSPL Mahameru in Thiruvanmiyur, Chennai. This ready-to-move-in 3 BHK apartment offers 1500 sqft of luxurious living space. Imagine yourself residing in one of the 32 exclusive units, spread across a stilt plus four floors. Surrounded by lush greenery and a serene environment, GVSPL Mahameru offers the perfect blend of tranquility and convenience, making it the ideal dream home for discerning individuals.",
    "RC Meadows Kadirvedu": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 1\n}\n]. Original: Discover your dream home at RC Meadows in Kadirvedu, Chennai. This under-construction 3 BHK apartment, set to be completed by June 2026, offers 1650 sqft of meticulously crafted living space. As one of only 90 limited edition super luxury apartments, RC Meadows promises a truly enriching lifestyle. Imagine residing in a towering landmark of architectural ingenuity, designed to breathe your individuality and adapt to your every dream.",
    "Provident Bayscape Kelambakkam (1006 sqft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 59\n}\n]. Original: Embrace contemporary living at Provident Bayscape in Kelambakkam, Chennai. This under-construction 2 BHK apartment, with possession by August 2028, offers 1006 sqft of thoughtfully designed living space.  Picture yourself in one of the 676 units spread across four towers, surrounded by 47% open area, ensuring ample light and ventilation. Enjoy a refreshing dip in the swimming pool or socialize at the state-of-the-art 10,000 sqft clubhouse, offering over 25 modern amenities. Provident Bayscape perfectly blends modern comforts and cultural heritage.",
    "Risland The Ace Perungudi": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 58\n}\n]. Original: Experience urban living at its finest at Risland The Ace in Perungudi, Chennai. This ready-to-move-in 2 BHK apartment offers 1247 sqft of sophisticated living space in the heart of the IT gateway on OMR.  Imagine being within walking distance of residential, IT, and leisure spaces, all connected by convenient public transport.  Benefit from the sustainable, safe, and green features of SSGF technology, and enjoy over 20 world-class amenities within a beautifully landscaped 4.27-acre development. The Ace provides the perfect balance of work and leisure.",
    "Provident Bayscape Kelambakkam (993 sqft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 57\n}\n]. Original: Embrace contemporary living at Provident Bayscape in Kelambakkam, Chennai. This under-construction 2 BHK apartment, with possession by August 2028, offers 993 sqft of thoughtfully designed living space.  Picture yourself in one of the 676 units spread across four towers, surrounded by 47% open area, ensuring ample light and ventilation. Enjoy a friendly game of badminton in the indoor court, catch a movie in the spacious mini-theatre, or show off your skills at the skating rink, all within the state-of-the-art 10,000 sqft clubhouse. Provident Bayscape perfectly blends modern comforts and cultural heritage.",
    "Jains Aadheeswar Manapakkam": "Step into Jains Aadheeswar, and be greeted by a bright and airy foyer, bathed in the warm glow of natural light streaming through large windows.  The open-plan living and dining area unfolds before you, spacious enough for both relaxed evenings and lively gatherings. Imagine a plush, cream-colored sofa nestled against a wall adorned with subtle, modern artwork, complemented by a sleek, glass-topped dining table perfect for family meals.  The adjoining kitchen beckons, possibly featuring granite countertops and stainless steel appliances, promising culinary adventures.  Down a short hallway, two cozy bedrooms await; picture one as a tranquil sanctuary with soft, muted tones and a window overlooking the peaceful community gardens, while the other is a vibrant space for children, perhaps with playful pops of color.  Both share access to beautifully appointed bathrooms, each with a calming ambiance enhanced by soft, recessed lighting. In the evening, warm, ambient lighting casts a gentle glow throughout the apartment, creating a truly homely and welcoming atmosphere within this private, gated community – a haven of affordable luxury, perfectly positioned for easy access to Chennai's vibrant life.",
    "Urbanrise City of Joy Thirumazhisai (897 sqft, Today)": "Welcome to your new urban oasis! Step inside and be greeted by a bright, airy foyer, bathed in the soft glow of morning sunlight streaming through the large windows.  The open-plan living and dining area flows seamlessly, perfect for entertaining; imagine stylish, minimalist furniture arranged around a statement rug, creating a sophisticated yet inviting atmosphere.  The sleek modern kitchen, just off the dining area, is a chef's dream, with stainless steel appliances gleaming under recessed lighting.  A private balcony beckons, promising breathtaking city views at sunset, the perfect spot for your evening coffee.  Down the hall, two generously sized bedrooms offer tranquil retreats; envision a calming master suite with soft, natural tones and ample closet space, while the second bedroom, painted a cheerful light blue, could be a perfect guest room or home office.  Both share access to a stylish bathroom with contemporary fixtures.  As evening descends, warm, indirect lighting illuminates the apartment, creating a cozy and intimate ambiance.  Experience the vibrant energy of Urbanrise City of Joy, a truly exceptional modern living space.",
    "Radiance Solitaire Madhavaram": "Step inside Radiance Solitaire and be greeted by a bright, airy foyer, sunlight streaming through a large window overlooking the bustling Chennai streets below.  The open-plan living and dining area flows seamlessly, perfect for entertaining; imagine a sleek, modern sofa set facing a wall-mounted smart TV, complemented by a stylish dining table for four nestled near a charming, Juliet balcony. The kitchen, just off the dining area, boasts contemporary cabinetry and stainless steel appliances – a chef's delight!  Down a short hallway, you'll discover two generously sized bedrooms, the master featuring built-in wardrobes and a potential en-suite bathroom with rain shower.  The second bedroom, bathed in soft light, could easily transform into a home office or guest room.  In the evening, subtle recessed lighting creates a warm, inviting ambiance, perfectly offset by the twinkling city lights visible from your private balcony, ideal for enjoying your morning coffee or evening breeze. This 699 sq ft haven exudes a feeling of modern sophistication and effortless urban living, promising a bright and stylish future.",
    "BC Mercury Pammal": "Step inside BC Mercury and be greeted by a bright, airy foyer, bathed in the warm glow of natural light streaming through large windows.  The open-plan living and dining area flows seamlessly, promising effortless entertaining. Imagine a chic, minimalist sofa set against a backdrop of a feature wall adorned with textured plaster, complemented by soft, recessed lighting for those cozy evenings. The adjacent kitchen, envisioned with sleek, modern cabinetry and stainless steel appliances, beckons with the promise of culinary adventures.  Down the hallway, two generously sized bedrooms await, one perhaps featuring a calming, neutral palette and built-in wardrobes, the other possibly styled with a vibrant accent wall and playful, contemporary furniture.  En-suite bathrooms, subtly designed with elegant fixtures and soothing color schemes, offer a tranquil escape.  Picture yourself enjoying your morning coffee on a small balcony, gazing out at the promising cityscape, while the robust red brick construction ensures a feeling of steadfast quality and security.  The overall atmosphere is one of sophisticated modern comfort, blending seamlessly with traditional durability; a true reflection of Chennai's vibrant spirit.",
    "Radiance The Prime Pammal": "Step inside Radiance The Prime and be greeted by a bright, airy foyer, bathed in the warm glow of natural light streaming through large windows.  The open-plan living and dining area flows seamlessly, creating a spacious and inviting atmosphere perfect for entertaining. Imagine a chic, minimalist design with sleek, modern furniture; perhaps a plush, grey sofa anchors the living room, facing a wall adorned with vibrant modern art. The dining area, adjacent and equally bright, could easily accommodate a large family gathering around a sleek, glass-topped dining table.  The kitchen, visible from the dining area, boasts a contemporary design with sleek stainless steel appliances – picture yourself whipping up culinary delights here!  Beyond the main living space, discover three generously sized bedrooms, each promising a peaceful retreat; one could be a luxurious master suite, complete with an ensuite bathroom featuring a rainfall shower and perhaps even a soaking tub for those blissful evening moments.  The other two bedrooms, equally well-appointed, are ideal for children or guests.  Two private balconies beckon with stunning views – imagine enjoying your morning coffee amidst a refreshing breeze, the city stretching out before you.  As evening descends, soft recessed lighting and stylish pendant lamps create a warm and intimate ambience.  This is more than just an apartment; it's a haven of modern elegance, ready to welcome you home in 2031.",
    "Urbanrise City of Joy Thirumazhisai (897 sqft, Mar 24)": "Step inside Urbanrise City of Joy and be greeted by a bright, airy foyer, sunlight streaming through the large windows overlooking the vibrant Thirumazhisai community.  The open-plan living and dining area flows seamlessly, perfect for entertaining – imagine a sleek, modern sofa set facing a wall showcasing vibrant Chennai-inspired artwork, complemented by soft, recessed lighting for evening gatherings. The adjacent kitchen, envisioned with sleek white cabinetry and stainless-steel appliances, offers a modern, functional space. From here, step out onto your private balcony, ideal for that morning coffee, enjoying a refreshing breeze, or simply watching the city awaken. Two generously sized bedrooms, one perhaps with a calming, minimalist aesthetic and the other featuring a bolder, more playful style, offer peaceful retreats.  Both bathrooms boast contemporary fixtures, finished with stylish tiling and gleaming chrome.  Soft, warm lighting throughout the apartment creates an inviting ambiance, enhancing the overall sense of modern comfort and convenient city living.  The entire 897 sqft space exudes a relaxed yet sophisticated atmosphere, promising a lifestyle that perfectly blends urban convenience with the peace and comfort of home.",
    "BRIGADE ICON Mount Road": "Step inside and be captivated!  The grand entrance reveals a spacious foyer bathed in sunlight streaming through a wall of elegant windows, hinting at the city views to come.  From here, the open-plan living area unfolds, a symphony of sleek, modern lines and warm, natural tones.  Imagine a plush, cream-colored sofa facing a wall-mounted flatscreen, perfect for movie nights, complemented by tasteful abstract art.  The dining area flows seamlessly from the living room, easily accommodating a large table for grand gatherings – perhaps with a stunning cityscape panorama as the backdrop.  The contemporary kitchen, just beyond, is a chef's dream, complete with stainless steel appliances and ample counter space, ready for culinary adventures.  Three generously sized bedrooms, each with its own distinct character, await; one might feature a serene, spa-like bathroom with a soaking tub, perfect for unwinding after a long day.  Three balconies beckon, offering breathtaking panoramic views of the bustling city below.  As twilight descends, imagine the warm glow of recessed lighting enhancing the apartment's sophisticated ambiance, while the city lights twinkle like a constellation below. This is more than just an apartment; it’s a luxurious urban sanctuary.",
    "KG North Bay Tondiarpet": "Step inside KG North Bay and be instantly captivated!  The spacious foyer welcomes you with gleaming marble floors, hinting at the luxurious lifestyle awaiting.  To your right, the living area unfolds, bathed in the warm glow of sunlight streaming through expansive windows offering breathtaking panoramic views of the Chennai coastline and city skyline. Imagine sinking into a plush, cream-colored sofa, perhaps sipping a cool drink as the sun sets, painting the sky in vibrant hues. Flowing seamlessly from the living room is the elegant dining area, perfect for hosting dinner parties, envisioned with a sleek, modern dining table set against a backdrop of tasteful coastal-inspired décor.  The kitchen, just beyond, promises modern convenience with stylish cabinetry and plenty of counter space. Three generously sized bedrooms beckon, each potentially a sanctuary of calm; picture soft, muted tones, perhaps natural wood furnishings, and ample natural light creating a sense of airy tranquility. Two luxurious bathrooms, one en-suite, offer a refreshing escape.  Downstairs, the grand open podium awaits – a shimmering pool under the Chennai sun, surrounded by lush greenery, providing the perfect space for relaxation and socializing. This is more than just an apartment; it’s an experience, a sophisticated blend of modern luxury and serene coastal living.",
    "Alpha Signature by EK HOMES Medavakkam": "Step inside, and be greeted by a bright and airy foyer, bathed in the warm glow of natural light streaming through large windows.  The open-plan living and dining area flows seamlessly, creating a spacious and inviting atmosphere.  Imagine yourself lounging on a plush, modern sofa, the soft sunlight illuminating the sleek, minimalist décor, perhaps with pops of vibrant colour adding a touch of personality. The modern kitchen, just beyond, beckons with its sleek countertops and ample cabinetry – envision preparing a delicious meal while enjoying the natural light. Down the hall, two generously sized bedrooms offer tranquil retreats, one perhaps featuring a calming, neutral palette and the other a bolder, more playful aesthetic.  Each is complemented by a stylish bathroom, immaculately tiled and fitted with contemporary fixtures.  In the evening, soft recessed lighting creates a warm ambiance, highlighting the sophisticated craftsmanship of this premium space.  Later, you could stroll through the well-maintained community grounds to enjoy the dedicated kids' play area, or perhaps test your skills in the indoor games room, and then rejuvenate at the modern gym – all before returning to the peaceful haven of your new Alpha Signature apartment.",
    "Nest Mojo Padur": "Step inside Nest Mojo and be greeted by a bright, airy foyer, sunlight streaming through large windows overlooking the bustling OMR.  The open-plan living and dining area flows seamlessly, perfect for entertaining; imagine a sleek modern sofa set against a backdrop of city views, complemented by a stylish dining table ready for lively gatherings. The kitchen, just off the dining area, is a chef's dream, perhaps with sleek white cabinetry and stainless steel appliances.  Down the hall, three generously sized bedrooms await, each offering a haven of tranquility.  Picture the master suite with a calming, spa-like bathroom featuring soft lighting and a relaxing soaking tub. The other two bedrooms could easily be transformed into cozy retreats, perhaps with vibrant pops of color and built-in wardrobes.  In the evenings, imagine the apartment bathed in warm, ambient lighting, creating a welcoming atmosphere.  After a workout in the state-of-the-art indoor gym or a refreshing dip in the shimmering swimming pool, you can unwind in the comfort of your luxurious new home, a true reimagining of modern living, ready for you in October 2025!",
    "SIS Florence Porur": "Step inside SIS Florence and be greeted by a bright, airy foyer, sunlight streaming through large windows overlooking the meticulously landscaped 1-acre township.  The open-plan living and dining area flows seamlessly, perfect for entertaining; imagine a chic, modern dining set bathed in warm evening light from recessed spotlights, complemented by a minimalist living area with plush sofas facing a wall-mounted smart TV.  The kitchen, just off the dining area, is a chef’s dream – sleek countertops, stainless steel appliances, and ample storage – promising delicious culinary adventures. Down the hall, three generously sized bedrooms await, each offering a tranquil retreat.  Picture soft, neutral tones, perhaps a calming coastal theme in the master suite with its ensuite bathroom, while the other two bedrooms offer flexibility for a home office or children's rooms, each with its own unique ambiance. Throughout the apartment, the thoughtful design and robust quality shine through, creating a feeling of both luxury and comfort.  The natural light that floods the space during the day is beautifully enhanced by soft, ambient lighting in the evenings, casting a warm and inviting glow across the entire home, making SIS Florence feel less like an apartment and more like a haven.",
    "Tulive Azpire Tambaram West": "Step inside Tulive Azpire and be greeted by a bright, airy foyer, sunlight streaming through expansive windows that already hint at the breathtaking suburban views awaiting you.  The open-plan living and dining area flows seamlessly, perfect for both grand entertaining and cozy evenings in.  Imagine a chic, minimalist design, perhaps with light oak flooring and pops of vibrant colour in carefully chosen artwork. The modern kitchen, just off the dining area, beckons with sleek countertops and stainless-steel appliances, ready for culinary creations.  Down the hallway, three generously sized bedrooms promise tranquil escapes, each potentially styled with calming earth tones and plush furnishings.  Bathrooms boast sophisticated fixtures and plenty of natural light.  As dusk settles, picture warm ambient lighting illuminating the space, casting a gentle glow on carefully chosen decor, enhancing the feeling of luxurious comfort.  This isn't just an apartment; it's a sanctuary, a 1278 sqft haven of elegance nestled within the vibrant energy of Tambaram West, ready to welcome you home in March 2025.",
    "Risington Phase 2 OMR": "Step inside, and be swept away!  The grand entrance of your future 3-BHK apartment in Risington Phase 2 welcomes you into a spacious foyer, bathed in the warm glow of natural light streaming from large windows overlooking the meticulously landscaped grounds.  The open-plan living and dining area flows seamlessly, promising elegant evenings illuminated by a stunning crystal chandelier. Imagine hosting dinner parties, the laughter echoing against the high ceilings. The modern kitchen, a chef's dream, awaits, complete with sleek countertops and stainless steel appliances, perhaps even a breakfast bar overlooking the bustling city below.  Three generously sized bedrooms, each a sanctuary of tranquility, offer ample space for personalized retreats.  Bathrooms boast sophisticated fixtures and calming colour palettes; picture yourself unwinding in a luxurious soaking tub after a long day.  Soft, ambient lighting will transform the space into an oasis of calm at night, complementing the upscale decor hints of perhaps cool blues and crisp whites, reflecting the sophisticated atmosphere of Central OMR.  And with 1617 sq ft of pure elegance, this isn't just an apartment; it’s a statement.  This is elevated living at its finest.",
    "Urbando Kosmos Solaris Siruseri": "Step inside, and *wow*!  The grand entrance of your future Urbando Kosmos Solaris villa welcomes you into a spacious foyer bathed in the warm glow of natural light streaming through expansive windows.  The open-plan living area flows seamlessly into a chic dining space, perfect for hosting unforgettable evenings. Imagine a sleek, minimalist dining table set against a backdrop of subtly textured walls, illuminated by a modern pendant light. The kitchen, just off the dining area, promises culinary adventures with its stylish, sustainable cabinetry and gleaming countertops.  Further down the hallway, discover three tranquil bedrooms, each offering a private sanctuary.  Picture yourselves drifting off to sleep in the master suite, perhaps adorned with calming earth tones and furnished with a plush king-size bed, waking to those breathtaking green views from your private terrace.  The bathrooms, finished in elegant marble, offer a spa-like retreat. As evening descends, soft ambient lighting washes over the villa, creating a tranquil and inviting atmosphere – a perfect blend of contemporary sophistication and eco-conscious serenity. The entire space is infused with the fresh, vibrant energy of nature, thanks to the generous windows and the promise of stunning sunsets over the lush landscapes visible from your private terrace.  This isn't just a house; it's a luxurious, sustainable haven.",
    "Ashiana Vatsalya Paranur": "Step inside, and be greeted by a bright, airy foyer, bathed in the warm glow of natural light streaming from large windows offering breathtaking panoramic views of rolling hills!  The open-plan living and dining area flows seamlessly, perfect for entertaining; imagine elegant, minimalist furnishings enhancing the spaciousness, perhaps a stylish grey sofa facing a wall showcasing captivating landscape artwork. The modern kitchen, just off the dining area, beckons with sleek cabinetry and stainless steel appliances, a culinary haven for retirement relaxation.  Down a short hallway, discover three generously sized bedrooms, each promising a tranquil retreat; picture soft, natural light, potentially complemented by soothing, earth-toned palettes and calming bedside lamps.  The bathrooms gleam with contemporary fixtures, hinting at luxurious spa-like retreats.  As evening descends, imagine soft, recessed lighting creating a warm ambiance, highlighting the beauty of the space and those exceptional city views glittering in the distance. The entire flat exudes a sense of peaceful luxury, a perfect blend of tranquility and vibrant city proximity—your serene sanctuary within Ashiana Vatsalya's lush 4.8-acre oasis.",
    "DRA Inara Navalur": "Step inside and be greeted by a bright, airy foyer, the polished marble floor reflecting the sunlight streaming through the expansive windows.  The open-plan living room flows seamlessly into a sophisticated dining area, perfect for hosting elegant dinners, perhaps with a chic, minimalist chandelier casting a warm glow in the evening.  The modern kitchen, just off the dining area, beckons with sleek countertops and stainless steel appliances, promising culinary adventures.  Down the hallway, three generously sized bedrooms offer tranquil retreats; imagine the master suite with its own private balcony overlooking the lush community gardens, bathed in the soft light of the setting sun.  Each bathroom is a spa-like sanctuary, ready for your personal touch – perhaps a calming, neutral palette with elegant fixtures. The overall atmosphere is one of refined luxury, a testament to DRA Inara’s commitment to elegance and comfort;  the gentle breeze from the sprawling six-acre community whispers promises of peaceful evenings and vibrant social life, all within the vibrant energy of Navalur, OMR.",
    "VGN Richmond Towers Guindy": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 7\n}\n]. Original: Experience luxury living at its finest at VGN Richmond Towers in Guindy, Chennai. This under-construction 2 BHK apartment, with possession by January 2028, offers 1032 sqft of aesthetically designed living space.  Imagine residing in a grand symphony of luxury, surrounded by lung space and greenery in one of Chennai's most prominent commercial and residential hubs.",
    "G Square Aranya Porur": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 5\n}\n]. Original: Experience convenient living at G Square Aranya in Porur, Chennai. This under-construction 2 BHK villa, set to be ready by March 2025, offers 1000 sqft of well-designed living space. Located along a major arterial road, G Square offers excellent access to key destinations, including a major traffic junction and a prominent business hub.  Imagine enjoying a perfect blend of convenience and proximity to essential amenities.",
    "Urbando Evorise Perumbakkam": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 4\n}\n]. Original: Embrace lavish and peaceful living at Urbando Evorise in Perumbakkam, Chennai. This under-construction 3 BHK apartment, with possession by December 2032, offers 1243 sqft of well-designed living space.  Imagine residing in a modern apartment with fine elevation and access to world-class amenities, including a gaming arcade, futsal court, outdoor swimming pool with fire camps, beach-style volleyball court, and a spacious movie theatre/AV room.",
    "Casagrand First City Sholinganallur": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 3\n}\n]. Original: Experience first-class living at Casagrand First City in Sholinganallur, Chennai. This under-construction 2 BHK apartment, with possession by August 2025, offers 1004 sqft of comfortable living space within a stunning self-sustainable township.  Imagine enjoying state-of-the-art amenities and world-class features crafted for everyone, including a refreshing swimming pool and a cricket ground.",
    "Incor PBEL City Kelambakkam": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 1\n}\n]. Original: Enjoy undisturbed private moments and exuberant camaraderie at Incor PBEL City in Kelambakkam, OMR, Chennai. This ready-to-move-in 3 BHK flat offers 1425 sqft of lavishly designed living space with modern techniques and industry-best specifications.  Imagine enjoying access to a range of amenities, including a jogging and strolling track, outdoor tennis courts, a clubhouse, and a swimming pool.",
    "Plot for Sale in Mahabalipuram (2820 sq.ft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n}\n]. Original: Imagine building your dream home on this spacious 2820 sq.ft. plot in scenic Mahabalipuram.  Offered at 45.60 L, this plot offers ample space for a comfortable family home, complete with gardens and outdoor spaces.  Contact Aiythan for more details and to schedule a visit.",
    "Plot for Sale in Mahabalipuram (1200 sq.ft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 59\n}\n]. Original: A fantastic opportunity awaits with this 1200 sq.ft plot in Mahabalipuram, perfect for a cozy villa or a charming vacation home.  Priced at 26.50 L, this plot provides a great starting point for your real estate investment.  Reach out to Rakthi for more information.",
    "Plot for Sale in Mahabalipuram (4500 sq.ft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 57\n}\n]. Original: Looking for a larger piece of land? This 4500 sq.ft plot in Mahabalipuram, priced at 72 L, might be just what you need.  Envision a grand home or even a small development project on this generous plot.  Contact Meghamala for further details.",
    "Plot for Sale in Mahabalipuram (11000 sq.ft)": "Step through the grand entrance and be swept away!  Imagine a spacious foyer bathed in the warm glow of natural light streaming through expansive windows, offering tantalizing glimpses of the lush, 11,000 sq ft plot beyond.  The open-plan living area unfolds before you, a symphony of space and potential.  Picture sleek, modern furniture arranged around a statement fireplace, the perfect spot for cozy evenings.  Flowing seamlessly into the dining area, you can almost smell the tantalizing aroma of a seaside feast,  perhaps reflecting the property's Mahabalipuram location.  A state-of-the-art kitchen, gleaming with stainless steel appliances, beckons with culinary possibilities.  Down a hallway, envision several elegant bedrooms, each a sanctuary of tranquility, perhaps with en-suite bathrooms boasting luxurious soaking tubs and rain showers.  Imagine the soft glow of ambient lighting in the evenings, casting a warm, inviting hue across the space, creating an atmosphere of sophisticated coastal luxury.  Picture yourself relaxing on your private terrace, overlooking the sprawling grounds, a gentle sea breeze whispering secrets of the nearby ocean.  This is more than just land; it's a canvas waiting for your dreams to take shape.",
    "Sea-Facing Plot in Mahabalipuram (5000 sq.ft)": "Step inside and let the salty air of Mahabalipuram wash over you!  The expansive entrance opens into a bright foyer, flooded with natural light streaming from massive, sea-facing windows – your first glimpse of the breathtaking Indian Ocean. Imagine the gentle lapping of waves as a soundtrack to your life here.  The open-plan living area flows seamlessly into a stylish dining space, perfect for hosting unforgettable dinners with ocean views.  A modern, minimalist kitchen, envisioned with sleek granite countertops and stainless steel appliances, sits just beyond, effortlessly connected to the heart of the home.  Three spacious bedrooms, each designed with a calming coastal palette, offer tranquil retreats, while pristine bathrooms feature luxurious fixtures and perhaps even a soaking tub for ultimate relaxation.  In the evenings, warm, recessed lighting casts a gentle glow, enhancing the home's serene atmosphere, while the soft murmur of the ocean provides a soothing lullaby.  Picture yourself stepping onto a private patio, perhaps adorned with lush tropical plants, for breathtaking sunrises and sunsets.  This isn't just a plot; it's a dream waiting to be built, a haven of luxury and serenity nestled in the heart of beautiful Mahabalipuram, with the beach and ECR just a stroll away.",
    "Plot for Sale in Mahabalipuram (9000 sq.ft)": "Step across the threshold and be greeted by a sun-drenched foyer, the scent of salty sea air hinting at the nearby Mahabalipuram shore.  The expansive living area unfolds before you, a symphony of space bathed in the warm glow of natural light streaming through wide, floor-to-ceiling windows. Imagine a stylish, minimalist sofa set against a backdrop of creamy walls, complemented by the rich tones of a hand-woven rug.  The open-plan design seamlessly flows into a modern, sleek kitchen, perhaps with granite countertops and stainless steel appliances, where the scent of freshly brewed coffee mingles with the ocean breeze.  Beyond the kitchen, French doors lead to a sprawling garden, a verdant oasis perfect for al fresco dining under the stars.  Three generously sized bedrooms, each with its own ensuite bathroom – picture soft, linen-draped beds in calming earth tones and luxurious marble bathrooms, perhaps with a soaking tub to soak away the stresses of the day.  In the evenings, subtle recessed lighting casts a warm, inviting glow, creating a haven of tranquility.  The entire home breathes a coastal vibe, a balance of modern elegance and laid-back luxury, all set against the stunning backdrop of your private garden paradise and the captivating sounds of the Indian Ocean in the distance.",
    "Plot for Sale in Mahabalipuram (9600 sq.ft)": "Step inside, and feel the warm coastal breeze caress your face as you enter the expansive foyer of your potential dream home! Sunlight streams through tall, arched windows, illuminating polished terracotta floors that lead seamlessly into a bright, airy living room. Imagine yourself relaxing on a plush, white sofa, the gentle sound of ocean waves a constant companion as you gaze out at the breathtaking panoramic views of the Bay of Bengal.  A graceful archway opens into a sun-drenched dining area, perfect for hosting lavish dinners with friends, its elegant table already set for a magical evening. The modern kitchen, adjacent to the dining area, boasts sleek, stainless steel appliances and granite countertops, bathed in the warm glow of recessed lighting.  Down the hall, two spacious bedrooms await, one a tranquil haven with soft, muted blues and a private balcony offering serene garden views, the other a vibrant haven of sunshine with a playful, bohemian feel.  Both bathrooms feature a luxurious, spa-like ambiance, each with its own unique character. As evening descends, the home glows with warm, ambient lighting, casting a magical spell across the entire space, making this coastal haven the perfect sanctuary for you and your loved ones.",
    "Plot for Sale in Mahabalipuram (9000 sq.ft) - 90L": "Step through the grand entrance and be swept away!  Imagine a spacious foyer bathed in the warm glow of natural light streaming through tall, arched windows, hinting at the stunning ocean views just beyond.  The open-plan living area flows seamlessly into a sun-drenched dining space, perfect for entertaining, perhaps with a large, rustic wooden table set for a family feast.  The kitchen, envisioned in sleek, modern lines with granite countertops, connects effortlessly to both, making entertaining a breeze.  Imagine the scent of coastal breezes mingling with the aroma of delicious home-cooked meals.  Down the hallway, two generously sized bedrooms await, one possibly a master suite with its own private balcony overlooking the tranquil garden, the other a cozy guest room adorned with calming blues and whites.  Bathrooms gleam with elegant fixtures, and soft, ambient lighting creates a spa-like atmosphere in the evenings.  This expansive plot offers unparalleled space,  allowing for a home brimming with personality, where luxurious comfort meets the vibrant energy of Mahabalipuram.  Picture it: your personal haven, bathed in the warm glow of sunset, the rhythmic sound of waves a constant, soothing backdrop.",
    "Plot for Sale in Mahabalipuram (9200 sq.ft)": "Step through the grand entrance and be greeted by a sun-drenched foyer, the cool Mahabalipuram breeze whispering through the unseen but imagined open-plan design.  To your left, the expansive living room awaits, possibly featuring sleek, modern furnishings and floor-to-ceiling windows framing lush, vibrant gardens.  The natural light floods the space, illuminating perhaps a handcrafted wooden coffee table and comfortable seating arranged invitingly around a focal fireplace.  Flowing seamlessly from the living area, the dining space beckons, possibly with a large, rustic wooden table perfect for family gatherings under the glow of a dramatic chandelier.  The kitchen, a chef's dream, is envisioned with granite countertops, stainless steel appliances, and ample space for culinary creativity.  Beyond the main living areas, three spacious bedrooms promise tranquil retreats, each with its own distinct character; one perhaps boasting a luxurious ensuite bathroom with a deep soaking tub, while another might offer charming garden views.  Imagine soft, ambient lighting illuminating the space in the evenings, casting a warm, inviting glow on carefully chosen art and personal touches.  The entire home breathes serenity and openness, a luxurious sanctuary where indoor and outdoor living blend seamlessly, creating a true personalized paradise in the heart of Mahabalipuram.",
    "Plot for Sale in Mahabalipuram (6600 sq.ft)": "Step across the threshold and feel the warm Mahabalipuram breeze caress your face as you enter this expansive 6600 sq ft plot, already brimming with the promise of your dream home!  Imagine a spacious foyer, bathed in the golden light of the rising sun, leading into a bright and airy living room with soaring ceilings.  Picture large, picture windows framing lush tropical greenery, perhaps even glimpses of the ocean in the distance,  filling the room with natural light.  The open-plan layout flows seamlessly into a charming dining area, perfect for family gatherings,  where the scent of coastal spices and freshly brewed coffee mingles in the air.  A modern, well-equipped kitchen, perhaps with sleek white cabinets and a granite countertop, is just a step away, ready to inspire culinary creativity.  Down a tranquil hallway, you'll find generously sized bedrooms, each offering its own haven of peace and quiet; imagine soft, natural light filtering through gauzy curtains, creating a sense of calm.  The bathrooms, envisioned in soothing earth tones, promise moments of luxurious relaxation.  As the sun sets, imagine the soft glow of recessed lighting creating a warm ambiance, perfectly complemented by the gentle murmur of ocean waves in the distance, completing the picture of your perfect coastal paradise.",
    "Plot for Sale in Mahabalipuram (5600 sq.ft)": "Step across the threshold and be greeted by a sun-drenched foyer, the scent of sea salt hinting at the ocean just beyond.  The open-plan living area unfolds before you, expansive and airy, its high ceilings echoing with the promise of coastal breezes.  Imagine soft, sandy-hued furnishings – a plush sofa perfect for curling up with a book, a rustic wooden dining table ready for al fresco meals.  Large windows flood the space with natural light, showcasing glimpses of lush, meticulously manicured gardens, a private paradise bursting with vibrant blooms and swaying palms.  The kitchen, a chef's dream, beckons with its sleek, modern design and granite countertops.  Down the hallway, two generously sized bedrooms offer tranquil retreats, one possibly boasting a private balcony overlooking the gardens, the other bathed in the warm glow of the morning sun.  Bathrooms are equally inviting, picture crisp white tiles, perhaps a clawfoot tub in one, a walk-in shower in the other.  As evening descends, picture soft, ambient lighting casting a warm, inviting glow, creating the perfect ambiance for relaxation – the gentle murmur of the ocean a constant, soothing soundtrack to your coastal haven.",
    "Plot for Sale in Mahabalipuram (9800 sq.ft)": "Step inside, and let the warm Mahabalipuram sun greet you!  Imagine yourself in a grand foyer, the polished granite floor gleaming under the light pouring in from a wall of arched windows overlooking lush, meticulously kept gardens.  From here, the expansive living room unfolds, its high ceilings adorned with ornate plasterwork, hinting at a coastal-inspired design.  Natural light dances across the terracotta-tiled floor, illuminating potential spaces for plush sofas and perhaps even a grand piano.  The dining area flows seamlessly from the living room, envisioning a large, intricately carved wooden table set for lavish dinners.  A sleek, modern kitchen, with its granite countertops and stainless steel appliances, beckons nearby, hinting at culinary adventures.  Further down the hallway, discover three spacious bedrooms, each promising serene escapes.  Picture a master suite with a private balcony overlooking the gardens, bathed in the soft glow of evening lanterns.  The bathrooms are equally inviting, perhaps featuring a blend of traditional Indian artistry and contemporary luxury.  As evening descends, picture warm, inviting ambient lighting illuminating the space, enhancing the luxurious feel, creating a haven of tranquility on your very own spacious piece of Mahabalipuram paradise.",
    "Plot for Sale in Mahabalipuram (7000 sq.ft)": "Step inside and let the warm Mahabalipuram breeze greet you as you enter the expansive grounds!  Imagine a grand foyer, bathed in sunlight streaming through tall, arched windows, welcoming you into the heart of your future home.  The open-plan living area flows seamlessly into a spacious dining area, perfect for family gatherings, perhaps with a stunning, hand-carved wooden dining table as a centerpiece.  The kitchen, envisioned with sleek, modern cabinetry and a generous island, effortlessly connects to the living space, fostering a sense of togetherness.  Beyond the main living areas, picture three generously-sized bedrooms – one a tranquil master suite with an ensuite bathroom boasting a rainfall shower and potentially an ocean-view balcony, while the others offer cozy, sun-drenched havens.  In the evenings, soft, recessed lighting casts a warm glow, enhancing the home's luxurious ambiance.  Step outside to explore the sprawling 7000 sq. ft. plot, perhaps featuring a lush, tropical garden, a sparkling pool, and ample space for outdoor entertaining, all framed by the vibrant energy of Mahabalipuram's unique coastal charm. The possibilities are endless!",
    "Plot for Sale in Mahabalipuram (6000 sq.ft) - 54L": "Step through the grand entrance and be immediately captivated by the sprawling 6000 sq. ft. plot, whispering promises of coastal bliss!  Imagine a sun-drenched foyer, the gentle sea breeze carrying the scent of salty air and frangipani.  The open-plan living area flows seamlessly into a spacious dining room, perfect for hosting unforgettable gatherings, bathed in the warm glow of natural light streaming through expansive windows offering tantalizing glimpses of the ocean. The modern kitchen, sleek and stylish, beckons with the aroma of freshly brewed coffee, its design echoing the coastal theme with light-toned wood and pops of turquoise.  Further down the hallway, picture tranquil bedrooms, each a private sanctuary; perhaps one with a balcony overlooking lush gardens, another with calming ocean views, their ensuite bathrooms boasting luxurious rainfall showers. As evening descends, the soft glow of strategically placed recessed lighting and subtle uplighting creates a magical ambiance, enhancing the home’s inherent charm. This is more than just a plot; it's a canvas for your dream home, where the invigorating ocean breeze and the quiet beauty of a meticulously crafted garden collide.",
    "Plot for Sale in Mahabalipuram (10000 sq.ft) - 95L": "Step through the grand entrance and be swept away by the sheer potential of this expansive 10,000 sq. ft. Mahabalipuram plot! Imagine a sun-drenched foyer, the cool stone tiles beneath your feet, leading into a spacious living area with soaring ceilings and walls of glass framing breathtaking ocean views. Sunlight streams in, illuminating a chic, minimalist living space, perhaps adorned with driftwood accents and calming coastal blues.  The open-plan design seamlessly flows into a gourmet kitchen, envisioned with sleek granite countertops and custom cabinetry, perfectly positioned for entertaining.  Beyond, a formal dining area awaits, bathed in the warm glow of sunset through strategically placed windows. Down a hallway, picture three generously sized bedrooms, each a personal sanctuary – one perhaps a master suite with a luxurious en-suite bathroom featuring a soaking tub and rainfall shower, while the others boast bright, airy spaces perfect for guests or a home office.  In the evenings, soft recessed lighting casts a warm, inviting ambiance, enhancing the tranquil atmosphere and allowing the ocean breeze, rustling through imagined palm trees in a private garden, to create a truly unforgettable experience.  This is more than just a plot; it’s a dream waiting to be realized!",
    "Plot for Sale in Mahabalipuram (8200 sq.ft)": "Step across the threshold and be greeted by a sun-drenched foyer, the scent of salty air hinting at the ocean just beyond.  The expansive living area unfolds before you, bathed in the warm glow of natural light streaming through large windows framing breathtaking coastal views.  Imagine plush, cream-colored sofas arranged around a crackling fireplace, perfect for cozy evenings.  The flow is seamless; the living room opens gracefully into a spacious dining area, where a large, rustic wooden table awaits, ready for memorable family dinners.  A modern, open-plan kitchen, complete with sleek granite countertops and stainless steel appliances, sits just beyond, a chef's dream space overlooking the tranquil garden.  Down a hallway, you'll find generously sized bedrooms, each a haven of tranquility, potentially featuring calming ocean-blue color palettes and calming window seats.  Bathrooms boast spa-like amenities, promising relaxation after a day spent exploring the nearby beaches.  As evening descends, picture soft, ambient lighting casting a warm, inviting glow, perfectly complementing the home's coastal chic aesthetic. The entire space breathes an air of relaxed luxury, a sanctuary where the calming rhythm of ocean waves meets the comfort of your dream home.",
    "Plot for Sale in Mahabalipuram (6800 sq.ft)": "Step across the threshold, and breathe in the salty air – you're home!  This expansive 6800 sq ft plot in Mahabalipuram practically whispers possibilities. Imagine a grand foyer bathed in sunlight streaming through tall, arched windows, leading you into a spacious living area with soaring ceilings.  The open-plan design seamlessly connects the living room, elegantly furnished with rattan and teak pieces reflecting the coastal charm, to a bright, airy dining area perfect for family feasts.  The kitchen, a culinary haven, opens onto a sun-drenched patio, ideal for al fresco meals overlooking a lush, meticulously landscaped garden.  Down a hallway, two generously sized bedrooms await – one, a tranquil master suite with a private balcony overlooking the ocean, the other a cheerful space, perhaps decorated in bright blues and whites.  Picture soft, ambient lighting in the evenings, casting a warm glow over the polished floors and creating a serene atmosphere.  The bathrooms, sleek and modern, offer a luxurious escape after a day spent exploring the ancient temples nearby.  This is more than just a plot; it's a canvas for your dream home, a sanctuary where the vibrant energy of Mahabalipuram meets the tranquility of your own private oasis.",
    "Plot for Sale in Mahabalipuram (7200 sq.ft) - 72L": "Step through the grand entrance and be captivated!  A spacious foyer bathed in the warm glow of natural light welcomes you, hinting at the expansive living areas to come.  Imagine sleek, modern furnishings in the open-plan living room, seamlessly flowing into a sun-drenched dining area perfect for al fresco meals on a sprawling patio overlooking lush gardens. The kitchen, envisioned with high-end stainless steel appliances and granite countertops, beckons with the promise of culinary delights.  Down the hallway, two generously-sized bedrooms await, one perhaps a tranquil retreat with soft blues and whites, the other a vibrant space bursting with personality.  Modern, spa-like bathrooms with rainfall showers complete the picture. As evening descends, picture soft, ambient lighting casting a warm hue across the polished floors, highlighting the potential for personal touches and creating a serene ambiance.  The vast 7200 sq ft plot allows for a personalized paradise, filled with the sounds of the ocean breeze and the sights of the stunning Mahabalipuram sunsets – a true sanctuary away from the bustling world.",
    "Plot for Sale in Mahabalipuram (5000 sq.ft) - 45L": "Step through the grand entrance and be greeted by a spacious foyer, bathed in the warm glow of sunlight streaming through a high, arched window – a perfect prelude to the coastal paradise awaiting you.  Imagine the open-plan living area extending before you, perhaps furnished with sleek, modern furniture in calming whites and blues, perfectly complementing the ocean views hinted at through the large windows.  The dining area, elegantly separated by a subtle change in flooring, flows seamlessly into a state-of-the-art kitchen, imagined with granite countertops and stainless steel appliances gleaming under recessed lighting.  Down the hall, two generously sized bedrooms offer tranquil escapes, one possibly featuring a luxurious en-suite bathroom with a walk-in shower, while the other boasts a charming balcony overlooking meticulously landscaped gardens.  As twilight descends, picture the warm, inviting glow of strategically placed ambient lighting casting a soft, romantic ambiance throughout. The entire home breathes a fresh, airy atmosphere, infused with the gentle sea breeze and the promise of unforgettable coastal sunsets, a true sanctuary by the sea.",
    "Plot for Sale in Mahabalipuram (2400 sq.ft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 6\n}\n]. Original: This 2400 sq.ft plot in Mahabalipuram, available for 38.40 L, offers a great starting point for building your dream home. With enough space for a comfortable dwelling and outdoor spaces, this plot offers a balanced investment opportunity. Contact global india propertys to learn more.",
    "Plot for Sale in Mahabalipuram (1200 sq.ft) - 7.20L": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 5\n}\n]. Original: An affordable 1200 sq.ft plot in Mahabalipuram is listed at 7.20 L. This plot represents a great investment opportunity in a sought-after location. Contact global india propertys for further details and to schedule a visit.",
    "Plot for Sale in Mahabalipuram (3000 sq.ft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 3\n}\n]. Original: This 3000 sq.ft plot in Mahabalipuram, priced at 21 L, offers a balance of space and affordability. Build your dream home with room for gardens and outdoor amenities.  Contact global india propertys for details and to schedule a site visit.",
    "Plot for Sale in Mahabalipuram (630 sq.ft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 2\n}\n]. Original: A compact 630 sq.ft plot in Mahabalipuram is now available for 5.29 L.  This plot is perfect for a small vacation home or a starter home.  Contact global india propertys for more information.",
    "Plot for Sale in Mahabalipuram (1000 sq.ft) - 6L": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 1\n}\n]. Original: A 1000 sq.ft plot in Mahabalipuram is available for sale at 6 L.  This plot provides a good foundation for building a cozy home in a beautiful coastal town. Contact global india propertys for more details.",
    "Plot for Sale in Mahabalipuram (600 sq.ft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 59\n}\n]. Original: This compact 600 sq.ft plot in Mahabalipuram is offered at an affordable price of 5.04 L. This plot represents a great entry point into the Mahabalipuram real estate market. Contact global india propertys for further details.",
    "Plot for Sale in Mahabalipuram (1200 sq.ft) - 19.20L": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 58\n}\n]. Original: Another 1200 sq.ft plot in Mahabalipuram is available for purchase, listed at 19.20 L. This plot offers a good starting point for building a comfortable home. Contact kolanjikumaran for details and to schedule a site visit.",
    "Plot for Sale in Mahabalipuram (6000 sq.ft) - 96L": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 57\n}\n]. Original: A spacious 6000 sq.ft plot in Mahabalipuram is offered at 96 L. This sizable plot provides ample room for a luxurious family home or a vacation getaway. Contact kolanjikumaran for more information.",
    "Plot for Sale in Mahabalipuram (3240 sq.ft)": "Could not generate tour due to API error: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 55\n}\n]. Original: This 3240 sq.ft plot in Mahabalipuram, available for 51.84 L, provides a great opportunity to build a personalized living space in a tranquil environment. Contact global india propertys for more information and to schedule a site visit.",
    "Plot for Sale in Mahabalipuram (4500 sq.ft) - 72L-Ready to Move": "Step right in and let your imagination run wild!  Picture yourself entering through a grand, arched doorway, the warm Tamil sun streaming through stained-glass panels depicting vibrant local flora.  A spacious foyer welcomes you, its polished terracotta floor hinting at the coastal vibes to come.  To your left, the expansive living room unfolds, already furnished in your mind’s eye with rattan furniture and breezy linen curtains, offering glimpses of a lush, meticulously landscaped garden through large French doors.  The seamless flow leads you into a sun-drenched dining area, perfect for al fresco meals, where you can almost smell the salty air and hear the gentle lapping of waves. The modern, open-plan kitchen beckons with sleek granite countertops and stainless steel appliances, promising culinary adventures.  Down a hallway, three generously sized bedrooms await – one a serene master suite with ensuite bath and private balcony, the others bright and airy, perfect for family or guests.  Imagine soft, ambient lighting highlighting the natural textures of the walls and the calming hues of the ocean-inspired decor.  This isn't just a plot; it's a canvas for your dream home, a sanctuary by the sea, bathed in the golden light of Mahabalipuram's enchanting sunsets.",
    "Plot for Sale in Mahabalipuram (4800 sq.ft)": "Step inside!  As you cross the threshold, a spacious foyer welcomes you, bathed in the warm glow of sunlight streaming through strategically placed windows.  The expansive living area unfolds before you, potentially featuring  sleek, modern furniture against a backdrop of calming, coastal-inspired colours, perfectly complementing the abundant natural light.  Picture yourself relaxing on a plush sofa, perhaps with a view of a lush, meticulously landscaped garden beyond the expansive windows. Flowing seamlessly from the living area is a bright dining space, envisioning elegant meals shared under a beautiful pendant light fixture. The kitchen, just a few steps away, promises culinary adventures with ample counter space and perhaps a charming breakfast nook overlooking the garden. Down a short hallway, discover three serene bedrooms, each promising restful nights – perhaps one master suite with a private balcony and two guest rooms with cheerful pops of colour.  The bathrooms, imagine them with chic fixtures and calming tile work.  As evening descends, imagine the soft glow of strategically placed recessed lighting transforming the space into a tranquil haven. The overall feeling is one of airy spaciousness, a perfect blend of indoor and outdoor living, offering a tranquil escape in the heart of Mahabalipuram."
}